{
    "scores_before": 0.25437221787091235,
    "scores_after": 0.25640652169458006,
    "outputs_before": [
        "Lucy and Sue are talking about JK. Sue tries to avoid it. Lucy thinks JK is disgusting. Sue listens to the radio in the mornings.",
        "Simon is painting his cupboards green. Angela is meeting Chris. Wendy is having a lazy weekend. Ben is in the garden.",
        "Petra is in lectures all day. She will call Zack back in the lunch break. She can type and read but she can't listen or talk.",
        "Amelia wants to go shopping tomorrow. Anna can't because she has to meet her study group in the morning. She is visiting her grandma who turns 86. She has to do some work because she is behind and has to make up for it by Monday. In the evening, she has to help her mum cleaning windows. Am",
        "Niki and Jeanna are talking about Angel. Angel has a boyfriend. Angel is disgusting and eats in front of the teacher.",
        "Gabriel is picking up his new car today. It cost 55k. It's a Mercedes-Benz, sedan, 180hp, 0-100 kmh in 6.2 seconds.",
        "Danny and Kate are bored. Danny heard that Frank and Sue are dating.",
        "Jenna is cooking tonight. She is going to cook chicken in Indian style. Lilly and Eaton will join her.",
        "Maria is moving to Costa Rica next month.",
        "Monica is coming home at 6. Larry is coming home at 7:30.",
        "Adam, Kim and Kris are discussing about the Christmas presents. They all agree that it's better to have a list of things they'd like to get for Christmas. Adam is saving up for a stereo system and wants his parents to contribute a bit. Kim and Kris are going to talk to their parents about the Christmas presents",
        "Deb missed seeing Danie when she visited Melbourne last month. Danie would love to visit Deb some time.",
        "Irma will take the garbage when she goes out.",
        "Lane and Cadence are talking. Cadence is going to send Lane something funny. Lane is going to sleep.",
        "Sandy wants to join Tina. Tina is writing an essay. Sandy is asking Tina about the essay. Tina is writing a psychological essay. Sandy is asking Tina how many pages she has written. Tina has written 5 pages. Sandy is asking Tina to close Facebook and enjoy tonight.",
        "Dirk told Molly about a commercial on 680 about disability claims. Molly is not applicable for short, cause she gets weekly allowance from her insurance. Molly will see if she can get her loss of wages back. Molly's lawyer works that way too. Molly has to stay strong.",
        "Anna and Zoe are talking about Zara's dress.",
        "Robbie is inviting Kris to a board game night on Friday. Kris is not sure if he wants to go, but Robbie is trying to convince him.",
        "Donald is asking Scofield where Mike is. Scofield is telling him that Mike is not at home.",
        "Esme has finished a project.",
        "Diana is a new neighbor of Linda. She is from the grey house. They are waving to each other.",
        "Bernie's wife will be out of town for a couple of days. Chris and Marty will come over to Bernie's house on Friday after work.",
        "Shelly's kid Taylor found out there was no Santa. Diane misses the Santa days.",
        "Katie is in front of the door.",
        "Kate's boyfriend Matt fell off his bike and has a broken leg. Simon sprained his toe yesterday.",
        "Frank is going to IKEA to get furniture stuff for their kids. He might get something special for Morris, his bday is coming up. They need some new lamps. They have a deal this week. Eliza needs a new lamp for Jeanine before she goes to school.",
        "Noel hates cyclists. They blocked the city centre on Friday night during rush hour. Noel was supposed to have a meeting with a client, but she's on the other side of town. Noel and Oliver will grab a few beers at the usual place.",
        "Leo and Evie are talking about Miley's new song.",
        "Pamela's dad has just come from the police station. He hired Jack, a guy who was in jail for fraud. Jack begged Pamela's dad to pay back his debt. Pamela's dad thought he became another man. He cut down his salary for a few months for the amount of money he asked Pamela",
        "Amber lost her flower necklace at the party yesterday. Gabriel will look for it in his flat. Amber fell asleep in Glen's car. Mariah found Amber's necklace in her pocket.",
        "Mike and Jack are playing RDR2. Jack is halfway through.",
        "Leah, Gary and Maggie are excited about the new track. They want to go to a concert.",
        "Martha received a message from Jessie's boyfriend. He told her that she looked cute in the green dress. Samantha and Fiona think that Jessie should know that Tom is an asshole.",
        "Brandon wants to see a movie with Sheila and some others on Saturday.",
        "Leda, Gaby, Ivan and Marc are going to the Venice Biennale. They will go to Arsenale.",
        "Rose bought a new jacket.",
        "Amy, Oli, Deborah and Adrienne are going to Spoons at 5:30.",
        "Larisa is waiting for Hubert to wash the spoons and vacuum the hall.",
        "Marie loves Tamara's T-shirts.",
        "Tessa and Austen are going to write letters.",
        "Lin is bored and can't sleep. Samuel is sleepwalking and typing to Lin.",
        "Griff and Tea are going to meet in the park in 10 minutes.",
        "Patricia wants to meet Jacob and Kate this week. Jacob and Kate have plans for most of the week. Patricia's father has his 50th birthday in two weeks. Jacob and Kate are free on Wednesday after work. Patricia will let them know tomorrow.",
        "Alan is going to visit his dad in the afternoon.",
        "Sharon is looking for Harry. He was at the canteen at lunchtime with Benjamin and Ali. He left the building about 30 minutes ago to get his hair cut. The system has just collapsed, so they need him.",
        "Hannah's friend is taking medication for her health issues. She's going to do some additional tests this week. Patty is worried about her.",
        "Steve is waiting for the technician.",
        "",
        "Henning and Max are discussing about waiters/waitresses in Italy and France. Max thinks that there are no huge differences throughout Europe. Henning thinks that Italian waiters are much nicer and much less professional than in Germany. Max thinks that all those theories say more about their authors than about the waiters and the countries.",
        "Lisa is asking Dan how he is. Dan is much better now.",
        "Angelica is feeling a bit ill.",
        "Terry is looking for a physiotherapist in Carlisle. Jennifer recommends David, who helped her with her spine.",
        "Julian apologizes for the cancellation of the performance tonight at Blind Goose. The tickets will be refunded. The performance will be rescheduled for next Tuesday, weather permitting.",
        "Conrad is pissed off because Frank forgot to meet him.",
        "Taylor is waiting for Owen.",
        "Andy is sorry for yelling at Laura. He ordered sushi and bought a bottle of her favorite wine.",
        "Ann is going to buy a new dishwasher for her mom. July and Gus are going to the cinema.",
        "Fanny wants to make an appointment with Carol on Friday at 3.30 pm.",
        "Mark will work from 6pm onwards today and from 2pm-9pm tomorrow. He's off on Saturday. Ann and Mark will meet at Ann's place at 11am on Saturday to decide what to do.",
        "Isabel is planning a trip to New York. She is looking for Italian restaurants. Gina recommends Barbuto, Café Altro Paradiso and Via Corota.",
        "Adam is looking for a band name. He found a song that Samantha likes. He wants to buy a CD for her. Brian suggests asking Lizzy.",
        "Howard's sister Claire got a job at a cafe that employs only people with special needs.",
        "Dianne is upset with Andy because he told her he was making a lot of money. Barrett thinks it's not important.",
        "Paul, Joe and Rob are going to an escape room on Friday.",
        "Meryl is going to the gala. Clint is not going. Roberta is working there.",
        "Miles had a dream where he was stuck in the 80's. He couldn't figure out how to get back to 2018.",
        "Edward is upset with his mom because she gave the money he gave her for her birthday to her new boyfriend who lost it all gambling.",
        "Jose passed his driving test.",
        "Lenny and Thomas agree that the movie Venom is going to be rubbish.",
        "Luke, Chloe and Jack are going to the party. Jack will drive Chloe's car.",
        "Violet has read Austin's article and thinks Claire might find it interesting.",
        "Joseph is sorry about what happened to Carlos' mates. Carlos says that it's not the first time this kind of things happen in Argentina. People can get really violent when it comes to football.",
        "Gemma forgot her keys. Suze will let her in her office.",
        "Kela and Cher are friends. Kela is sending Cher some photos of her birthday in Vietnam. Cher is missing Kela.",
        "Pete is coming home. He's been in a line. Nicole is making dinner.",
        "Jacqui has a new idea for a website. It's a self-learning institute called the Institute of Self-Tuition. The site would provide an introduction to the areas of learning within a topic and what to look out for, links to books on Amazon for that topic graded by difficulty, links to selected YouTube videos",
        "Stephanie and Victor are going to see Captain Marvel together.",
        "Jill and Jack are talking about their upstairs neighbors who are having sex again. Jack is jealous because Jill's husband is away. Jack is going to a meeting tomorrow.",
        "Charles thinks long distance relationships don't work. Jim thinks if she's a cold bitch, she won't admit it and he'll be faithful while she's not.",
        "Michael and Jane have seen the last episode of the TV show they like. They both enjoyed it.",
        "Andy's car has been hit when it was parked. Sharol will pick up Mary from university.",
        "Caroline is in Basel tomorrow. She wants to buy some more art. Blake prefers to invest in art than diamonds now. Hans and Reinhard are on the yacht in Monaco.",
        "Carol's computer stopped working. She needs help. She's going to call Bill.",
        "Diana's mother passed away one year ago. Danielle's mother was a communist and was fighting in the resistance movement. She met Danielle's father in 1943. He was also a communist. He was killed one year after Danielle was born. Danielle's mother was with a few men",
        "Adalyn and Nora are going to sign up for self-defence classes for women.",
        "Mat is waiting for Chris to finish his work. Chris will be done in 20 minutes. Mat is working on his presentation.",
        "Cass is ordering pizza for dinner. Drew is out. Braden and Mickey are in.",
        "Wendy and Diana are planning a surprise party for Pam's birthday.",
        "Peter is home already. Liz will be home before 6. They will watch Netflix and do nothing.",
        "Scott is back in Uganda. Sasha is going to a party with her mates from the uni.",
        "Kyle has finished reading the new D&D expansion. Stephen, Carol and Josie want to check it out.",
        "Boyle moved out because he was tired of living with his mom. He moved to Stonehenge with his buddy from work.",
        "Cora, Kaylee and Lydia are going to a spa.",
        "Sasha is asking Dean to print out her essay on modernism.",
        "Ralph has never heard of the company \"Venque\". Charles has. He thinks the company's products are very stylish but expensive.",
        "Gera and Hope will meet at 2.",
        "Fiona will be picked up by Tom after work. Tom might be a little late because of a meeting at 5.",
        "Caron found the Beautiful South on her Tidal app.",
        "Susanne, Lilly and Rachel are going to a concert.",
        "Dora can't come to the party because her mom is ill.",
        "Rebekah is home. She had a great time with Gianni. They hope to repeat it soon.",
        "Cliff congratulates Connie on her graduation.",
        "Greg owes Frank 100 in total. Jane paid 80 for the photos and frames.",
        "Jack hates Christmas. Nate prefers Easter.",
        "Mackenzie found a photo of Hailey in a magazine. Hailey is a professional model and she's married.",
        "Tessie is on the train to Frankfurt airport. She didn't manage to phone Merce last night. She put flowers on the grave for her husband's birthday. Merce didn't have any flowers or candles, but she put a small pink stone on the tombstone.",
        "Matilda wants to go to the movies with Dillon tomorrow.",
        "Marion liked the food last night. Amya didn't.",
        "Fred wants to know if Zach has booked the flight. Zach hasn't booked it yet. Fred is worried that Zach will overpay if he waits too long. Zach is checking for deals every day and will buy the flight soon.",
        "Ceil needs help with French. Keyon sends a photo.",
        "Zoe found 4 kittens in the bushes. She will keep them in the laundry room.",
        "Alex passed his exam. Monica will have her exam next Tuesday.",
        "Kevin is selling his car. Rob will ask his friends. Greg doesn't like Kevin's car. Kelly asks if Kevin has sorted out the mess inside.",
        "Hector has cancelled the party because Yuri's rabbit, Nivea, has passed away. Yuri is really upset and needs some time alone.",
        "Henry and Ruby are discussing the Me Too movement.",
        "Kayla and Tom are watching the Great British Bake Off. Kayla is cheering for Bryony, while Tom is cheering for Ruby.",
        "Jenny and Will are going to spend New Year's Eve in the South.",
        "Paul is on board. Anne wishes him a safe flight. Paul will call Anne when he lands.",
        "Jeanette and John are talking. Jeanette is from Kokologo, Burkina Faso. John is from Warsaw, Poland. Jeanette's dad used to work at a dam in Kokologo, but he fell off of it and there was no water in it.",
        "James and May are discussing the burglary at their place. The police are there to take James' statement. The burglars took the TV, some stuff from the kitchen and a laptop. The police will investigate the case.",
        "Pearl is going to wear her old ballroom dancing costume from 1968. Vince is going to wear his old student outfit. Pearl is going to take a selfie.",
        "Jenny is going to buy cheese, crackers, and chutney for Matt's parents on Friday.",
        "Nick and Ralph will meet later.",
        "Tito found a recipe for pickling vegetables. He's going to pickle veggies next week. He's going to teach Peppa and Rose how to do it.",
        "Scott and John will meet at Oculus at 7.30.",
        "David is asking Terry to submit his work. Terry apologizes for the delay and says he has finally caught up.",
        "Chris and Amka are going to stay in for Halloween. Mick is also going to stay in. Chris and Amka are not going to do anything special. Chris is not going to dress up, carve pumpkins and so on. Chris is going to go to the cementary with his family on November 1st. Amka",
        "Bary and Kate are going to meet at 3:00 in the park in Wilanów.",
        "Becky, Erin, Eva and Irene are going to the beach. They are going to the infinity pool at 3. They are going to Hotel Vista de Olas.",
        "Sue and Paul are talking. Sue's dad is fine but his legs are giving him gip. Sue has an interview next week in Port Talbot. Paul saw Russell Howard in Birmingham last weekend.",
        "Laila is working on her laptop. She's afraid she'll get drunk tomorrow because of her work. Davon is going to a haunted house tomorrow. Laila is taller than Davon.",
        "Hilary and Mandy's children start school tomorrow. Max is happy and Lisa is a little scared.",
        "John and Mike are talking about the movie \"Bohemian Rhapsody\". John had a fight with Martha.",
        "Caroline and Monica are talking about Ed Sheeran's concert. Caroline says that there are no more tickets for Ed's concert. Monica is shocked. Caroline says that the tickets sold out in two days. Monica says that it's strange. Caroline says that everyone is offstream nowadays. Monica says that someone",
        "Kevin has a plan.",
        "Tommy is going to the Strand Bookstore to buy a gift for Jane. He is confused about what to buy. Jane suggests buying a comic book. Tommy found a feminist comic book about abortion.",
        "Jools had a tooth removed. She's feeling odd and her head hurts. She can't eat or drink anything hot today. She's going to Tesco to buy some cool cocktails. She'll tell Kim in 2 hours if she's doing anything tonight.",
        "Francis, Jason and Lara are going to read two chapters of a book.",
        "Diana Voss and Ms. Hobbs are talking. Diana Voss and Ms. Hobbs are in Frankfurt. Diana Voss is arriving in the evening. Ms. Hobbs will turn the heating on in their apartment.",
        "Ashley is coming behind the building in 5 minutes.",
        "David, Monica and Nina are discussing how to split the electricity bill. David will make some calculations and send them over.",
        "Dominika is drunk and wearing a dress.",
        "Susie is taking a break in five minutes.",
        "George is going to be late because of a traffic jam in Austria. He is close to Kufstein.",
        "Tim asks Amanda how Des is. Amanda says that Des is usually sleeping and driving her crazy. Tim says that Des is lovely. Amanda says that Des is a devil in cat skin when he's awake.",
        "Rebecca and Logan will meet at Zach's place at 6.15. They will leave by 7AM to get to the mountain by lunchtime.",
        "Filip wants to ask Alienor to translate a manual from English to French. The manual is written by Filip's father for a device he is manufacturing. The customer from Africa claims to speak English but they seem not to understand it. Their main language is French. Alienor is happy to translate it.",
        "Magda and Piotr are discussing the march in the city center. Piotr is going to a party through the city center. Magda is upset about the march.",
        "Magdalene is going to the cocktail party this Sunday. Josephine is not sure yet. Jamie is sick.",
        "Hannah got a new jacket. She's going to impress a guy at her office.",
        "Jess is sick and can't meet Tom today. They will meet next Tuesday.",
        "Jason is asking Alba if she is coming for dinner with her mom.",
        "Lennie and Daddy are looking out of the window. Lennie is happy because it's going to be a white Christmas.",
        "William is mad at Elizabeth because she told Tom that he won the contest.",
        "Thomas is buying a ticket to Paris for 26 Dec. Evan is flying on 27 Dec. Thomas found a flight for €25.",
        "Pam asks whose turn it is to throw the garbage away. Don says it's Ron's turn. Ron confirms he will do it when he comes home.",
        "Sabrina is going to be a form teacher starting September. She's not sure if she's going to like it or not.",
        "Eve and her neighbours want to move to New Zealand next year. The family from the destroyed island will move there too. Sam thinks it's too late to do anything. Sam thinks the government should have a plan where to resettle them.",
        "Terry and Karen are planning a birthday party for Travis. They are inviting 8 people. Terry has booked a place for them. Terry and Karen are going to buy a gift for Travis.",
        "Karen wants to know if Judy and Irwin want to go to Roma next month. Irwin is going, but Judy has other plans.",
        "Paul is late sending a file. He will have a copy tomorrow. There will be a short presentation tomorrow. Jake is sure that they will like it.",
        "Kitty and Jill are happy that they don't have morning class on Tuesday. Kimberly doesn't know when they will make up for it. Jill hopes it won't be on the weekend.",
        "Jeremy is asking about Professor Xavier. Jake is asking why. Joselyn says that he broke his leg. Jeremy is asking if there will be no classes for them. Jake is saying that they will have a substitute teacher.",
        "Emily is looking for a language school near her. Cory and Jem are helping her.",
        "Lyla doesn't like animal shows. Tab is watching Dynasties.",
        "Carlie's child has started to walk a few steps today. Rylen's child is still on the bed. Rylen's child says \"Mama\" and \"Dada\". Carlie's child eats Cerelac. Rylen's child eats fruits.",
        "Anna wishes Anton a Happy Thanksgiving.",
        "Sue is annoyed with Aj because he was late.",
        "Brooke failed her exam. She's worried she might be kicked out of the university. She's failed three exams. She's going to take the exam again next year. She's going to find a tutor. Emily's cousin used to do tutoring. Brooke's parents will kill her if she'",
        "Michelle wants to know how Byron is treating Linda. Linda is working on a copywriting deadline and will be going straight to bed. Michelle will send her what she needs to talk about in the morning.",
        "Stanley and Angela are planning a get-together on Saturday. They will meet at Angela's place. Dymitr is in Ukraine and he's not sure when he's going back. Przemek is free on Saturday evening, unless his father asks him to visit him in Warsaw and to take care of kids for",
        "Fiona's phone battery is about to die.",
        "Esther and Stacy were supposed to meet yesterday, but Stacy missed it because she got confused about the days. Esther is upset because she missed Doris's wedding.",
        "Harry is going to buy flowers or chocolates for his lady.",
        "Ollie is asking Jake where the store is. Jake is not answering. Ollie is asking Jake to pin him. Jake is not answering.",
        "Lilly and Olivia are talking about Bill's eye operation. Bill had an emergency operation on his eye due to retina displacement. There were 5 tears in the retina. The doctor is happy with the progress after a week of recovering the eye. Bill can see some fuzzy outline of objects. Colour is dist",
        "Rick and Evelyn are planning a surprise party for their friend. They are discussing the music for the party.",
        "Linda is worried that she might have left the iron on at home. Jeff is not at home at the moment.",
        "Nancy wants Giovanni not to turn on the light when he comes home. Giovanni is not coming home tonight.",
        "Harold brought cookies to the office for his last day.",
        "Phillip wants to borrow Elizabeth's car to impress a girl he met. Elizabeth is not happy about it.",
        "Lidia is waiting outside Tesco. Tom and Caesar are inside Tesco. They are almost done.",
        "Clarissa has a beautiful view.",
        "Alejandra's neighbourhood is almost completely inundated. Pepe and Aaron are at work.",
        "Jay wants to give Martha a ride to Mark's party tonight. Martha is a bit worried about showing up at the party together with Jay, but she agrees to go. Jay's car is finally in.",
        "Mary is home.",
        "Harry, Anne, Tom, Edward and William will collect 20 per person for a present for Mia.",
        "Tony and Mirko are waiting for Ellen in their apartment in Puerto del Rosario.",
        "Hugo is going to get Leon 2 or 3 beers and Elliot a sprite.",
        "Tom woke up Peter. They are meeting at 8.00.",
        "Pat wants to eat Dad's salad. Dad needs it for tomorrow. Pat is hungry.",
        "Andrew is organizing a CEMS party.",
        "Terry read Danielle's short story and liked it.",
        "Jake apologizes to Reese for what he said yesterday. Reese doesn't want to talk with him. Jake wants to do anything for Reese to forgive him.",
        "Hannah wishes Rosie good luck with her exam. Rosie is not sure if she is ready for it. She has been studying for a long time and she thinks she will just go to bed and rest.",
        "Kamil and Thomas are going bowling tomorrow.",
        "Aston and Mona are going to Japan in 3 months. Mona owes Aston 600 euros for the plane tickets.",
        "Ted wants to bring Ally with him. Portia and Agatha are looking forward to seeing her.",
        "Gavin and Roy are going to a concert of a new band.",
        "Peterson's assistant is cute.",
        "Jim is trying to call Jane, but Jane is busy. Jane will call Jim around 8.",
        "Emma is going to visit her parents and grandma for Christmas.",
        "Mark sent Alex a photo of Frank.",
        "Paula wants to hang out with Rosa this weekend. Tim can't make it because he has to work. Rosa suggests going to the movies and having a drink. Paula and Rosa will have a girls night.",
        "Jacob, Charlie, Alfie and Leo are planning to buy a gift for John's son. They are considering a rocker or a teddy bear.",
        "Robert and Sandy are going to the cinema at 7:15.",
        "Caleb is coming to Nancy's place this evening. The weather is bad, but they will have each other.",
        "Kate hasn't been on Facebook for a week. Dan and Ben have tried it. Dan and Ben are moving to Canada.",
        "Mel is in Lille. She is busy. She will call Sophie tomorrow at 11am.",
        "Steven and Greg are discussing the rumors about the Davis trade.",
        "Alene is looking for a swimming suit in a XXXL size. Jake says they have swimming suits in their shop, but the biggest size they have is XL.",
        "Alina is worried about Jason. He hasn't been in touch with her since he changed his job.",
        "Malia and Jax are going to Jacob's home. Jax will not sing in the car.",
        "Joanne and Tracy are planning a party.",
        "Bill is on his way to the rugby practice.",
        "Bruno and Fatima are going on a trip tomorrow. They will be picked up by Elisabeth at 7 a.m. They will arrive at their destination at about 10 p.m.",
        "Linda can't find the small knife with a yellow handle. Charles took it to the garage. He will bring it home when he's back from work.",
        "Emily broke one of Linda's green tea cups. Linda doesn't mind.",
        "Tammy is looking for a birthday gift for Tina. She found a grey t-shirt.",
        "Priya was on a radio show live across London today re: her congress and they asked where else she would recommend. She gave Lisbeth a mention too.",
        "Clair and Bob have found the answer to the question. They need to respond to it with their whole force.",
        "Greg has cancelled his reservation for 6 people at 9:00pm.",
        "James is getting married this weekend and he needs a wedding date. He asks Nicky and Carrie to be his wedding date.",
        "Victor and Tom are discussing about studying abroad. Victor's sister is having the same problem. Tom is saying that she has to make that decision alone.",
        "Conny wants to swim in the pool. Jo doesn't mind.",
        "Karine has scheduled the celebration for June 30th. Eleonore will participate with 3 people. Jane's participation is still uncertain.",
        "Melissa has just landed in Rome. She's sick and tired. Ann and Joan will meet her tomorrow.",
        "Mia and Olivia are discussing Ella's engagement to an older man. They think that Ella will break up with him soon.",
        "Chloe's dad is in the hospital. He will be there for at least a week. Chloe can visit him at 6 pm.",
        "Alex is going shopping.",
        "Luana sent a photo to Roy and Tori. Roy thinks it's cool and suits Luana. Tori agrees.",
        "Don saw Anna in class today. She wasn't feeling well and left during the class.",
        "Kim is settling in her new place. She will get her schedule from school tomorrow. She will call her mom tomorrow.",
        "Kelly went on a date with Tom yesterday evening and thought he was going to propose. She didn't tell him that she had booked a table at a very popular restaurant weeks in advance.",
        "Luke and Bryan are upset about Manchester United's loss against Valencia. They will play against Liverpool on Sunday.",
        "Roman found a wallet on the street. He wants to keep it. Klaus advises him to call the owner.",
        "Ann wants to know where Martha bought her green dress. Mary thinks that Martha bought it in Reserved.",
        "Noah is driving to Leeds for the music festival on Friday evening. He has two spaces left in the car. Charlie and Benjamin are coming with him. Benjamin will be picked up from work on Friday.",
        "Blair, Dale and Tiffany are discussing VR.",
        "Phil has passed away.",
        "Sally found an online resource of all the freedom of information FBI files. Dom is going to check it out once he gets home from work.",
        "Graham recommends a stand-up comedian to Hank.",
        "Tony is looking for a present for Mary.",
        "Harry will be late for the date. He will be 30 minutes late. Gina will wait for him at the cafe.",
        "Ian has lost his English notebook. Mark has found it in his backpack.",
        "Memphis has heard a new song by Quavo. Gigi will look for it when she gets to the WiFi.",
        "Jenni is going to meet Megs at the local pub.",
        "Liam is asking David about a box. David is in Poland and his granny passed away. He will find the box after he returns.",
        "April didn't sleep well tonight. She slept well when she was at Matt's place. Matt and April bought a very expensive and soft mattress. Matt and April bought a mattress without trying it first.",
        "Ford will pick up Gary and Gerard at 6.30 PM.",
        "Ingrid and Bart are discussing the decorations in their house. Ingrid has put up the tree and Sammie has decorated it. Bart thinks it looks funny. Ingrid will try to change it when Sammie is asleep. Bart asks if Sammie has also done the nativity scene. Ingrid says it's Noah'",
        "Ben is looking for Jamie's friend who was at Don's party yesterday. Barbara is not that person.",
        "Emma asks if all her friends live in Cambridge. Rebecca, Jack and Leland don't live there anymore. Leland lives in Norwich now. It takes him 1h20min to get to the uni by car or train.",
        "Adam is asking Mary to cover for him today. Mary can't do it because Gill has a flu. Joe will cover for Adam.",
        "Jessica is going to meet her parents tonight. She is not sure what to wear. Judith advises her to wear the turquoise dress and the second pair of shoes.",
        "Issy is stuck on her French homework for Miss Piggy. Meg did her homework about her family. It's due tomorrow.",
        "John is inviting Mike and Chris to watch a game at his place at 5 pm. Mike is free and will be there. Chris is not sure when it is.",
        "Adam has seen Dizzy's latest clip. Mark thinks it's brilliant.",
        "Luke wants to know the best time to visit Mine. Molly suggests early autumn to see all the colours. Luke is surprised by the colours. Molly says there are very few conifers in New England, so in autumn you have this amazing brilliance of colours, from red to yellow and everything between. Luke is impressed by the beauty of the",
        "Alexa and Ruben Cesar are standing next to each other in the CCBB.",
        "Theresa is back at the office. Nina and Connie had a lot of fun at the beach. They are planning on going again in 6 months.",
        "Joyce and Maria saw something funny.",
        "Ryan wants to know if there's milk left. William doesn't know. Chad says there's still some, but they're running out.",
        "Ryan asked Puck about the name of the movie they watched yesterday. Puck told him it was \"Fantastic Beasts: The Crimes of Grindelwald\".",
        "Sam and Alice are planning a board games night at the Game Pub situated near Palace of Science and Culture on Friday night at 9pm. Paul, Christie and Nate are joining them.",
        "Perry is looking for someone working in EY. Josh knows a guy who has a junior position there. Perry wants to know how it is to work there. Josh will tell the guy to reach out to Perry.",
        "Cris is at the store. Eve asked for some advil.",
        "John is cooking and George is feeding his cat. George will bring his boardgames and buy John a pack of Marlboro Gold cigarettes.",
        "Taylor's tire is punctured. She is in front of the shopping mall.",
        "Jorge is waiting for Dusan. Dusan is trying to get there as fast as he can.",
        "Tracy wants another chance with Sophie. Sophie doesn't believe her. Sophie is blocking Tracy.",
        "Jerry wants to borrow a bike for the weekend. Amanda and Charlotte are willing to lend him their bikes. Charlotte's bike needs to be pumped.",
        "Jessica and Donna did their workouts. Donna did a half mile sprint this morning. Jessica and Donna will talk on Saturday morning.",
        "Nicole is going on a date with Tom. They will go to the Royal Palace.",
        "Niles and Rosa are going to have pizza today. They will meet at the station and walk from there.",
        "Sasha has a crush on Fabiano and she's not sure if he's gay. She's afraid to ask him out because she's shy and she doesn't want things to be awkward.",
        "Hiram is waiting for the bus.",
        "Theo, Clara, Gwen and Brett are discussing how to support Greg and his family. Greg is in hospital and will stay there for 4-5 weeks. His wife Sandra is on her own with the kids. Clara will get them some groceries tomorrow. Gwen will drive Duncan to school whenever Sandra needs. The",
        "James and Nick are discussing the forest day at school. It's on Friday. James is asking if the kids need to bring something for that. Nick says they'll need waterproofs and wellies. James is asking if they need lunch as well. Nick says they'll eat before they go.",
        "Samantha and Aubrey are talking about Aubrey's new job. Aubrey got the job but had to quit after two weeks because the company had unreasonable expectations. Aubrey's mum managed to get her a new job through one of her friends. Aubrey will be working there until the end of the holiday. Samanth",
        "Kori has a doctor's appointment at 7 AM and needs a car. Leandro needs to be at work earlier.",
        "Phillip invites Liz to come over for the weekend. Liz is not sure if she should. She thinks they are moving too fast.",
        "Rose, Helmut and Mary will clean the place after the party.",
        "Liam can't handle Amy anymore. She broke his plates yesterday because she thinks he has feelings for Dalila.",
        "Jake's black pants are on Stu.",
        "Xavier and Hester are discussing about voting. Hester is not going to vote because she doesn't know anything about the candidates.",
        "Kitty wants to wire money to Barb and Ken.",
        "Andres and Laura are going to see Cold War at the Kulturbrauerei on Thursday at 9. Laura will meet Andres at 8:45.",
        "Toni is looking for her brown pants. Dorothy tells her that they are in her top drawer.",
        "Vera is planning a get-together party on Friday evening. Olga will be there to play Mafia with her.",
        "Charles and Joe are discussing about Lukaku and Manchester United.",
        "Lisa is looking for Ian. His bike is still here. Kate thinks he might have gone to Ron.",
        "Kyle, Kian and Jodie are going to watch the game at a pub next to Jodie's place. The match starts at 8pm. Kian will write to Kyle in the afternoon.",
        "Guillermo has just finished his presentation. The teacher gave him the highest possible amount of points and said it was the best presentation so far.",
        "Mel left his jacket on the chair. John forgot to tell Mel about it. John will bring it in tomorrow.",
        "Henryk is buying himself coffee for 13:30, paying with 50. Guy returns him 40. Andrzej asks if Henryk has ever worked a hard physical job. Henryk says he has. Andrzej says that after 10 hours on a Saturday, you really don't give a shit.",
        "Grace wants to pick up the baby an hour later. Mary wants to talk.",
        "Brandie is on her way to meet Ezra. She will be there in 5 minutes.",
        "Jeffery and Elisabeth are going to buy 2 bottles of water.",
        "Samantha, Amy and Nicolas are going to Fiasco tonight.",
        "Max and Payton are discussing books. Payton has just finished reading Hyperion by Dan Simmons. Max is interested in reading it. Payton will lend it to Max.",
        "Anthony is tired and probably hungover. Jamie and Jeff had a crappy night. Jamie hung out the washing.",
        "Anna hates her life because Jim won't let her go out. He expects her to pay the bills and rent, and he's a parasite. She needs him for the heavy work around the property, like chopping the firewood.",
        "Al and Rob are old friends who haven't seen each other for a long time. They are going to meet up for dinner next Thursday.",
        "Jayce tried to approach Jackie but she's not into him. She's seeing another dude.",
        "Kathy misses Aleksandra. Aleksandra is busy until the end of the month.",
        "Jules, Sim, Kiri, Shannon and Anisha are going to a new cocktail place in town next to the kaspas ice cream place on the 27th.",
        "Kate is drunk and she likes girls.",
        "Zak and Clay will meet at evening prayers.",
        "Ella and Joshua will meet in Brooklyn after 8PM. Ella will book a table.",
        "Stan is going to wish Dan luck.",
        "Bella needs Jacob's guidance for her interview tomorrow. Jacob is free at 2000 today. Bella will pick him up at 2000.",
        "Stan needs help moving stuff out of his garage. Leo, Fiona and Clay are willing to help. Fiona will bring her dad's van. Stan will offer a crate of beer and pizza.",
        "Monica, Elisabeth and Nathaniel are going to the forest tomorrow. Monica will bring a cake and some olives. Nathaniel will bring pancakes. Elisabeth will take her parents' car. Elisabeth is preparing a surprise.",
        "Robert is waiting for David. David will be late.",
        "Travis has joined the police academy to become a road cop. He shut down his gym because it was not profitable anymore.",
        "Meg has transferred money to Robert. Robert has already paid it all. The gift is wrapped and ready.",
        "Mike wants to borrow Ian's car for a date with Mary.",
        "Stu and Mike are talking about Annie and Liz. Annie dyed her hair blue.",
        "Joe and Chris are planning to meet up in December.",
        "John has Monday off and he can come to Wendy's on Sunday evening. Wendy will also take Monday off.",
        "Millie and Deedee are discussing their children and their jobs.",
        "Jill and Claire are talking about a man who sat next to Claire at the movies. Claire thinks he was all right, but Jill thinks he was gorgeous. The movie they saw was Gone with the Wind.",
        "Ammalee is looking for a new style for her nails. She heard about Acrylic nails and Linen. Maryann recommends her Acrylic nails if she wants them to last longer.",
        "Dan is going to have a few drinks in Palermo and then head to Niceto Club. He will meet Lautaro and Pablo there.",
        "Adam can't make it to the quiz next week. Cara can take it if no one else will be there, but it doesn't really suit her. Marcus can take it, he has already been there a few months ago. Matthew will upload the questions tomorrow. The primary topic will be sports and around 30ish",
        "Dave was cranking the volume on his computer when his headset was plugged in.",
        "Rick is going on a field trip tomorrow. He needs to bring something to take notes with. There will be a test by the end of the week.",
        "Angelina and Jennifer are going to the cinema to see \"First Man on the Moon\" on Friday at 7-8 pm at Cinema City Arkadia.",
        "Trisha, Lisa and Kylie are going to spend Valentine's Day at Lisa's place. They will watch Bridget Jones and have some wine.",
        "Alice dropped her mobile into the bath.",
        "Isabella and Maria are discussing a video that Isabella and her friends have made. It took them 5 days of shooting and a week of editing. Maria thinks it's really good and Isabella is proud of the work they did.",
        "Alice's family is in a network that offers free calls within the network. Mark suggests that if Alice changes, she will get free calls to everyone.",
        "The website has Rick's points wrong. It should be 2345.12 and it has him at 2144.98.",
        "Leonard's father bought a smartphone. Leonard is teaching him to use WhatsApp.",
        "Greg made a reservation on John's website, but the hotel cancelled it. Greg is in Barcelona and has nowhere to stay. John will check the status of Greg's booking and will also review their cooperation with the hotel.",
        "Sam is baffled by recent events. Pam thinks there are more unconsious people nowadays because of tabloidisation of the whole media world. Sam sees no solution to that.",
        "Donald is at university. He will be home at 5. Laura will be home at 5. Laura forgot to buy bread.",
        "Anna wants Jack to send her the videos from yesterday. Jack has already sent them to Anna's email. Anna can't open them on her phone. Jack will send them via WeTransfer later tonight. Jack will put them on YouTube if it helps. The quality of the recording is very good. It looks like if it was taken by",
        "Larry wants to play co-op games on his PS4 with Gabe.",
        "Diane is going to see Grandma today at an Italian restaurant near her house. Gregory saw her two days ago, she's in good shape. Diane will let Gregory know when they meet with Grandma together.",
        "Lisa's son Tommy got his first haircut today. He was very calm and the lady said she'd never seen such a calm toddler before. Lisa is very proud of him.",
        "Diane is getting married. Lara will come to the wedding.",
        "Harper wants to go to Disneyland. Ashlee says they don't have enough money and they have debts.",
        "Amadeus feels sad because his life continues being miserable.",
        "Tom and Adam are going to book a place in NYC. Adam found a nice place for 38 dollars per night. Tom is going to check if there are towels and wifi.",
        "Raymond and Spencer are going to meet today.",
        "Madison will walk the dog today.",
        "Tony told his parents about his relationship with Mark.",
        "Olivia and Megan are planning a birthday party for Poppy who will be 100 in March. They will invite only family and their own children. They will open Olivia's house and ask the guests to come with sleeping bags. They will cook the main course and dessert themselves. Chris will take care of the be",
        "Wilkes is considering going to Jordan with his girlfriend. Peyton's roommate has been there and he recommends it.",
        "Liam is looking for a satellite box with 2 satellite and 1 DVB-T2 for Saorview with PVR option and SATA hard drive. He doesn't need a camds line at the moment but would need either WiFi or Ethernet connection on the box. He is not worried about adding a camds",
        "Mason and Robert are going to meet at Pizza Hut.",
        "Dack voted for the man of his choice.",
        "Lauren is asking someone to take her night shift on Friday because her child is sick. Dennis is annoyed. Mickey can take Lauren's shift on Friday, but she wants Lauren to take her shift on Thursday.",
        "Christine found out that Sean and Natasha are getting divorced. Jane is shocked.",
        "Maola's son Nethan is 12 and a half months old and he still doesn't speak. Ontina suggests to answer him back with longer sentences and to sing his favourite song together. She also recommends to read books together.",
        "Freddie and Hollie had a meeting.",
        "Kate and Michael are in the seminar room 1. They are trying to use the university laptop to connect to the projector. The laptop is a new MacBook Air and doesn't have an USB port.",
        "Patrick is Rini's assistant. Rodrigues is supposed to meet Rini today but he is busy with his client. Rini is not interested in any of his dates.",
        "Conrad is not sure what to get for Grandpa's birthday. Jasmine suggests that Grandpa would be happy if Conrad came to see him. Jasmine also mentions that Grandpa wanted a book, but she doesn't remember the title.",
        "Kelvin and Candy enjoyed their first meeting. They will meet again tomorrow.",
        "Adrien and Joona don't like Florence. They think it's a museum, a very touristic, almost fake place. Joona doesn't like Italian food. Kamil doesn't believe there is something like \"Italian food\".",
        "Max will be late because he is having a beer with Tom.",
        "Alice is asking Lucy if she is still in town. Lucy is on the train.",
        "Sammy and Anna are listening to music. Anna has good taste for music.",
        "Leo asks Chiellini when he is coming to Italy. Chiellini says he doesn't know but not anytime soon. He is in Spain now.",
        "Maya is going to college today. Jose is sick.",
        "Beth has a free ticket to see Roma on the big screen. Tim has seen it already on Netflix but he can go with Beth.",
        "Kay lost her earring by the copy machine.",
        "Zoli will spend his last day with Jess.",
        "Matt sent an email to his boss complaining about the new organization and accidentally sent it to Harris. Amy will try to stop Harris from gossiping.",
        "Jessie and Rose are supposed to work on a project together. Rose is swamped with her other classes and play practice. Jessie wants to meet twice this week. Rose is not taking it seriously.",
        "Austin needs funny quotes for Mr Peter's card. He also wants to buy a hole puncher for Mr Peter. Graduation is in 2 days.",
        "Joona is asking if Jenny and Tim have arrived in Stockholm. Jenny and Tim are staying a few days in Mariehamn.",
        "Laila wants to make an appointment for Sunday. She needs a manicure, pedicure and facial done. She also wants to get her hair cut. Shaun suggests her to pay for 3 services and get the fourth one free of cost. Laila agrees. She can visit the salon after 4pm on Sunday",
        "Paul wants to know how good Katie's French is. Katie has a TEFL certificate. Paul needs someone who can help if there are any misunderstandings with Monsieur Lafayette and his team. Katie suggests Pete.",
        "Jenny has recorded a video of Tommy's first steps. Greta has sent a gif of Tommy.",
        "Tim wants relief.",
        "Rachel has a photo of an app. Diane knows it.",
        "Paul's dad passed away 3 years ago. Paul is feeling down today.",
        "Susan is bored. Tom is sleeping with his eyes open. Linda is drawing.",
        "Aiden wants to hang out with Amelia. Amelia is not interested because she has a boyfriend. Aiden is pushy.",
        "Meg is baking blueberry muffins with her little helper.",
        "Griff and Tea are going to meet in the park in 10 minutes.",
        "Rachel is upset because Dean told everyone that the trip was cancelled because of her.",
        "Pina and Dick are in Cancun. They have seen everything that was worth seeing in Cancun on the first day. Tomorrow they're taking a boat to Isla de Mujeres. They have no jet lag.",
        "Daniel finished watching the best anime ever, Grand Blue. It's about diving, but in reality it's more about drinking. Tyler will put it on his \"to watch\" list.",
        "Eve and Carla are going to see the new HP film on Saturday at 16:50. After the film, they will go to the main square for some hot wine. Alice is going to a wedding.",
        "Laura wants to buy a phone from Albert. She can't come by to pick it up.",
        "Ida left her sweater in the chemistry lab at school.",
        "Karen, Don, Margaret and Maya are going to eat chicken with veggies tonight. Margaret wants to make pancakes with Nutella for dessert.",
        "Albert will have a beer tomorrow.",
        "Adam showed Tom a video of a new model of Porsche Cayman. It has an 8-cylinder, 49.2 Nm petrol biturbo gasoline engine, 404 kW (550 HP) and maximum torque 770 Nm. It costs about",
        "Evelyn is fed up with the mess in the kitchen. Jenny will clean up when she comes back.",
        "Jenny will explain algebra to Tim tomorrow.",
        "Gabi and Natasha are roommates. They have a messy little place. Gabi suggests a cleaning schedule. Natasha agrees. Gabi sends her a file with the schedule. Natasha will start cleaning this week.",
        "Sarah got the acting job. They will celebrate at a restaurant at the corner of 2nd avenue and 41st st.",
        "Tara is working on a PowerPoint presentation for her university. She is nervous about it because it is 25% of her grade this year. Siobhan will have a drink with her after work.",
        "Maria is asking Steven to help her cross the road. It's too noisy and confusing. Steven helps her cross the road.",
        "Karen and Sandy haven't heard from each other for a long time. Sandy is still at the same job and doesn't have a boyfriend. Karen has changed her job recently and is excited about it. They will meet up for a coffee next week.",
        "Drake and Fran will meet at Fran's place tonight.",
        "Darryl and Kathy are talking about Brian's fish.",
        "Trish has a Friends t-shirt and she wants to give it to Rose.",
        "Helen won't be able to go to the party because she has to finish her project.",
        "Dan's mother died of cancer. Dan was very stressed before his visit to the doctor. The doctor told him that he should do the examination periodically, because of the history of his family.",
        "Sam is on his way to Trevor's place. He will be there in 10 minutes. Trevor needs vodka and ice. Sam will buy vodka and ice.",
        "Bernard is going downtown for lunch. Jeff is also going downtown for lunch. Bernard asks Jeff to give him a ride. Jeff agrees.",
        "Adam and Debbie are going on a date tonight. They always do the same things. Sean suggests a picnic under the stars, but Debbie hates the outdoors. Sean suggests taking her to the circus.",
        "Tina is not sure what to wear today. Sam thinks it's ok for him, but Tina might be chilly.",
        "Ellie and Becky want to send postcards from here. Diego will pick up the mail from them today.",
        "George is asking about the price of blueberries. The shoplady says they are 18zł. George thinks it's expensive.",
        "Alfonso, Marga and Claire are meeting tomorrow at 9:00 at La Tienda de la Cerveza, a bar next to La Latina metro station.",
        "Bob is having a games night at his place. Rob is coming.",
        "Lenny made a beef stew with sweet potato.",
        "Tommy is coming back. Agnes will warm up the dinner. Olga will get some bread.",
        "Cassidy has found her glasses in the fridge.",
        "Jenny, Tom, Peter and Mary are planning a trip. They will go to Barcelona and Madrid. After Madrid, they will go to Sevilla or Granada and then to the coast.",
        "Ruby and Ruben are in love.",
        "Tamira and Shelley watched Rupaul tonight. Blessidy wore a tent as a skirt and her make up was ridiculous.",
        "Kent and Clark failed the quiz.",
        "John and Jean-Marie are still in Kokologo. They are 50 km from Ouagadougou. They will continue their journey.",
        "Rebecca and Larissa are going to a wedding. Larissa is wearing a beautiful dress. Henriette is going shopping tomorrow.",
        "Lily will live with Mia's mum till the end of January. Mia will be around from 17th of October for a few days. Lily will do couchsurfing in Açores.",
        "Caroline and Alexandra are going to Rome for a trip. They will arrive at 4 pm and will get to the hotel at 6 pm. They will take the bus from the airport. They will visit the Vatican City, have dinner at a restaurant, and visit the castle of Saint Angel, the Trevi Fountain,",
        "Justin and Bella apologize to each other.",
        "Martha can't find Tom and Peter. Tom and Peter are at the rare. Peter is on the way to pick Martha up.",
        "David is going for an interview and needs to wear something formal. Carter suggests David to wear his suit for the day.",
        "Peter had a car accident at 7 a.m. He was driving in the morning traffic when he lost traction and banked. He was stopped by a lantern pole. His car is on its way to the mechanic. Peter is fine. There were 3 more accidents in the area. Peter had winter tires.",
        "Abigail is reading an inspiring book. Natalie is tired and disenchanted with school. The semester is about to end. Natalie will read the book during the winter break.",
        "Tom got Andrew's phone and it doesn't work anymore. It was in the washing machine for 2 hours. Andrew can't help him. Tom will try to send his phone to the repair shop.",
        "Arthur asks Klay how his Bitcoin investment is going. Klay says he lost 20k last week and it keeps plummeting. Arthur says it won't be the most profitable investment in Klay's life. Klay says he will never put any money in such bullshit. Arthur sends Klay a photo to cheer",
        "Tori and Sylas will talk in college tomorrow.",
        "Isabelle and Lucas enjoyed last night's karaoke.",
        "Sabrina is looking for a new case for her iPhone. Ellie bought a glittery one recently. Sabrina is considering cute ones with animals.",
        "Emily is on a Flybe plane that has been delayed for an hour. She joked with the flight attendant when boarding.",
        "Miriam and Mary are talking about Jenny.",
        "Fred, Gabe, Steve and Sebastian are trolling Gabe.",
        "Jenny is Patricia's mum. She is out of the loop when it comes to the exams and the planned school trips. Dan attended the PTA meeting this week. Midterms are scheduled for the second week of January. There is only one school trip ahead of us - they are going to the science museum.",
        "David and Bill are waiting outside. Victoria will be done in 10 minutes.",
        "Tim wants to talk to his dad, Barry. Barry is busy and will call Tim in 10 minutes.",
        "Peter is ordering food for Susan, Mark, Mike and himself.",
        "Joe has seen that Victory Street is going to be closed for reconstruction. Rob and Tim are going to have a hard time commuting to work.",
        "Tory, Maya and Corina are going to the conference in Accra, Ghana in June. The deadline for applying is the end of February.",
        "Vivian is throwing a party for her colleagues and there are some vegans among them. She's looking for a vegan recipe that would work for sure. Thomas recommends a vegan stroganoff recipe.",
        "Kitty wants to wire money to Barb and Ken.",
        "Adrian is at home. Ron will be home after 5. Adrian is thirsty.",
        "Bonny and Lisa are going to watch the new Sabrina series on Netflix tomorrow.",
        "Walter and Wendy had a lovely weekend.",
        "Joey is upset with Janice and Eric. He wants them to end their misunderstandings.",
        "Lola and her kids will be visiting Jerry and his wife in mid-July.",
        "Raquel is asking Gary if the spreadsheet is done yet. Gary says it will be done in 15 minutes.",
        "Adam and Nina are planning a family get together this Sunday.",
        "Rebecca sent Oscar a copy of the invoice yesterday. The reference number is 889905. Oscar will check if the order went through successfully. Everyone is meeting up at Tasha afterwards.",
        "Max and Jerry are discussing what to bring for a school project. Jerry didn't think about it yet. Max thought about volcano.",
        "Richard sent Alice a photo of Emma's dress. Alice thinks it's sparkly and fluffy. Richard is Emma's grandfather. Alice thinks Emma is too cute. Richard sent Alice a gif.",
        "Henry and Chloe are chatting. Chloe is in Italy. She is doing well. She has been doing a lot of interviews. Sheila dyed her hair. Peter is fine.",
        "Konrad's brother used to play Fortnite, but now they play League of Legends. Tom has never heard of it. It's the second most popular game in the world. Tom will arrive at the Olimpia hotel at 20:45. Konrad will pick him up at 22:3",
        "Dalton, Axton and Brand are discussing what to buy for Lori's birthday. They are considering a shopping voucher or something from a website.",
        "Tim and Anne are in love.",
        "Andrea, Jody, Angelo and Lorenzo all lived in Berlin for some time.",
        "Grace is sitting in the very right corner. Kelly is going the other way. Ricky is parking the car.",
        "Betty and Henry are going to have pizza next week.",
        "Frank and Marlene are curious about Robert's new girlfriend.",
        "Oliver needs to vacuum and Wendy will take the dog out for a short walk.",
        "Allen needs a gift for his wife's birthday. She likes to work out, bake, and is into music. He can't get her kitchen stuff or workout stuff. He's got concert tickets for the year already. Millie suggests a spa treatment or a bottle of her favorite wine or gin.",
        "Frank and James are going to a party.",
        "Michael is presenting a new product to Lucas and Ian. The product is a terminology database containing more than 8.5 million terms. It is available for 49.9 $ monthly.",
        "Dominic and Hazel are looking at Mars photos.",
        "Pietr is considering buying a new iPhone. Maria advises him to wait for the next generation.",
        "Noah can't go with Alexa and Olivia today because he has to work. He might join them tomorrow afternoon.",
        "Nola wants to join the VolunTEER organization.",
        "Pete has lost his wallet and thinks he left it at Sandy's place. Sandy will look for it.",
        "Dave needs to go to the office to send off all the project files he has on his computer. Jess is still there.",
        "Ron apologizes to Dorothy for his drunken messages.",
        "Rosanna is in Warsaw and it's nice there. Leo is also in Warsaw and it's a bit windy but quite warm.",
        "Adam wishes Rosie and Thomas a Happy New Year. Rosie wishes Adam a good year.",
        "Rita and Alger are friends. Alger found Rita. Rita travels a little bit.",
        "Aliza is trying to cook something but not getting good results. Miller is coming to help her.",
        "Tom: How about blind date? <file_other>\nMark: I hope he was my date <file_photo>\nJonathan: It’s easy to pull off a turtle neck as long as you take off your glasses first.\nGeorge: HA HA\nBarry: You don't know how right",
        "Lee: The betting site is back online right now.",
        "Tom needs Mary's help with his essay. Mary will come over to Tom's place tonight.",
        "Michael can't come tonight because of work. Jennifer will see him tomorrow at 8 pm.",
        "Riley is texting with Brandon's brother.",
        "Louise's friend Ann is pregnant. She is going to have a baby shower. Louise is not sure if she wants to go.",
        "Theresa, Will, Miranda and Molly are considering going to a party in La Olivia. They are not sure if they should go just for the potatoes.",
        "Jimmy is looking for Maria. Peter saw her in the main corridor. She's in the office because she has a deadline today.",
        "Ian, Gina, Noah, Harry, Kelly, Toby and Bill are currently reading different books.",
        "Frank and Vicky are discussing the family dinner. Vicky's mother criticized her for wanting to study abroad.",
        "Jeff and Rich will talk about the show Narcos on Monday at work.",
        "Ollie didn't work out last weekend and drank a lot. He didn't get any invites for this weekend. Abby is going out with the girls. They will meet next weekend.",
        "Adam forgot his wallet at home.",
        "Carl needs 10 bucks till Friday. Rosie will lend him the money.",
        "Ted is going away for the weekend. George will take care of Spliff and water the flowers.",
        "Ewan's car broke down and he's going to be late for the party. Isabel is going to pick him up.",
        "Tommy is in a beautiful place and he wishes Linda was there.",
        "Keifer, Mark, Mike, Michael, Canh, Jeff, Cha, Alan, Pabo, Pete, and Pabo are watching the NFL game between the Steelers and the Falcons.",
        "Jack forgot to get a beer with Matt tonight.",
        "John is at the entrance. Jerry and Mary are already inside at one of the big tables.",
        "Taylor didn't get accepted to vetmed this year. He might work for a couple of years or take another year to boost his average."
    ],
    "outputs_after": [
        "Lucy and Sue are discussing JK's morning show.",
        "Simon is painting his cupboards green. Angela is meeting Chris. Wendy is having a lazy weekend. Ben is in the garden.",
        "Petra is in lectures all day. She will call Zack back in the lunch break. She can type and read.",
        "Amelia wants to go shopping tomorrow. Anna can't because she has to meet her study group in the morning. She is visiting her grandma who turns 86. She has to do some work because she is behind and has to make up for it by Monday. In the evening, she has to help her mum cleaning windows. Am",
        "Niki and Jeanna are talking about Angel. Angel has a boyfriend. Angel is disgusting and eats in front of the teacher.",
        "Gabriel is picking up his new car today. It's a Mercedes-Benz, sedan, 180hp, 0-100 kmh in 6.2 seconds. It cost 55k.",
        "Danny and Kate are bored. Danny heard that Frank and Sue are dating.",
        "Jenna is cooking tonight. She's making chicken in an Indian way. Lilly and Eaton will join her.",
        "Maria's parents decided to move to Costa Rica as soon as her father retires.",
        "Monica asks Larry and Fiona what time they are coming home. Larry says 6 and Fiona says 7:30.",
        "Adam, Kim, Kris and Jackie are discussing about Christmas presents. They all agree that it's more fun to get something specific rather than a surprise. Adam wants to get a stereo system, but he needs a little more cash. He's going to talk to his parents about it.",
        "Deb missed seeing Danie when she visited Melbourne last month. Danie would love to visit Deb some time.",
        "Irma will take the garbage when she goes out.",
        "Lane and Cadence are going to sleep. Cadence will send Lane something funny on Facebook. They will talk tomorrow.",
        "Sandy wants to join Tina, but Tina needs to write an essay. Sandy is going to close Facebook and Tina is going to make it.",
        "Dirk told Molly about a commercial on 680 about disability claims. Molly is not applicable for short, cause she gets weekly allowance from her insurance. Molly will see if she can get her loss of wages back. Molly has credit card debt running a bit high. Molly doesn't know when she can get back to work.",
        "Anna and Zoe are talking about Zoe's dress.",
        "Robbie is inviting Kris to a board game night on Friday. Kris is not sure if he wants to go.",
        "Donald is asking Scofield where Mike is. Scofield is telling him that Mike is not at home.",
        "Esme has finished a project.",
        "Diana is a new neighbor of Linda. She is from the grey house. Linda is a vegetarian.",
        "Bernie's wife will be out of town for a couple of days. Chris and Marty will come over to Bernie's house on Friday after work.",
        "Shelly's kid Taylor found out there was no Santa. Diane misses the Santa days.",
        "Katie is in front of the door.",
        "Kate's boyfriend Matt fell off his bike and has a broken leg. Simon sprained his toe yesterday.",
        "Frank is going to IKEA to get furniture stuff for their kids. He might get something special for Morris, his bday is coming up. They need some new lamps. Eliza needs a new lamp for Jeanine before she goes to school.",
        "Noel is late for a meeting with a client. He is stuck in traffic because of cyclists.",
        "Leo and Evie are talking about Miley's new song.",
        "Owena's dad has just come from the police station. He hired Jack, a guy who was in jail for fraud. Jack begged Owena's dad to pay back his debt. Owena's dad thought he became another man. He cut down his salary for a few months for the amount of money he asked",
        "Amber lost her flower necklace at the party yesterday. Gabriel will look for it in his flat. Amber fell asleep in Glen's car. Mariah found Amber's necklace in her pocket.",
        "Mike and Jack are playing RDR2. Jack is halfway through.",
        "Leah, Gary and Maggie are excited about the new track. They want to go to a concert.",
        "Martha received a message from Jessie's boyfriend. Samantha and Fiona are shocked.",
        "Brandon wants to see a movie on Saturday. He asked Sheila to go. Sheila is going if it's not a date.",
        "Leda, Gaby, Ivan and Marc are going to the Venice Biennale. They will go to Arsenale.",
        "Rose bought a new jacket.",
        "Amy, Oli, Deborah and Adrienne are going to Spoons at 5:30.",
        "Larisa is waiting for Hubert to wash the spoons and vacuum the hall. Hubert is going to do it when he comes back.",
        "Marie loves Tamara's T-shirts.",
        "Tessa and Austen are going to write letters.",
        "Lin is bored and can't sleep. Samuel is sleepwalking and typing to Lin.",
        "Griff and Tea are going to meet in the park in 10 minutes.",
        "Patricia wants to meet Jacob and Kate this week. Jacob and Kate have plans for most of the week. Patricia's father has his 50th birthday next week. Jacob and Kate are free on Wednesday next week. Patricia will let them know tomorrow.",
        "Alan is going to visit his dad in the afternoon.",
        "Sharon is looking for Harry. He was at the canteen at lunchtime with Benjamin and Ali. He left the building about 30 minutes ago to get his hair cut.",
        "Hannah's friend is going to start taking medication for her health issues. Patty is worried about her.",
        "Aria is waiting for the technician.",
        "",
        "Henning and Max are discussing about waiters/waitresses in Italy and France. Max thinks that there are no huge differences throughout Europe. Henning thinks that Italian waiters are much nicer and much less professional than in Germany. Max thinks that all those theories say more about their authors than about the waiters and the countries.",
        "Lisa and Dan are talking. Dan is much better now.",
        "Angelica is feeling a bit ill.",
        "Terry is looking for a physiotherapist in Carlisle. Jennifer recommends David, who helped her with her spine and Mick with his knee. David is a magician, according to Jennifer.",
        "Julian and his band have to cancel their show tonight at Blind Goose due to unforeseen circumstances. They are planning to reschedule it for next Tuesday, weather permitting.",
        "Conrad is angry with Frank for forgetting to meet him.",
        "Taylor is waiting for Owen.",
        "Andy is sorry for yelling at Laura. He ordered sushi and bought a bottle of her favorite wine.",
        "Ann is going to buy a new dishwasher for her mom. July and Gus are going to the cinema.",
        "Fanny wants to make an appointment with Carol on Friday at 3.30 pm.",
        "Mark will work from 6pm onwards today and from 2pm-9pm tomorrow. He's off on Saturday. Ann and Mark will meet at Ann's place at 11 to decide where to go.",
        "Isabel is planning a trip to New York with her husband Joe. She is asking Gina for recommendations for Italian restaurants. Gina suggests Barbuto, Café Altro Paradiso and Via Corota.",
        "Adam is looking for a band name. He found a song that Samantha likes. He wants to buy a CD for her. Brian suggests asking Lizzy.",
        "Howard's sister Claire got a job at a cafe that employs only people with special needs.",
        "Dianne is upset with Andy because he told her he was making a lot of money. Barrett thinks it's not important.",
        "Paul, Joe and Rob are going to an escape room on Friday.",
        "Meryl is going to the gala. Clint is not going. Roberta is working there.",
        "Miles had a dream where he was stuck in the 80's. He couldn't figure out how to get back to 2018.",
        "Edward is upset with his mom because she gave the money he gave her for her birthday to her new boyfriend who lost it all gambling.",
        "Jose passed his driving test.",
        "Lenny and Thomas agree that the movie Venom is going to be rubbish.",
        "Luke, Chloe and Jack are going to the party. Jack will drive Chloe's car.",
        "Violet has read Austin's article and thinks Claire might find it interesting.",
        "Joseph is sorry about what happened to Carlos' mates.",
        "Gemma forgot her keys. Suze will let her in her office.",
        "Kela sent Cher a birthday message and some photos.",
        "Pete is coming home. He's been in a line. Nicole is making dinner.",
        "Jacqui has a new idea for a website. It's a self-learning institute called the Institute of Self-Tuition. The site will provide an introduction to the areas of learning within a topic and will link to books on Amazon, YouTube videos, and Wikipedia articles. The site will also rank these resources based on user",
        "Stephanie is excited about the new superhero movie with a female lead.",
        "Jill and Jack are talking about their upstairs neighbors who are having sex again. Jack is jealous of Jill's husband. Jack has a meeting tomorrow.",
        "Charles thinks long distance relationships don't work. Jim agrees.",
        "Michael and Jane have seen the last episode of the TV show. They liked it.",
        "Andy's car has been hit and she can't start it. Sharol will pick up Mary from university.",
        "Caroline is in Basel tomorrow. She wants to buy some more art. Blake prefers to invest in art than diamonds now. Hans and Reinhard are on the yacht in Monaco. The weather is perfect. Caroline will join them afterwards.",
        "Carol's computer stopped working. She needs help. She's going to call Bill.",
        "Diana's mother passed away one year ago. Danielle's mother was a communist who fought in the resistance movement during the war. She was with a few men after her husband was killed, but none of them were as dear to her as her husband. Danielle's mother was a strong and courageous woman. Danielle",
        "Adalyn and Nora are going to sign up for self-defence classes for women at the university.",
        "Mat is waiting for Chris to finish his work. Chris will be done in 20 minutes. Mat is working on his presentation.",
        "Cass is ordering pizza for dinner. Drew is out. Braden and Mickey are in. Cass will order some extras.",
        "Wendy and Diana are planning a surprise party for Pam's birthday.",
        "Peter is home already. He's going to watch Netflix and do nothing. Liz is going to buy a bottle of wine on her way home.",
        "Scott is back in Uganda. Sasha is going to a party with her mates from the uni.",
        "Kyle has finished reading the new D&D expansion. Stephen, Carol and Josie want to check it out.",
        "Boyle moved out because he was tired of living with his mom. He moved to Stonehenge with his buddy from work.",
        "Cora, Kaylee and Lydia are going to a spa.",
        "Sasha asked Dean to print out her essay on modernism.",
        "Ralph has heard of a company called \"Venque\". Victoria hasn't. Charles thinks it's a Canadian company with expensive but beautiful products. Ralph is showing Victoria a bag from this company.",
        "Gera will meet Hope at 2 in her office.",
        "Fiona will be picked up by Tom after work. Tom might be a little late because of a meeting at 5.",
        "Caron found the Beautiful South on her Tidal app. She's having a good day listening to her music.",
        "Susanne, Lilly and Rachel are going to a concert.",
        "Dora can't come to the party because her mom is ill.",
        "Rebekah is home. She had fun with Gianni. They hope to repeat it soon.",
        "Cliff congratulates Connie on her graduation.",
        "Greg owes Frank 100 in total. Jane paid 80 for photos and frames.",
        "Jack hates Christmas. Nate prefers Easter.",
        "Mackenzie found a photo of Hailey in a magazine. Hailey is a professional model and she's married.",
        "Tessie is on her way to Frankfurt airport. She put flowers on the grave of her husband. Merce is not cross with Tessie.",
        "Matilda wants to go to the movies with Dillon tomorrow.",
        "Marion liked the food last night. Amya didn't.",
        "Fred wants to know if Zach has booked the flight. Zach hasn't booked it yet. Fred wants to book the flight as soon as possible. Zach is looking for a better deal. Fred doesn't want Zach to overpay. Zach is checking for deals every day.",
        "Ceil asked Keyon for help with a French photo.",
        "Zoe found 4 kittens in the bushes. She will keep them in the laundry room.",
        "Alex passed his exam. Monica will have her exam next Tuesday.",
        "Kevin is selling his car. Rob will ask his friends if they are interested. Greg doesn't like Kevin's car but wishes him luck. Kelly asks if Kevin has sorted out the mess inside.",
        "Hector's rabbit, Nivea, has passed away. Yuri is really upset and needs some time alone. The party is cancelled.",
        "Henry and Ruby are discussing the Me Too movement.",
        "Kayla and Tom are watching the Great British Bake Off. Kayla is cheering for Bryony to win, while Tom is all for Ruby.",
        "Jenny and Will will spend New Year's Eve in the South.",
        "Paul is on board. Anne wishes him a safe flight. Paul will call Anne when he lands.",
        "Jeanette and John are talking. Jeanette is from Kokologo, Burkina Faso. John is from Warsaw, Poland. Jeanette's dad used to work at a dam in Kokologo, but he fell off of it and there was no water in it.",
        "James and May's house was burgled. The burglars took the TV, some stuff from the kitchen and a laptop. The police are investigating.",
        "Pearl is going to wear her old ballroom dancing costume from 1968. She has kept it wrapped up, with moth repellent in the cupboard and she's sewn the loose sequins back on. She's also had her hair done. Vince is going to wear his old student outfit from",
        "Jenny and Matt are planning to bring cheese, crackers, and chutney for Christmas day at Matt's parents' house.",
        "Nick and Ralph will meet later.",
        "Tito found a recipe for pickling veggies. He's going to pickle some veggies next week. He's going to teach Peppa and Rose how to do it.",
        "Scott and John will meet at Oculus at 7.30.",
        "David is asking Terry to submit his work. Terry apologizes for the delay and says he has finally caught up.",
        "Chris and Amka are going to stay in for Halloween. Mick is also going to stay in. Chris is from Poland and they don't celebrate Halloween there. They go to the cemetery on November 1st with their families and spend time together.",
        "Bary and Kate are going to meet at 3:00 in the park in Wilanów.",
        "Becky, Erin, Eva and Irene are going to the beach. They will go to the infinity pool at 3 pm.",
        "Sue and Paul are talking. Sue's dad is fine but his legs are giving him gip. Sue has an interview next week in Port Talbot. Paul saw Russell Howard in Birmingham last weekend.",
        "Laila is working on her laptop. She is afraid she will get drunk tomorrow because of her work. Davon is going to a haunted house tomorrow. Laila is taller than Davon.",
        "Hilary and Mandy's children start school tomorrow. Max is happy and Lisa is a little scared.",
        "John and Mike are talking about the movie \"Bohemian Rhapsody\". John had a fight with Martha.",
        "Caroline and Monica are talking about Ed Sheeran's concert. Caroline has bought tickets for Ed Sheeran's concert in ten months. Monica is surprised that the tickets have sold out in two days. Monica is sure that someone will sell their tickets before the concert.",
        "Kevin has a plan.",
        "Tommy is going to buy a comic book for Jane.",
        "Jools had a tooth removed. She's feeling odd and her head hurts. She can't eat or drink anything hot. She's going to Tesco to buy some cool cocktails. She'll tell Kim in 2 hours what she's doing tonight.",
        "Francis, Jason and Lara are going to read 2 chapters of a book.",
        "Diana Voss and her friends are arriving in Frankfurt in the evening. Ms. Hobbs will turn the heating on in their apartment.",
        "Ashley is coming behind the building in 5 minutes.",
        "David, Monica and Nina are discussing how to split the electricity bill. David will make some calculations in Excel and send it over to Monica.",
        "Dominika is drunk and wearing a dress.",
        "Susie is taking a break in five minutes.",
        "George is going to be late because of a traffic jam in Austria. He is close to Kufstein and he is driving very slowly.",
        "Tim is asking Amanda how Des is. Amanda says that Des is usually sleeping and driving her crazy. Tim says that Des is lovely. Amanda says that Des is a devil in cat skin when he's awake.",
        "Rebecca and Logan will meet at Zach's place at 6.15. They will leave at 7AM to get to the mountain by lunchtime.",
        "Filip wants to translate a manual from English to French. He will send it to Alienor. Alienor will translate it using Google Translate.",
        "Magda and Piotr are discussing the march in the city center. Piotr is going to a party through the city center. Magda is upset about the march.",
        "Magdalene is going to the cocktail party on Sunday. Josephine is not sure yet. Jamie is sick.",
        "Hannah bought a new jacket. She's going to impress a guy at her office.",
        "Jess is sick and can't meet Tom today. They will meet next Tuesday.",
        "Jason wants to know if Alba is coming for dinner with mom.",
        "Lennie is looking forward to a white Christmas.",
        "William is mad at Elizabeth because she told Tom that he won the contest.",
        "Thomas is buying a ticket to Paris for 26th December. Evan is flying on 27th December. Thomas found a flight for €25.",
        "Pam asks whose turn it is to throw the garbage away. Don says it's Ron's turn. Ron confirms he will do it when he comes home.",
        "Sabrina has been appointed as a form teacher starting September. She is not sure if she wants to do it because it is emotionally draining.",
        "Eve and Cara are talking about their neighbours who want to move to New Zealand next year. The family from the destroyed island is also moving there. Sam and Ryan are discussing the situation of Kiribati.",
        "Terry and Karen are planning a birthday party for Travis.",
        "Karen wants to know if Judy and Irwin want to go to Roma next month. Irwin is going, but Judy has other plans.",
        "Paul is late sending a file. He will have a copy tomorrow. There will be a short presentation tomorrow. Jake is sure that they will like it.",
        "Kitty and Jill are looking forward to not having a morning class on Tuesday. Kimberly thinks they will schedule the next class. Jill hopes it won't be on the weekend.",
        "Jeremy is asking about Professor Xavier. Jake is asking why. Joselyn says that he broke his leg. Jeremy is asking if there will be no classes for them. Jake is saying that there will be a substitute teacher.",
        "Emily is looking for a language school near her. Cory and Jem are helping her.",
        "Lyla doesn't like animal shows. Tab is watching Dynasties.",
        "Carlie's child has started to walk a few steps today. Rylen's child is still on the bed. Rylen's child says \"Mama\" and \"Dada\". Carlie's child eats Cerelac. Rylen's child eats fruits.",
        "Anna wishes Anton a Happy Thanksgiving.",
        "Aj is late for Sue.",
        "Brooke failed her exam. She's worried she might be kicked out of the university. She's failed three exams. She's going to take the exam again next year. She's desperate and wants to find a tutor. Emily's cousin used to do tutoring. Brooke is desperate. She's going",
        "Michelle wants to know how Byron is treating Linda. Linda is working on a copywriting deadline and will talk to Michelle in the morning.",
        "Stanley and Angela are planning to meet on Saturday. They will have a drink to celebrate their graduation. Angela will invite Dymitr, Przemek, Martyna, Aleksandra, Karol, and Jessica.",
        "Fiona's phone battery is about to die.",
        "Esther and Stacy were supposed to meet yesterday. Stacy missed it because she got confused about the days. Doris is getting married.",
        "Harry is going to buy flowers or chocolates for his lady.",
        "Ollie is asking Jake where the store is. Jake is not answering. Ollie is asking Jake to pin him. Jake is not answering.",
        "Lilly and Olivia are talking about Bill's eye operation. Bill had an emergency operation due to retina displacement. He had 5 tears in the retina. The doctor is happy with the progress after a week of recovering the eye. Bill can see some fuzzy outline of objects. Colour is distorted, mainly",
        "Rick and Evelyn are discussing the music for the party.",
        "Linda is worried that she might have left the iron on at home. Jeff is not at home at the moment.",
        "Nancy wants Giovanni to not turn on the light when he comes home. Giovanni is not coming home tonight.",
        "Harold brought cookies for his last day at work.",
        "Phillip wants to borrow Elizabeth's car to impress a girl he met. Elizabeth thinks he's insane and suggests he takes the bus.",
        "Lidia is waiting outside Tesco. Tom and Caesar are inside Tesco. They are almost done.",
        "Clarissa has a beautiful view.",
        "Alejandra's neighbourhood is almost completely inundated. Pepe and Aaron are at work.",
        "Jay wants to give Martha a ride to Mark's party tonight. Martha is a bit worried about showing up at the party together with Jay, but she agrees to go. Jay has a new car.",
        "Mary is home.",
        "Harry, Anne, Tom, Edward and William will collect 20 per person for a present for Mia.",
        "Tony and Mirko are waiting for Ellen in their apartment in Puerto del Rosario.",
        "Hugo is going to get Leon 2 or 3 beers and Elliot a sprite.",
        "Tom woke up Peter. They will meet at 8.00.",
        "Pat wants to eat Dad's salad. Dad needs it for tomorrow. Pat is hungry.",
        "Andrew is organizing a CEMS party.",
        "Terry read Danielle's short story and liked it.",
        "Jake apologizes to Reese for what he said yesterday. Reese doesn't want to talk with him. Jake wants to do anything for Reese to forgive him.",
        "Hannah wishes Rosie good luck with her exam. Rosie is not sure if she is ready for it. She has been studying for a long time and she thinks she will just go to bed and rest.",
        "Kamil and Thomas are going bowling tomorrow with Godek and Prosty with his girl. Thomas can bring his girlfriend.",
        "Aston and Mona are going to Japan in 3 months. Mona owes Aston 600 euros for the plane tickets.",
        "Ted is bringing Ally with him. Portia and Agatha are looking forward to seeing her.",
        "Gavin and Roy are going to a concert of a new band.",
        "Peterson shared a photo of his assistant.",
        "Jim is trying to call Jane but it's busy. Jane will call Jim around 8.",
        "Emma is going to visit her parents and grandma for Christmas.",
        "Mark sent Alex a photo of Frank.",
        "Paula wants to hang out with Rosa this weekend. Tim can't make it. Rosa suggests a movie and cocktails.",
        "Jacob, Charlie, Alfie and Leo are planning to buy a gift for John's son. They are considering a rocker or a teddy bear.",
        "Robert and Sandy are going to the cinema at 7:15.",
        "Caleb is coming to Nancy's place this evening. The weather is bad, but they will have each other.",
        "Kate hasn't been on Facebook for a week. Dan and Gina can't imagine their lives without it.",
        "Mel is in Lille. She is busy. She will call Sophie tomorrow at 11am.",
        "Steven and Greg are discussing the rumors about Davis trade.",
        "Alene is looking for a swimming suit in a XXXL size. Jake says they have swimming suits but the biggest size they have is XL.",
        "Alina is worried about Jason. He hasn't been in touch with her since he changed his job.",
        "Malia and Jax are going to Jacob's home. Jax sings in the car when he is alone.",
        "Joanne and Tracy are planning a party. They need plastic cups and cutlery. Joanne has some left from the last time. They need juice and sodas. They will get them in Tesco. They will also get some snacks. Joanne will buy some nachos. Tracy will make guacamole from",
        "Bill is on his way to the rugby practice.",
        "Elisabeth is going to pick up Bruno and Fatima tomorrow at 7 a.m. They will arrive at their destination at about 10 p.m.",
        "Linda can't find the small knife with a yellow handle. Charles took it to the garage. He will bring it home when he's back from work.",
        "Emily broke one of Linda's green tea cups. Linda doesn't mind.",
        "Tammy is looking for a birthday gift for Tina. She found a grey t-shirt.",
        "Priya was on a radio show live across London today re: her congress and they asked where else she would recommend. She gave Lisbeth a mention too.",
        "Clair and Bob are trying to find out who is the one who is going to answer the question. Denis is not interested in the answer.",
        "Greg has cancelled his reservation for 6 people at 9:00pm.",
        "James has a wedding this weekend and he forgot to invite his friends. He needs a wedding date. Nicky and Carrie are his closest friends. James will pay for Nicky's ticket.",
        "Victor's sister is thinking about studying abroad. Victor's sister is afraid she won't be able to handle life on her own yet. Tom knows this feeling.",
        "Conny wants to swim in the pool. Jo doesn't mind.",
        "Karine has scheduled the celebration for June 30th. Eleonore will participate with 3 people. Jane's participation will be confirmed later.",
        "Melissa has just landed in Rome. She's sick and tired. Ann and Joan will meet her tomorrow.",
        "Mia and Olivia are discussing Ella's engagement to an older man. They think that Ella will break up with him soon.",
        "Chloe's dad is in the hospital. He will be there for at least a week. Chloe can visit him today.",
        "Alex is going shopping.",
        "Luana sent Roy a photo of her new haircut. Roy thinks it looks cool.",
        "Don saw Anna in class today. She wasn't feeling well and left during the class.",
        "Kim is settling in her new place. She will get her school schedule tomorrow. She will call her mom tomorrow.",
        "Kelly went on a date with Tom yesterday evening and thought he was going to propose. She didn't tell him that she had booked a table at a very popular restaurant weeks in advance.",
        "Luke and Bryan are upset about Manchester United's loss against Valencia. They will play against Liverpool on Sunday.",
        "Roman found a wallet on the street. Klaus advises him to contact the owner of the wallet.",
        "Ann wants to know where Martha bought a green dress. Mary thinks that Martha bought it in Reserved.",
        "Noah is going to Leeds for a music festival on Friday evening. He has two spaces left in the car. Charlie and Benjamin are going to join him. Benjamin will be picked up from work on Friday.",
        "Blair, Dale and Tiffany are discussing VR.",
        "Phil has passed away.",
        "Sally found an online resource of all the freedom of information FBI files. Dom is going to check it out once he gets home from work.",
        "Graham recommends a stand-up comedian to Hank.",
        "Tony is looking for a present for Mary.",
        "Harry will be late. He will be half an hour late. Gina will be waiting at the cafe.",
        "Ian has lost his English notebook. Mark has found it in his backpack.",
        "Memphis has heard a new song by Quavo. Gigi will look for it when she gets to the WiFi.",
        "Jenni is going to meet Megs at the local pub.",
        "Liam is asking David about a box. David is in Poland and his granny passed away. He will find the box after he returns.",
        "April and Matt are going to check out a mattress tomorrow.",
        "Ford will pick up Gary and Gerard at 6.30PM. They will go to the party.",
        "Ingrid and Bart are discussing the decorations in their house. Ingrid has put up the tree and Sammie has decorated it. Bart thinks it looks funny. Ingrid will try to change it when Sammie is asleep. Bart asks if Sammie has done the nativity as well. Ingrid says it's Noah'",
        "Ben is looking for Jamie's friend who was at Don's party yesterday. Barbara is not that friend.",
        "Emma asks if all of them live in Cambridge. Rebecca, Jack and Leland don't live there anymore. Leland lives in Norwich now. It takes him 1h20min to get to the university by car or train.",
        "Adam is asking Mary to cover for him today. Mary can't do it because Gill has a flu. Joe will cover for Adam.",
        "Jessica is going to meet her parents tonight. She's not sure what to wear. Judith advises her to wear the turquoise dress and the second pair of shoes.",
        "Issy is stuck on her French for Miss Piggy. Meg did her answers about her family. The assignment is due tomorrow.",
        "John is inviting Mike and Chris to watch a game at his place at 5 pm. Mike is free and will be there. Chris is not sure when it is.",
        "Adam and Mark have seen Dizzy's latest clip.",
        "Luke wants to know the best time to visit Mine. Molly suggests early autumn to see the colours. Luke is impressed by the beauty of the place.",
        "Alexa and Ruben Cesar are standing next to each other in the CCBB.",
        "Theresa is back at the office. Nina and Connie had a lot of fun at the beach. They are planning on going again in 6 months.",
        "Joyce and Maria saw something funny.",
        "Ryan asks William if there's milk left. William doesn't know. Chad says there's still some, but they're running out.",
        "Ryan asked Puck about the name of the movie they watched yesterday. Puck told him it was \"Fantastic Beasts: The Crimes of Grindelwald\".",
        "Sam and Alice are planning a board games night at the Game Pub situated near Palace of Science and Culture on Friday night at 9pm. Sam, Paul, Christie and Nate are joining them.",
        "Perry is looking for someone working in EY. Josh knows a guy who works there. Perry wants to know how it is to work there. Josh will tell the guy to reach out to Perry.",
        "Cris is at the store. Eve asked for some advil.",
        "John is cooking and George is feeding his cat. George will bring his boardgames and buy John a pack of Marlboro Gold cigarettes.",
        "Taylor's tire is punctured in front of the shopping mall.",
        "Jorge is waiting for Dusan. Dusan is trying to get there as fast as possible.",
        "Tracy wants another chance with Sophie. Sophie doesn't believe Tracy loves her. Tracy feels alone and Sophie had to pay Tracy's debts. Sophie is blocking Tracy.",
        "Jerry wants to borrow a bike for the weekend. Amanda and Charlotte are willing to lend him their bikes. Charlotte's bike needs to be pumped up.",
        "Jessica and Donna did their workouts. Donna did a half mile sprint this morning. Jessica and Donna will meet on Saturday morning.",
        "Nicole is going on a date with Tom.",
        "Niles and Rosa are going to have pizza today. They will meet at the station and walk from there.",
        "Sasha has a crush on Fabiano. She's shy and doesn't want to ask him out.",
        "Hiram is waiting for the bus.",
        "Theo, Clara, Brett and Gwen are discussing how to support Greg and his family. Greg is in hospital and will stay there for 4-5 weeks. His wife Sandra is on her own with the kids. Clara will get them some groceries tomorrow. Gwen will drive Duncan to school whenever Sandra needs. The",
        "James is asking Nick about the forest day at school. Nick says it's on Friday and they need to bring waterproofs and wellies. James is asking if they need lunch or if they should eat before they go. Nick says they should eat before they go.",
        "Samantha and Aubrey are talking about Aubrey's new job. Aubrey got the job but had to quit after two weeks because the company had unreasonable expectations. Aubrey's mum managed to get her a job through one of her friends. Aubrey will be working there until the end of the holiday.",
        "Kori has a doctor's appointment at 7 AM and needs a car in the morning. Leandro needs to be at work earlier.",
        "Phillip invites Liz to come over for the weekend. Liz is not sure if she should.",
        "Rose, Helmut and Mary will clean the place after the party.",
        "Liam can't handle Amy anymore. She broke his plates yesterday because she thinks he has feelings for Dalila.",
        "Jake's black pants are on Stu.",
        "Xavier and Hester are discussing about voting. Hester is not going to vote because she doesn't know anything about the candidates.",
        "Kitty wants to wire money to Barb and Ken.",
        "Andres and Laura are going to see Cold War at the Kulturbrauerei on Thursday at 8:45.",
        "Toni is looking for her brown pants. Dorothy tells her that they are in her top drawer.",
        "Vera is planning a get-together party on Friday evening. Olga will join her and will teach her how to play the game \"Mafia\".",
        "Charles and Joe are discussing about Lukaku's performance in Manchester United. Joe is defending Lukaku and believes that he will perform better in the future.",
        "Lisa is looking for Ian. His bike is still here. Kate thinks he might have gone to Ron.",
        "Kyle, Kian and Jodie are going to watch the game at a pub next to Jodie's place. The match starts at 8pm. Kian will write to Kyle in the afternoon.",
        "Guillermo has just finished his presentation. He got the highest possible amount of points and the teacher said it was the best presentation so far.",
        "Mel's jacket is on the chair. John will bring it in tomorrow.",
        "Henryk is buying himself coffee for 13:30, paying with 50. Guy returns him 40. Andrzej asks if Henryk has ever worked a hard physical job. Henryk says he has. Andrzej says that after 10 hours on a Saturday, you really don't give a shit.",
        "Grace wants to be picked up an hour later.",
        "Brandie is on her way to meet Ezra. She will be there in 5 minutes.",
        "Jeffery and Elisabeth are going to buy 2 bottles of water.",
        "Samantha, Amy and Nicolas are going to Fiasco tonight.",
        "Max and Payton are discussing books. Payton has just finished reading Hyperion by Dan Simmons. Max is interested in reading it. Payton will lend it to Max.",
        "Anthony is tired and probably hungover. Jamie and Jeff had a crappy night. Jamie hung out the washing.",
        "Anna is unhappy with her life because Jim won't let her go out. He expects her to pay the bills and rent, and he's a parasite. She needs him for the heavy work around the property, like chopping the firewood.",
        "Al and Rob haven't seen each other for 25 years. They are going to meet for dinner next Thursday.",
        "Jayce tried to approach Jackie but she's not into him. She's seeing someone else.",
        "Kathy misses Aleksandra and wants to meet her soon. Aleksandra is busy until the end of the month, but she will call Kathy soon.",
        "Jules, Sim, Kiri, Shannon and Anisha are going for a drink on the 27th.",
        "Kate is a girl who likes Trump and girls. She is not a redneck.",
        "Zak and Clay will meet at evening prayers.",
        "Ella and Joshua will meet in Brooklyn after 8PM. Ella will book a table.",
        "Stan is going to wish Dan luck.",
        "Bella needs Jacob's guidance for her interview tomorrow. Jacob is free at 2000 today. Bella will pick him up at 2000.",
        "Stan needs help moving stuff out of his garage. Leo, Fiona and Clay are willing to help. Fiona will bring her dad's van. Stan will offer a crate of beer and pizza.",
        "Monica, Elisabeth and Nathaniel are going to the forest tomorrow. Monica will bring a cake and some olives. Nathaniel will bring pancakes. Elisabeth will take her parents' car. Elisabeth has a surprise for them.",
        "Robert is waiting for David. David will be late.",
        "Travis has joined the police academy to become a road cop. He shut down his gym because it was not profitable anymore.",
        "Meg has transferred money to Robert. Robert has already paid it all. The gift is wrapped and ready.",
        "Mike wants to borrow Ian's car to go on a date with Mary.",
        "Stu and Mike are talking about Annie and Liz. Annie dyed her hair blue.",
        "Joe and Chris are planning to meet up in December.",
        "John has Monday off and he can come to Wendy's on Sunday evening. Wendy will also take Monday off.",
        "Millie and Deedee are talking about their families and their jobs.",
        "Jill and Claire are talking about a man who sat next to Claire at the movies. Claire thinks he was all right, but Jill thinks he was gorgeous. The movie they saw was Gone with the Wind.",
        "Ammalee has been wearing gel nails for over a month. She is considering acrylic nails or linen nails next time. Maryann recommends acrylic nails if she wants them to last longer.",
        "Dan is finishing dinner. Lautaro and Pablo are going to have a few drinks in Palermo and then head to Niceto Club. They are going to a party called EGYPTIAN NIGHTS. The price is 100 pesos. They are meeting at 10.",
        "Matthew needs a replacement for Adam's quiz next week. Cara and Marcus will take it. Marcus will use his questions. The primary topic will be sports and around 30ish people are expected to come. Abigail will be the organizer.",
        "Dave was cranking the volume on his computer when his headset was plugged in.",
        "Rick asks Marty if they need to bring anything for their field trip tomorrow. Marty tells Rick to listen to the teacher from time to time. Rick asks Marty about his question. Marty tells Rick to bring something to take notes with. There will be a test by the end of the week. Rick and Marty are going to",
        "Angelina and Jennifer are going to the cinema on Friday at 7-8 pm to see \"First Man on the Moon\".",
        "Trisha and Kylie are going to spend Valentine's Day at Lisa's place. They will watch Bridget Jones.",
        "Alice dropped her mobile into the bath and it's broken.",
        "Isabella and Maria are talking about a video that Isabella and her friends have made. They have spent 5 days shooting and a week editing it. Maria thinks it's really good and Isabella is proud of the work they did.",
        "Alice's family is in a network that offers free calls within the network. Mark suggests that if Alice changes to another network, she will get free calls to everyone.",
        "The website has Rick's points wrong. It should be 2345.12 and it has him at 2144.98.",
        "Leonard's father bought a smartphone. Leonard is teaching him to use WhatsApp.",
        "Greg made a reservation on John's website. The hotel cancelled the reservation. Greg is in Barcelona and has nowhere to stay.",
        "Sam is baffled by recent events. Pam thinks there are more unconsious people nowadays because of tabloidisation of the whole media world. Sam sees no solution to that.",
        "Donald is at university. He will be home at 5. Laura will be home at 5. Laura forgot to buy bread.",
        "Anna wants to see the videos from yesterday. Jack has already sent them to her via Google Drive. Anna can't open them on her phone. Jack will send them via WeTransfer later tonight. Jack will also put them on YouTube.",
        "Larry wants to play co-op games on his PS4 with Gabe.",
        "Diane is going to see Grandma today. She is going to an Italian restaurant near her house. Gregory saw her two days ago.",
        "Lisa's son Tommy has got his first haircut.",
        "Diane is getting married. Lara will come to the wedding.",
        "Harper wants to go to Disneyland. Ashlee says they don't have enough money and they have debts.",
        "Amadeus is sad because his life is miserable.",
        "Tom and Adam are going to book a place in NYC. Adam found a nice one for 38 dollars per night. Tom is going to check if there are towels and wifi.",
        "Raymond and Spencer are going to meet today.",
        "Thom will help Madison with her dog.",
        "Tony told his parents about his relationship with Mark. His mum knew and his dad is not pleased.",
        "Olivia and Megan are planning a birthday party for Poppy, who will be turning 100 in March. They will invite only family and their own children. The party will be held at Olivia's house. They will cook the main course and dessert themselves, and Chris will take care of the beverages.",
        "Wilkes is considering going to Jordan with his girlfriend. Peyton's roommate has been there and he recommends it.",
        "Liam is looking for a satellite box with 2 satellite and 1 DVB-T2 for Saorview with PVR option and SATA hard drive. He doesn't need a camds line at the moment but would need either WiFi or Ethernet connection. He is not worried about 4k TV. Filip will",
        "Mason and Robert are going to meet at Pizza Hut.",
        "Dack voted for the man of his choice.",
        "Lauren is asking someone to take her night shift on Friday because her child is sick. Dennis is annoyed. Mickey will take Lauren's shift on Friday and Lauren will take Mickey's shift next Thursday.",
        "Christine and Jane are talking about Sean and Natasha's divorce.",
        "Maola's son Nethan is 12 and a half months old and he still doesn't speak. Ontina suggests to answer him back with longer sentences and to sing his favourite song together. The second method is to read the book together. Ontina's son started to talk around 16 months and suddenly talk so",
        "Freddie and Hollie had a meeting.",
        "Kate and Michael are in the seminar room 1. They are trying to use the university laptop connected to the projector. Lia is not in the room.",
        "Patrick is Rini's assistant. Rodrigues is supposed to meet Rini today, but he is busy with his client. Rini is not interested in Rodrigues' dates anymore.",
        "Conrad is not sure what to get for Grandpa's birthday. Jasmine suggests that Grandpa would be happy if Conrad came to see him. Grandpa wanted a book, but Jasmine can't remember the title. Conrad will ask his mum.",
        "Kelvin and Candy enjoyed their first meeting. They will meet again tomorrow.",
        "Adrien and Joona don't like Florence. They think it's a museum, a very touristic, almost fake place. They also don't like Italian food.",
        "Max will be late because he is having a beer with Tom.",
        "Alice is asking Lucy if she is still in town. Lucy is on the train.",
        "Sammy and Anna are listening to music. Sammy likes it. Anna has good taste for music.",
        "Leo asks Chiellini when he is coming to Italy. Chiellini says he doesn't know but not anytime soon. Chiellini is in Spain now.",
        "Maya is going to college today. Jose is sick.",
        "Beth has a free ticket to see Roma on the big screen. Tim has already seen it on Netflix but he can go with Beth.",
        "Kay lost her earring by the copy machine. George didn't see it. Kay will check with Patty and put a note in the breakroom.",
        "Zoli will spend his last day with Jess.",
        "Matt sent an email to his boss complaining about the new organization and accidentally sent it to Harris. Amy will try to stop Harris from gossiping.",
        "Jessie and Rose are supposed to work on a project together. Rose is very busy with her other classes and play practice. Jessie wants to meet twice this week to work on the project.",
        "Austin needs funny quotes for Mr Peter's card. He also wants to buy a hole puncher for Mr Peter. Graduation is in 2 days.",
        "Joona is asking if Jenny and Tim have arrived in Stockholm. Jenny and Tim are staying a few days in Mariehamn.",
        "Laila wants to make an appointment for Sunday. She needs a manicure, pedicure and facial done. She also wants to get her hair cut. Shaun suggests her to pay for 3 services and get the fourth one free of cost. Laila agrees. She can visit the salon after 4pm on Sunday",
        "Paul wants to know how good Katie's French is. Katie has a TEFL certificate. Paul needs someone who can help with the French team. Katie suggests Pete.",
        "Jenny has recorded a video of Tommy's first steps. Greta has sent a gif of a cute cat.",
        "Tim wants relief.",
        "Rachel has a photo of an app. Diane knows it.",
        "Paul's dad passed away 3 years ago. Paul is feeling down today.",
        "Susan is bored. Tom is sleeping with his eyes open. Linda has drawn a picture.",
        "Aiden wants to hang out with Amelia. Amelia is not interested because she has a boyfriend. Aiden is pushy.",
        "Meg is baking blueberry muffins with her little helper.",
        "Griff and Tea are going to meet in the park in 10 minutes.",
        "Rachel is upset because Dean told everyone that the trip was cancelled because of her.",
        "Pina and Dick are in Cancun. They've been fed to alligators but they didn't like them. They're staying in Cancun for 4 nights. They're going to Isla de Mujeres tomorrow.",
        "Daniel finished the best anime ever, Grand Blue. It's about diving, but in reality it's more about drinking. Tyler will put it on his \"to watch\" list.",
        "Eve and Carla are going to see the new HP film on Saturday at 16:50. After the film, they will go to the main square for some hot wine. Alice is going to a wedding.",
        "Laura wants to buy a phone from Albert. Albert doesn't mail it.",
        "Ida left her sweater in the chemistry lab at school.",
        "Karen, Don, Margaret and Maya are going to eat chicken with veggies tonight. Margaret wants to make pancakes with Nutella for dessert.",
        "Albert will have a beer tomorrow.",
        "Adam showed Tom a video of a new model of Porsche Cayman. It has an 8-cylinder, 49.2 Nm petrol biturbo gasoline engine, 404 kW (550 HP) and maximum torque 770 Nm. It costs about",
        "Evelyn is fed up with the mess in the kitchen. Jenny will clean up when she comes back.",
        "Jenny will explain algebra to Tim tomorrow.",
        "Gabi and Natasha are roommates. They have a messy little place. Gabi suggests a cleaning schedule. Natasha agrees. Gabi sends her a link. Natasha will start cleaning this week.",
        "Sarah got the acting job. They will celebrate at a restaurant.",
        "Tara has a PowerPoint presentation tomorrow. Siobhan will have a gin after work.",
        "Maria is asking Steven to help her cross the road. It's too noisy and confusing. Steven helps her cross the road.",
        "Karen and Sandy haven't heard from each other for a while. Sandy is still single and working at the same job. Karen has changed her job recently and is excited about it. They plan to meet up for a coffee next week.",
        "Drake and Fran will meet at Fran's place tonight.",
        "Darryl and Kathy are talking about Brian's fish.",
        "Trish has a Friends t-shirt and she's going to give it to Rose.",
        "Helen won't be able to go to the party because she has to finish her project.",
        "Mark has seen the doctor. Dan's mother died of cancer. Mark's mother had cancer too.",
        "Sam is on her way to Trevor's place. She will be there in 10 minutes. She will buy vodka and ice for Trevor.",
        "Bernard is going downtown for lunch. Jeff is also going downtown for lunch. Bernard asks Jeff to give him a ride. Jeff agrees.",
        "Adam and Debbie are going on a date tonight. Adam wants to do something different and exciting. Sean suggests a picnic under the stars or going to the circus.",
        "Tina is not sure what to wear today. Sam thinks it's ok for him, but Tina might be chilly.",
        "Ellie and Becky want to send postcards from here. Diego will pick up the mail from them today.",
        "George is asking about the price of blueberries. The shoplady says they cost 18zł. George thinks it's expensive.",
        "Alfonso, Marga and Claire are meeting for breakfast tomorrow at 9:00 at La Tienda de la Cerveza, a bar next to La Latina metro station.",
        "Bob is having a games night at his place. Rob is coming.",
        "Lenny made a beef stew with sweet potato.",
        "Tommy is coming back. Agnes will warm up the dinner. Olga will get some bread.",
        "Cassidy has found her glasses in the fridge.",
        "Jenny, Tom, Peter and Mary are planning a trip. They will go to Barcelona and Madrid. After Madrid, they will go to Sevilla or Granada and then to the coast.",
        "Ruby and Ruben are in love.",
        "Tamira and Shelley watched Rupaul tonight. Blessidy wore a tent as a skirt and her make up was ridiculous.",
        "Kent and Clark failed the quiz.",
        "John and Jean-Marie are still in Kokologo. They will continue their journey to Ouagadougou.",
        "Rebecca and Larissa are going to a wedding. Rebecca is wearing a beautiful dress. Henriette is going shopping tomorrow.",
        "Lily will live with Mia's mum till the end of January. Mia will be around from 17th of October for a few days. Lily will do couchsurfing in Açores.",
        "Caroline has planned the whole trip. They will arrive at 4 but won't get to the hotel until 6. They will take the bus from the airport, which takes 40 minutes but is three times cheaper than the train. They will change and go for a little walk around the Vatican City. They will have dinner",
        "Justin and Bella apologize to each other.",
        "Martha can't find Tom and Peter. They are at the rare. Peter is on the way to pick Martha up.",
        "",
        "Peter had a car accident this morning. He was driving in the morning traffic when he lost traction and banked. He was stopped by a lantern pole. His car is broken, but he is fine. His father came to pick him up. He is waiting for the mechanical expertise. There were 3 more accidents in the area.",
        "Abigail is reading an inspiring book. Natalie is tired and disenchanted with school.",
        "Tom got Andrew's phone and it doesn't work anymore. It was in the washing machine for 2 hours. Andrew's warranty doesn't cover this situation. Tom will try to fix it at the repair shop.",
        "Klay lost 20k last week and it keeps plummeting. He will never put any money in such bullshit.",
        "Tori and Sylas will talk in college tomorrow.",
        "Isabelle and Lucas enjoyed last night's karaoke.",
        "Sabrina is looking for a new case for her iPhone. Ellie bought a cool one with glitter recently. Sabrina likes cute ones with animals.",
        "Emily is on a Flybe plane that has been delayed for an hour. Andrew reassures her that Flybe is one of the safest low cost airlines in the world.",
        "Miriam and Mary are discussing about Jenny.",
        "Fred, Gabe, Steve and Sebastian are trolling Gabe.",
        "Jenny is Patricia's mum. Dan attended the PTA meeting. Midterms are scheduled for the second week of January. There is only one school trip ahead of us - they are going to the science museum.",
        "David and Bill are waiting outside. Victoria will be done in 10 minutes.",
        "Tim wants to talk to his dad, Barry. Barry is busy and will call Tim in 10 minutes.",
        "Peter is ordering food for Susan, Mark, Mike and himself.",
        "Joe is telling Rob and Tim that Victory Street is going to be closed for reconstruction. Rob and Tim are upset because they have to commute through Victory Street every day.",
        "Tory, Maya and Corina are going to the conference in Accra, Ghana in June. The deadline for applying is at the end of February.",
        "Vivian is throwing a party for her colleagues and there are some vegans among them. She's looking for a vegan recipe that would work for sure. Thomas recommends a vegan stroganoff recipe.",
        "Kitty wants to wire money to Barb and Ken.",
        "Adrian is at home. Ron will be home after 5. Adrian is thirsty.",
        "Bonny and Lisa are going to watch the new Sabrina series on Netflix tomorrow.",
        "Walter and Wendy had a lovely weekend.",
        "Joey is upset with Janice and Eric. He wants them to end their misunderstandings.",
        "Lola and her kids will come to Jerry and his wife's house in mid-July.",
        "Raquel is waiting for the spreadsheet to be done. Gary will finish it in 15 minutes.",
        "Adam and Nina are planning a family get together this Sunday.",
        "Rebecca sent Oscar a copy of the invoice yesterday. The reference number is 889905. Oscar will check if the order went through successfully. Everyone is meeting up at Tasha afterwards.",
        "Jerry and Max are discussing what to bring for a school project. Jerry didn't think about it yet. Max thought about volcano.",
        "Richard sent Alice a photo of Emma's dress. Alice thinks it's sparkly and fluffy. Richard is Emma's grandfather. Alice is Emma's mother. Richard is Alice's father.",
        "Henry and Chloe are chatting. Chloe is in Italy. She is doing well. She has been sightseeing. The weather is lovely. She has been quite productive. She has been doing a lot of interviews. She will be back in a few weeks.",
        "Konrad's brother has played Fortnite for a while, but now they are playing League of Legends. Tom has never heard of it. It's the second most popular game in the world. Tom will arrive at the hotel at 20:45. Konrad will pick him up at 22:3",
        "Dalton, Axton and Brand are discussing about Lori's birthday next week. They are thinking about a gift for her.",
        "Tim and Anne are in love.",
        "Andrea, Jody, Angelo and Lorenzo all lived in Berlin.",
        "Grace is sitting in the very right corner. Kelly is going the other way. Ricky is parking the car.",
        "Betty and Henry are going to have pizza next week.",
        "Robert met his girlfriend on Tinder.",
        "Oliver needs to vacuum and Wendy will take the dog out for a short walk.",
        "Allen needs a gift for his wife's birthday. She likes to work out, bake, and is into music. He can't get her kitchen stuff, and he's afraid to get her workout stuff. Millie suggests a spa treatment or a bottle of her favorite wine or gin.",
        "Frank and James are going to a party at Joe's.",
        "",
        "Dominic has sent Hazel a funny Mars photo.",
        "Pietr is considering buying a new iPhone. Maria advises him to wait for the next generation.",
        "Noah can't go with Alexa and Olivia today because he has to work. He might join them tomorrow afternoon.",
        "Nola wants to join the VolunTEER organization.",
        "Pete has lost his wallet. Sandy will look for it.",
        "Dave needs to go to the office to send off all the project files he has on his computer. Jess is still there and she's about to leave. Emily is just 2 minutes away and she can pop in.",
        "Ron apologizes to Dorothy for his drunken messages.",
        "Rosanna is in Warsaw and it's nice there. Leo is also in Warsaw and it's a bit windy but quite warm.",
        "Adam wishes Rosie and Thomas a Happy New Year. Rosie wishes Adam a good year.",
        "Rita and Alger are friends. Alger found Rita. Rita travels a little bit.",
        "Aliza is trying to cook something but not getting good results. Miller is coming to help her.",
        "Tom: How about blind date? <file_other>\nMark: I hope he was my date <file_photo>\nJonathan: It’s easy to pull off a turtle neck as long as you take off your glasses first.\nGeorge: HA HA\nBarry: You don't know how right",
        "Lee: The betting site is back online right now.",
        "Tom needs Mary's help with his essay. Mary will come over to Tom's place tonight.",
        "Michael can't come tonight because of work. Jennifer will see him tomorrow at 8 pm.",
        "Riley is texting with Brandon's brother.",
        "Louise's friend Ann is pregnant. She is going to have a baby shower. Louise is not sure if she wants to go to the party.",
        "Theresa, Will, Miranda and Molly are considering going to a party in La Olivia.",
        "Jimmy is looking for Maria. Peter saw her in the main corridor. She is in the office because she has a deadline today.",
        "Ian, Gina, Noah, Harry, Kelly, Toby and Bill are currently reading different books.",
        "Frank and Vicky are discussing the family dinner. Vicky's mother criticized her for wanting to study abroad.",
        "Jeff and Rich will talk about the show Narcos on Monday at work.",
        "Ollie didn't work out last weekend and just sat around and drank. He didn't get any invites this weekend. Abby is going out with the girls. They will meet next weekend.",
        "Adam forgot his wallet at home.",
        "Carl needs 10 bucks till Friday. Rosie will lend him the money.",
        "Ted is going away for the weekend. George will take care of Spliff. Ted will pay back. George will water the flowers.",
        "Ewan's car broke down and he's going to be late for the party. Isabel is going to pick him up.",
        "Tommy is in a beautiful place and he wishes Linda was there.",
        "Keifer, Mark, Mike, Michael, Canh, Jeff, Cha, Alan, Pabo, Pete, and Pabo are watching the NFL game between the Steelers and the Falcons.",
        "Jack forgot to get a beer with Matt tonight.",
        "John is at the entrance. Jerry and Mary are already inside at one of the big tables.",
        "Taylor didn't get accepted to vetmed this year. He might work for a couple of years or take another year to boost his average."
    ],
    "best_params": "{'do_sample': True, 'generation_seed': 42, 'max_new_tokens': 70, 'no_repeat_ngram_size': 0, 'stopping_criteria': [<llmsearch.scripts.stopping_criteria.MultiTokenStoppingCriteria object at 0x7f3b38303610>], 'temperature': 0.1, 'top_k': 50}"
}