{
    "scores_before": 0.26152565713310133,
    "scores_after": 0.25086302690438184,
    "outputs_before": [
        "Lucy and Sue are talking about JK. Sue tries to avoid it. Lucy thinks it's disgusting. Sue listens to the radio in the mornings.",
        "Simon is painting his cupboards green. Angela is meeting Chris. Wendy is having a lazy weekend. Ben is in the garden.",
        "Petra is in lectures all day. She will call Zack back in the lunch break. Zack can also write to her.",
        "Amelia and Anna are not going shopping tomorrow. Anna is meeting her study group in the morning and then she has to help her mum cleaning windows in the evening. Amelia is going shopping next weekend.",
        "Niki and Jeanna are talking about Angel. Angel has a boyfriend. Angel is disgusting. Angel eats in front of the teacher. Angel's boyfriend is disgusting too.",
        "Gabriel is picking up his new car today. It's a Mercedes-Benz, sedan, 180hp, 0-100 kmh in 6.2 seconds. It cost 55k. He's going to insure it now. He wants to go for a ride later.",
        "Danny and Kate are bored. Danny heard that Frank and Sue are dating.",
        "Jenna is cooking tonight. She is going to cook chicken in Indian way. Lilly and Eaton are going to eat with her. Lilly is going to add her spices to Jenna's food.",
        "Maria's parents decided to move to Costa Rica as soon as her father retires.",
        "Monica asks Larry and Fiona about their coming home time. Larry will come home at 6 and Fiona at 7:30.",
        "Adam, Kim, Kris and Jackie are discussing the presents they usually get for Christmas. They all agree that it's not very practical and they often end up with things they don't really need or want. Adam wants to buy a stereo system, but he needs a bit more money. He's afraid to tell his parents",
        "Deb missed seeing Danie when she visited last month. Danie would love to visit Deb some time. Danie is on the to-do list. Danie and Deb should do something together sometime.",
        "Irma will take the garbage out when she goes out.",
        "Lane and Cadence are talking. Lane is going to sleep now. Cadence will send him something funny on Facebook. Lane will write to him tomorrow when he can Skype for a while.",
        "Sandy wants to join Tina. Tina is writing an essay. She has 5 pages left.",
        "Molly is not eligible for short term disability as she gets weekly allowance from her insurance. Dirk told her about a law firm that doesn't take any fees until you get paid. Molly is considering getting her loss of wages back. Molly has credit card debt running high. Molly doesn't know when she can get back to work as",
        "Anna and Zoe are talking about Zoe's dress. Zoe bought it from C&A.",
        "Robbie invites Kris to a board game night on Friday. Kris agrees to come.",
        "Donald is asking Scofield where Mike is. Scofield told him that Mike was not at home. Donald doesn't believe him.",
        "Esme has finished her file photo.",
        "Diana is the new neighbor of Linda. She is waving to Linda from her house.",
        "Bernie's wife will be out of town for a couple of days. Chris and Marty will come over to Bernie's house on Friday after work. Chris's wife wanted to go to some exhibition, but they decided to implement date night instead.",
        "Shelly's daughter Taylor found out there was no Santa. Shelly called the teacher. Diane misses the Santa days.",
        "Katie is in front of the door. Martin is asking someone to open the door. Andy is not at home. Greg is shitting and will open the door in 5 minutes.",
        "Kate's boyfriend Matt fell off his bike and has a broken leg. Simon sprained his toe yesterday.",
        "Frank is going to IKEA to get some furniture stuff for their kids. He might get something special for Morris, his bday is coming up. They need some new lamps. Eliza needs a new lamp for Jeanine before she goes to school. Frank will go for a few rounds in Ikea and will let her know",
        "Noel is late for a meeting with a client because of the cyclists blocking the city centre. He has to put it off. Oliver invites him to grab a few beers.",
        "Leo and Evie are talking about Miley's new song.",
        "Pamela's dad has just come from the police station. He hired Jack, who was in jail for fraud. Jack begged Pamela's dad to pay back his debt. Pamela's dad thought he became another man. He cut down his salary for a few months for the amount of money he asked Pamela's",
        "Amber lost her flower necklace at the party yesterday. Mariah found it in her pocket. Gabriel is cleaning his flat.",
        "Jack has played RDR2 and he thinks it's great. He used to play with cowboy-themed lego sets when he was a kid.",
        "Leah, Gary and Maggie are discussing a new track by a band. They are excited about it. They are planning to go to a concert.",
        "Jessie's boyfriend Tom sent Martha a message. He told her that she looked cute in the green dress. Samantha and Fiona think that Tom is an asshole.",
        "Brandon wants to see a new Queen movie with Sheila and some others.",
        "Gaby and Ivan are going to Venice to see the Biennale. Leda and Marc are going to see Homo Faber.",
        "Rose bought a new jacket.",
        "Amy, Oli, Deborah and Adrienne are going to Spoons at 5:30.",
        "Larisa is waiting for Hubert to bring the spoons and she is going to vacuum the hall. Hubert will take care of the cleaning and taking out the trash.",
        "Marie loves Tamara's T-shirts.",
        "Tessa and Austen are going to read letters tomorrow.",
        "Lin is bored and can't sleep. Samuel is sleepwalking and typing to Lin.",
        "Griff and Tea are going to meet in the park in 10 minutes.",
        "Patricia and Jacob are planning to meet next week. Patricia will let them know tomorrow.",
        "Alan is going to visit his dad in the afternoon.",
        "Sharon is looking for Harry. He was at the canteen at lunchtime and later left the building to get his hair cut.",
        "Hannah is going to put all the recipes she's gathering for Mary into one pdf.",
        "Steve is waiting for the technician.",
        "Donna wants to know if there is a laundromat around. Ellis tells her that there is one, but it closes at 10 PM.",
        "Henning and Max are discussing the nationality of waiters. Max thinks that there are no huge differences throughout Europe. Henning thinks that Italian waiters are much nicer and much less professional than in Germany. Max thinks that all those theories say more about their authors than about the waiters and the countries.",
        "Lisa asks Dan how he is. Dan says he is much better now.",
        "Angelica is feeling ill a bit.",
        "Terry is looking for a physiotherapist in Carlisle. Jennifer recommends her physiotherapist, David. He helped her with her spine and her boyfriend Mick with his knee. He is a magician, Jennifer says.",
        "Julian and his band have to cancel their performance tonight at Blind Goose due to unforeseen circumstances. They are planning to reschedule it for next Tuesday, weather permitting.",
        "Conrad is pissed off because Frank forgot to meet him.",
        "Taylor is waiting for Owen.",
        "Andy yelled at Laura for an hour. He was upset over some things at work and just exploded. He ordered sushi and bought a bottle of Laura's favorite wine. Laura will think about coming home.",
        "Ann and July are going to the cinema tonight. Ann has to buy a new dishwasher for her mom.",
        "Fanny wants to make an appointment with Carol on Friday at 3.30 pm.",
        "Ann and Mark will meet at Ann's place at 11 on Saturday. They will decide where to go.",
        "Isabel and Joe are planning a trip to New York. They are staying in Soho. Gina recommends Barbuto, Café Altro Paradiso and Via Corota for Italian restaurants.",
        "Adam is looking for a band name. He wants to buy a CD for Samantha.",
        "Howard's sister Claire got a job at a cafe that employs only people with special needs.",
        "Dianne is pissed off because Andy told her that he is making a lot of money. She doesn't like that. Barrett thinks that Andy is always like this and Dianne should just let it go.",
        "Paul, Joe and Rob are going to an escape room on Friday. The theme of the escape room is narcos. Rob will book a slot for them.",
        "Meryl is going to the gala. Clint is not going. Roberta is working there.",
        "Miles had a dream where he was stuck in the 80's and couldn't figure out how to get back to 2018.",
        "Edward gave his mom $1,000 for her birthday. She gave it to her new boyfriend who lost it all gambling in Las Vegas.",
        "Jose passed his driving test. He's looking for a nice car now.",
        "Lenny and Rick are excited about the Venom trailer. Thomas thinks it's going to be rubbish.",
        "Luke, Chloe and Jack are going to the party. Jack will drive his car.",
        "Violet has read Austin's article.",
        "Joseph is sorry about what happened to Carlos' mates. Carlos says that it's not the first time this kind of things happen in Argentina. People can get really violent when it comes to football.",
        "Gemma forgot her keys and Suze invited her to come to her office.",
        "Kela sent Cher a birthday message and some photos.",
        "Pete is coming home. He's been in a line at the store. Nicole is making dinner.",
        "Jacqui has a new idea for a website. She wants to create a self-learning institute. Andy will write the architecture for her. The cost of getting the start of content is going to be something between two and three hundred dollars. Jacqui will see if she can get some crowdfunding going.",
        "Stephanie and Victor are going to see Captain Marvel together.",
        "Jill and Jack are talking about their upstairs neighbors who are having sex again. Jack is away and Jill is jealous. Jack is at a meeting and he will know tomorrow if his idea is accepted.",
        "Charles thinks long distance relationships don't work. Jim agrees.",
        "Michael and Jane have seen the last episode of Supernatural. They both liked it.",
        "Andy asked Sharol to pick up Mary from university because her car was hit when it was parked.",
        "Caroline and Blake are in Basel for the art fair. Hans and Reinhard are on their yacht in Monaco. Caroline can't join them because she has to be in Basel tomorrow. Hans and Reinhard will be in Monaco for a few days.",
        "Carol's computer stopped working. She needs help. Michelle will give her Bill's number.",
        "Diana's mother passed away one year ago. Danielle's mother was a communist and a fighter in the resistance movement. She was lucky to survive. She met Danielle's father in 1943. He was also a communist. He was killed one year after Danielle was born. Danielle's",
        "Adalyn and Nora are going to attend self-defence classes for women.",
        "Mat is waiting for Chris to finish his work. Chris is not answering. Mat will try to contact him. Mat is working on his presentation.",
        "Cass is ordering pizza for dinner. Drew and Cassie are having a date. Braden and Mickey are in.",
        "Wendy and Diana are planning a surprise party for Pam's birthday.",
        "Peter is home already. Liz will be home before 6. They will watch Netflix and drink wine.",
        "Scott is back in Uganda. Sasha is going to a party with her mates from the uni.",
        "Kyle has finished reading the new D&D expansion. Stephen, Carol and Josie are interested in checking it out.",
        "Boyle moved out because he was tired of living with his mom. He moved to Stonehenge with his buddy from work.",
        "Cora, Lydia and Kaylee are going to a spa.",
        "Sasha asked Dean to print her essay on modernism for her.",
        "Ralph has found a company called \"Venque\". Charles thinks that the company has very beautiful but expensive products. Ralph has found a bag from this company.",
        "Gera and Hope will meet at 2.",
        "Fiona and Tom are going to meet after work. Tom might be late because of a meeting.",
        "Caron found the Beautiful South on her Tidal app.",
        "Susanne, Lilly and Rachel are going to a concert. Susanne is asking what time the concert starts. Lilly is looking for their tickets.",
        "Dora can't come to the party because her mom is ill."
    ],
    "outputs_after": [
        "Lucy and Sue are discussing JK.",
        "Simon is painting his cupboards green. Angela is meeting Chris. Wendy is having a lazy weekend. Ben is in the garden.",
        "Petra is in lectures all day. She will call Zack back in the lunch break. Zack can also write to her.",
        "Amelia and Anna are not going shopping tomorrow. Anna is meeting her study group in the morning, visiting her grandma who turns 86, and then helping her mum cleaning windows. Amelia is looking forward to shopping next weekend.",
        "Niki and Jeanna are talking about Angel, who has a boyfriend. They are discussing how Angel behaves in class and how her boyfriend copes with her smell.",
        "Gabriel is picking up his new car today. He bought a Mercedes-Benz, sedan, 180hp, 0-100 kmh in 6.2 seconds. It cost 55k. He will insure it now. He wants to go for a ride later.",
        "Danny and Kate are bored. Danny heard that Frank and Sue are dating.",
        "Jenna is cooking tonight. She is cooking chicken in Indian way. Lilly and Eaton will join her. Lilly will add her spices to Jenna's food.",
        "Maria's parents decided to move to Costa Rica as soon as her father retires.",
        "Monica asks Larry and Fiona what time they are coming home. Larry will come home at 6 and Fiona at 7:30.",
        "Adam, Kim, Kris and Jackie are discussing their Christmas presents. Adam is fed up with getting socks every year. Kim and Kris are going to tell their families about their idea of leaving lists of presents they would like to get. Adam is going to tell Kim how to talk to her parents.",
        "Deb missed seeing Danie when she visited Melbourne last month. Danie would love to visit Deb some time.",
        "Irma will take the garbage out when she goes out.",
        "Lane and Cadence are talking. Lane is going to sleep now. Cadence will send Lane something funny on Facebook. Lane and Cadence will talk tomorrow.",
        "Tina is writing an essay for Monday. She has 5 pages left to write.",
        "Molly is not eligible for short term disability as she gets weekly allowance from her insurance. Dirk told her about a law firm that doesn't take any fees until you get paid. Molly is considering getting her loss of wages back. Molly has credit card debt running high. Molly doesn't know when she can get back to work as",
        "Anna and Zoe are talking about Zara's dress.",
        "Robbie invites Kris to a board game night on Friday. Kris agrees to come.",
        "Donald is asking Scofield where Mike is. Scofield told Donald that Mike was not at home. Donald doesn't believe Scofield.",
        "Esme finished her file photo.",
        "Diana is the new neighbor of Linda. She is waving to Linda.",
        "Bernie's wife will be out of town for a couple of days. Chris and Marty are going to come over to Bernie's house on Friday after work. Chris's wife wanted to go to some exhibition, but they decided to implement date night instead.",
        "Shelly's daughter Taylor found out there was no Santa. Shelly called the teacher. Diane misses the Santa days.",
        "Katie is in front of the door. Martin is asking someone to open the door. Andy is not at home. Greg is shitting and will open the door in 5 minutes.",
        "Kate's boyfriend Matt fell off his bike and has a broken leg. Simon sprained his toe.",
        "Frank is going to IKEA to buy furniture for their kids. He will also buy a special gift for Morris's birthday. Eliza needs a new lamp for Jeanine.",
        "Noel is late for a meeting with a client. He is stuck in traffic because of a cycling event. He is going to meet Oliver at the usual place.",
        "Leo and Evie are talking about Miley's new song.",
        "Pamela's dad has just come from the police station. He hired Jack, who was in jail for fraud. Jack begged Pamela's dad to pay back his debt. Pamela's dad thought he became another man. He cut down his salary for a few months for the amount of money he asked Pamela's",
        "Amber lost her flower necklace at the party yesterday. Gabriel will look for it in his flat. Amber fell asleep in Glen's car and Glen carried her inside. Mariah found Amber's necklace in her pocket. Mariah will bring it to the office on Monday. Gabriel will clean his flat after breakfast.",
        "Jack has played RDR2 and he thinks it's great. He used to play with cowboy-themed lego sets when he was a kid.",
        "Leah, Gary and Maggie are discussing the new track of a band. They are excited about it. They are planning to go to a concert.",
        "Jessie's boyfriend Tom sent a message to Martha. He told her that she looked cute in the green dress. Samantha and Fiona think that Tom is an asshole.",
        "Brandon wants to see a new Queen movie with Sheila and some others.",
        "Gaby and Ivan are going to Venice to see the Biennale. They will go to Giardini and Arsenale.",
        "Rose bought a new jacket.",
        "Amy, Oli, Deborah and Adrienne will meet at Spoons at 5:30.",
        "Larisa is waiting for Hubert to bring the spoons and she's going to vacuum the hall. Hubert will wash the spoons when he comes back.",
        "Marie loves Tamara's T-shirts.",
        "Tessa and Austen are going to study tomorrow.",
        "Lin is bored and can't sleep. Samuel is sleepwalking and typing to Lin.",
        "Griff and Tea are going to meet in the park in 10 minutes.",
        "Patricia and Jacob are planning to meet next week. Patricia's father has his 50th birthday next week.",
        "Alan is going to visit his dad in the afternoon.",
        "Sharon wants to know if Harry is in the building. Benjamin and Ali saw him at lunchtime. Josh saw him later, he was going to get his hair cut. The system has just collapsed, they need Harry.",
        "Hannah is going to put all the easy recipes she's gathering for Mary into one pdf.",
        "Steve is waiting for the technician.",
        "Donna wants to know if there is a laundromat around. Ellis tells her that there is one, but it closes at 10 PM.",
        "Henning and Max are talking about waiters and waitresses in different countries. They are discussing the theories of Louis about the waiters in Italy and France. They are also discussing the theories of Jakob about the waiters in Italy and Poland. They are also discussing the theories of Max about the waiters in Germany and France. They are",
        "Lisa asks Dan how he is. Dan says he's much better now.",
        "Angelica is feeling ill a bit.",
        "Terry is looking for a physiotherapist in Carlisle. Jennifer recommends her physiotherapist, David. He helped her with her spine and her boyfriend Mick with his knee. He is a magician, Jennifer says.",
        "Julian and his band have to cancel their performance tonight at Blind Goose due to unforeseen circumstances. They are planning to reschedule the show for next Tuesday, weather permitting.",
        "Conrad is pissed off because Frank forgot to meet him.",
        "Taylor is waiting for Owen.",
        "Andy yelled at Laura for an hour. He was upset over some things at work and exploded. He ordered sushi and bought a bottle of Laura's favorite wine. Laura will think about coming home.",
        "Ann and July are going to the cinema tonight. Ann has to buy a new dishwasher for her mom.",
        "Fanny wants to make an appointment with Carol on Friday at 3.30 pm.",
        "Ann and Mark will meet at Ann's place at 11 on Saturday. They will decide where to go.",
        "Isabel and Joe are planning a trip to New York. They are staying in Soho. Gina recommends Barbuto, Café Altro Paradiso and Via Corota for Italian restaurants.",
        "Adam is looking for a band name. He wants to buy a CD for Samantha.",
        "Howard's sister Claire got a job at a cafe that employs only people with special needs.",
        "Dianne is upset with Andy because he told her that he is making a lot of money. She is also upset because he paid for her lunch. Barrett thinks that Andy is always like this and Dianne should just let it go.",
        "Paul, Joe and Rob are going to an escape room on Friday. The theme of the escape room is narcos.",
        "Meryl is going to the gala. Clint is not going. Roberta is working there.",
        "Miles had a dream where he was stuck in the 80's and couldn't figure out how to get back to 2018.",
        "Edward gave his mom $1,000 for her birthday. She gave it to her new boyfriend who lost it all gambling in Las Vegas.",
        "Jose passed his driving test. He's looking for a nice car now.",
        "Lenny and Rick are excited to see the trailer for Venom. Thomas thinks it's going to be rubbish.",
        "Luke, Chloe and Jack will go to the party in Jack's car.",
        "Violet found an article about Austin and thought Claire might be interested in it.",
        "Joseph is sorry about what happened to Carlos' mates. Carlos says that it is not the first time this kind of things happen in Argentina. People can get really violent when it comes to football.",
        "Gemma forgot her keys and Suze invited her to come to her office.",
        "Kela sent Cher a birthday message and some photos.",
        "Pete is coming home. He's been in a line at the store. Nicole is making dinner.",
        "Jacqui has a new idea for a website. It's a self-learning institute. The Institute of Self-Tuition. If anyone wanted to learn a topic, they would go to that section of the site and the site would give an introduction to the areas of learning within that topic and what to look out for.",
        "Stephanie and Victor are going to see the movie Captain Marvel together.",
        "Jill and Jack are discussing the meeting Jack had today. Jack will know tomorrow if his idea was accepted. Jill and Jack are also talking about their upstairs neighbors who are having sex again.",
        "Charles thinks that long distance relationships don't work. Jim agrees.",
        "Michael and Jane have seen the last episode of Supernatural. They both liked it.",
        "Sharol will pick up Mary from university. Mary's car has been hit and she can't start it.",
        "Caroline and Blake are in Basel for the art fair. Hans and Reinhard are on their yacht in Monaco. Caroline can't join them because she has to be in Basel tomorrow. Hans and Reinhard will be in Monaco for a few days. The weather is perfect. Caroline and Blake want to buy some more art",
        "Carol's computer stopped working. She needs help. Michelle told her about Bill who can fix any computer. Bill's number is 717-222-4877.",
        "Diana's mother passed away one year ago. Danielle's mother was a communist and a fighter in the resistance movement. She was lucky to survive. She met Danielle's father in 1943. He was also a communist. He was killed one year after Danielle was born. Danielle's",
        "Adalyn and Nora are going to attend self-defence classes for women.",
        "Mat is waiting for Chris to finish his work. Chris is not answering. Mat will try to contact him. Mat is working on his presentation.",
        "Cass is ordering pizza for dinner. Drew and Cassie are having a date. Braden and Mickey are in.",
        "Wendy and Diana are planning a surprise party for Pam's birthday.",
        "Peter is home already. Liz will be home before 6. They will watch Netflix and drink wine.",
        "Scott is back in Uganda. Sasha is going to a party with her mates from the uni.",
        "Kyle has finished reading the new D&D expansion. He will DM the game.",
        "Boyle moved out. He's tired of living with his mom. He moved to the other side of the city with his buddy from work.",
        "Cora, Lydia and Kaylee are going to a spa.",
        "Sasha asks Dean to print her essay on modernism for her. Dean agrees to do it.",
        "Ralph has found a company called \"Venque\". Charles thinks that the company has very beautiful but expensive products. Ralph is interested in a bag from this company.",
        "Gera and Hope will meet at 2. Hope will be in her office.",
        "Fiona and Tom are going to meet after work. Tom might be late because of a meeting.",
        "Caron found the Beautiful South on her Tidal app.",
        "Susanne, Lilly and Rachel are going to a concert. Susanne and Lilly are going to meet Rachel there.",
        "Dora can't come to the party because her mom is ill."
    ],
    "oos_scores_before": 0.2540499441403945,
    "oos_scores_after": 0.24443739584141397,
    "oos_outputs_before": [
        "Claire is cooking a curry. Linda is also cooking a curry.",
        "Alyssa and Derek are talking about Fergie's national anthem. Derek saw it last week.",
        "Ann wants to buy a laptop from Josh. The laptop is available for 250 dollars. Ann will pick it up.",
        "Matt, Phil and Tony are going to see Bon Jovi in Warsaw next July.",
        "Anastasia and Darrell are talking about Anastasia's new school photos. Anastasia is not happy with her new school photos. She took the photo in less than a minute. School photos always suck. Anastasia needed a new one for her school ID.",
        "Mike wants to apply for the research trip. Jake, Florence, Margot and others are going. Jake reminds Mike that it can be harsh in Swazi now. Mike is surprised that Jake doesn't know that the country's name has changed to Eswatini.",
        "Nathalie, Pauline, Jacob and Anthony are planning a holiday. They are thinking about Greece. Nathalie's sister is getting married on August 10th. They need to be back by that date.",
        "Kim is looking for fresh ramal fish in Warsaw. She has already tried Polna street market. Margot suggests Kim to check restaurants' menus and ask about their source. Kim is going to grill the fish for a surprise.",
        "Malik and Samantha are going to try the paleo diet together. They will also go for runs together.",
        "Suzy asked Linda to follow her on Instagram.",
        "Angelina and Jones are going to meet in the afternoon in town.",
        "Erin has baked something and Zachary is busy cleaning the flat.",
        "Piper is waiting for the payment from Bryan. Bryan's manager will send it tonight.",
        "Ulysses and Peter got an A. Julia got a B. Martha can check her grades online on the course page.",
        "Cora and Ellie are talking about the meet and greet with James Charles in Birmingham. About 8000 fans showed up for it, causing a gridlock around the mall. British media made a fuss about it.",
        "Adam's friend saw Tim with a guy. Julia knew Tim was gay. Adam defended Tim. Julia didn't think it was her business to tell Adam. Nate thinks it's not fair that Tim didn't tell them.",
        "Lily needs to rent a popcorn machine for her office Christmas party. She will screen Love Actually. Daniel will check if he knows someone who rents them.",
        "Phil is still in the shop. He couldn't find any parking place and now he's standing in a gigantic queue. Nancy will make an apple pie for Phil.",
        "Timmy had a bad day at work. Gemma is organizing a BBQ at the weekend.",
        "Shaldona and her partner are getting married. They sent a wedding invitation to Piper through Messenger. Piper is upset because Shaldona didn't have time to meet her in person to give her the invitation.",
        "Perry, Marlow, Janet and Forster are going to meet tomorrow evening to discuss their holiday plans.",
        "Joyce wants to take the car to pick up Harry. Kyle is running late and has to go to a mechanic because the car is making a weird noise. Joyce is annoyed because she has to go by bus. Kyle will get Harry.",
        "Tim is running late. Gary will go in and make small talk to delay the main presentation.",
        "Ella heard that Molly met up with Chuck on Friday. Molly says that she didn't meet up with Chuck.",
        "Taylor is having a party tomorrow at 8 PM at her house. Her parents are away. Harry is going to attend the party.",
        "Christie and Katie had a great party.",
        "Chandler needs money to pay the delivery guy standing outside his door. Phoebe is on her way to help him.",
        "Carlton, Ana and Katy are going to see a film by Lola Arias. Carlton is going to join them. They will meet at Ana's place for an early dinner/drinks and then they will grab an uber.",
        "Ollie, Kelly, Mickey and Jessica are talking about scary places. Ollie starts with Nagoro village in Japan. Kelly goes next with a sculpture garden in Finland. Mickey is last with a place in Japan. Jessica is scared of the sculptures in Finland. Ollie is scared of Nagoro village in Japan.",
        "Ariana is going shopping in Midtown. Aviana wishes she could go with her.",
        "Johnatan, Darren and Lucas are going to have a beer in the evening.",
        "Lisa wants Bob to clean the bathroom.",
        "Noah and Sophie are discussing the quince. William has already collected them for Sophie. Sophie and her family will come to collect them tomorrow. Sophie and her family are coming home this weekend for Alexa's ceremony.",
        "Chloe is on TV. She is participating in a programme in which women undergo a complete metamorphosis.",
        "Shari and Stewart are discussing the current political situation. Stewart is upset with the current president's comments about the forestry department. Shari is also upset with the president's comments and his legal problems. Stewart and Shari are planning to vote for anyone else but the current president. They are also planning to volunteer to get out the voters",
        "Harvey is waiting for an update from Michelle.",
        "Martin won two cinema tickets. He will go to see the new film with Redford.",
        "Catherine and Ben are going to visit uncle Steve. Ben doesn't want to go because he doesn't like such visits. Catherine wants Ben to come because the boys miss him.",
        "Abby talked to Miro yesterday at the party. Miro's father came from Albania to the US in the early 1990s.",
        "Marty has sprained his ankle and can't pick up Marcel from school. Christine will pick up Marcel from school and take Marty to the doctor.",
        "Molly has a free ticket to the Muse concert in Cracow. Anna wants to go with her.",
        "Paul will be home later than he thought. He will call Lena in 15 minutes and then he will tell her what happened.",
        "Jane is going to Value Village with her sister to get Halloween costumes. If anyone wants to join, they can. Connor already got his costume today.",
        "Adam will take the dog for a walk.",
        "Joanne is going back home to France for the holidays. Her parents separated a few months ago. Joanne's mum is very depressed. Evelyn invites Joanne to spend Christmas with her.",
        "Rita and Tina are tired and bored at work.",
        "Adam has a gossip about Iga and her boyfriend. They planned a weekend getaway but had to cancel because her boyfriend couldn't change the date of his presentation. Iga is pissed.",
        "Chris and Rick are going to skype tomorrow at 3 pm Rick's time.",
        "Joyce found a cheap flight.",
        "Andy has tested the mould in Betty's spare bedroom and dining room. He thinks it's caused by condensation. The mould is on the walls because they are the coldest areas in the room. The mould is only in those rooms because they have external walls. The mould isn't in the kitchen",
        "Peter didn't get into Stanford. Matt and Oliver did. Peter will send his documents asap.",
        "Phil wants to go out today. Phoebe can't because her mum is still angry. Phoebe used her mum's perfume and broke it. The whole house stinks now.",
        "Stanley and Bill are working on the Lidem project. Stanley is finishing the analysis for the previous project. Bill is researching the funding. Alison is out of touch. Stanley is going to talk to Del.",
        "Dominique asks Denise what's for the test tomorrow. Denise answers that it's units 2 and 3.",
        "Luke and Martial are going to Carrington tomorrow morning to meet Jose. They will tell him that they are ready to play despite their injuries.",
        "Natalie is looking for her wallet. Jenny is not at home. Tobias has found Natalie's wallet.",
        "Ivan and Eric are talking about the wedding. Eric is coming to the wedding.",
        "Danna is angry because she called her friends and they are not around or are busy. Reed is in bed.",
        "Ricky, Shelly and Tom are discussing the weather outside. Ricky is reminding Tom about a time when he was hiking in the mountains. Tom was a student and he went with a group of friends. They rented a cabin in the wild.",
        "Amelia is asking Emily about her favourite colour.",
        "Claire is asking Aaron about the conference about relations at school. Aaron tells her that it's in the teaching training thing in Sesame Street. Claire is going to attend Jo's workshop on teamwork.",
        "Rachel and Janice are discussing the Top 50 Best Films of 2018.",
        "Matthew has a cold. Lisa advises him to drink orange juice and make some soup. Matthew will try. Lisa believes in him. Matthew will take a rest.",
        "Joanne wants to talk to Bradley. Bradley is busy at work.",
        "Edward, Lauren and Kate are going on a business trip tomorrow. The boss is coming with them. They are going to an expo. They have to pretend to be nice to people coming to their booth.",
        "Jesse has an idea to do something for the less fortunate this year. He suggests to choose one of the wish lists of the Refuge and chip in. Jesse is in for the third list. Lee and Melvin agree to help.",
        "Emma wants to take a stroll with Abigail and her children. Abigail doesn't think it's a good idea because the smog alert app shows that the norms have been exceeded by 30%.",
        "Miranda wants to cancel tomorrow's meeting with Stephanie.",
        "James and Mia are going to the art exhibition of their lecturer in philosophy, Professor Evans, tomorrow. They will also go to the cinema with Amelia.",
        "Mary is broke and needs a few bucks. Carter will lend her some money. He is at the train station. He will give her the money in an hour.",
        "James, Mary and Patricia are going to Japan. Patricia is scared of earthquakes and tsunamis. James and Mary are trying to calm her down.",
        "Steffen twisted his ankle yesterday and can't walk properly. He can't go to the infinity pool.",
        "Rob is at the grocery store and Ann is at a meeting. Ann wants Rob to buy some food. Rob will buy cucumber, tomatoes, bananas, apples and whatever Rob likes.",
        "Emily is asking where the next ASEEES conference will take place. James says it will be in San Francisco. Chloe hopes for Hawaii, but James says it won't happen too soon.",
        "Helen forgot her laptop at home and needs Debbie to bring it to her.",
        "Janice's son wants a hamster for his birthday. Martina advises against it.",
        "Casey has done her nails herself. She used a new nail polish. It took her nearly 4 hours. Amelia and Kristen want Casey to do their nails too.",
        "Louis and Sara saw a huge crowd outside the book shop today. Louis' friend told him that the writer Cole Grant was there signing copies of his books.",
        "Jack took Josh's notebook home by mistake. He will bring it back tomorrow.",
        "Jason and Dory are making a video. Dory's friend is coming over the day after tomorrow and will stay for a week. Jason and Lucy have a script and an app to make the video.",
        "Mia, Jennifer, Karine and Peter are discussing about the wall. Karine thinks that Trump is not senile and stupid as they would like to believe, but he is pure evil. He is destroying the Earth and trying to shake the world's order. Jennifer thinks that Trump is quite stupid and his persistence and ignorance are dangerous.",
        "Ray is locked in his room. Max is out. Ray has to pee.",
        "Kathy and Olivia are going to get their hair cut today. Kathy's aunt is getting her hair cut too.",
        "Jair is still busy.",
        "Mico and Jeff are going to the village party. Mico will drive.",
        "Derek and Phil had a long day. Derek closed some deals but also had a lot of stress. Phil couldn't close any deal. Some customers are just fishing for offers.",
        "Joanna's thesis mentor, Lewandowska, is hospitalized because she has measles. Anyone who had contact with her within the last couple of days must get vaccinated. Joanna will try to get vaccinated before work on 18th.",
        "Alexa asked Ethan to insult Hunter.",
        "Gill needs a new peeling. Bunny suggests making her own peeling.",
        "Desiree asked Lucian if he and his wife were at home. Lucian replied that he was not at home. Desiree asked Lucian to keep her pasta in the microwave.",
        "Eric and Samantha are talking about a recent scandal on the news. Noah is also there.",
        "Tobi, Nicholas, Serena and Ella have been to the new club in Cork. They all think it's a waste of time and a huge disappointment. They went there with Ella last weekend because of the cool ad campaign. The club was empty and nobody was there. Tobi, Nicholas, Serena and Ella won",
        "Charlie's sister has just passed her last exam on her Uni. Charlie and his friends want to go out tonight. Frank will join them.",
        "Emma is on the bus. She will arrive in New York around 4.30 PM. She wants to wake up around 4.15 PM.",
        "Kris, Ovi, Jason and Nadine are all cold. Nadine is working at her clinic and they are getting lots of sick patients.",
        "Adam is going to visit his parents. His flight was rescheduled and will arrive one hour later.",
        "A guy got beaten and mugged on campus. He's in the hospital, but he'll be fine. The assailant had a mask on.",
        "Karen passed her driving test.",
        "Ginger is coming to Phyllis's house to bake a pie.",
        "Maria is tired of her job and wants to quit. Anastasia and Felix are trying to calm her down.",
        "Daniel, Mary and Lucas are discussing Dragon Age. Daniel has just started playing Dragon Age: Inquisition. Mary and Lucas have played it before. Mary loves it and recommends it to Daniel.",
        "Lenny is going to buy a pair of trousers. He is asking Bob for advice. Bob is suggesting Lenny to pick the best quality.",
        "Ross wants to do karaoke tonight. Chandler agrees, but only this once. Ross will do George Michael.",
        "Michelle loves Kelly and Jared likes her too. Jared wants to ask Kelly out. Michelle doesn't mind.",
        "Fiona needs to go to a doctor tomorrow at 8 a.m. She asked Anna to go with her. Anna agreed.",
        "Hollie asked Amy how she was. Amy said she was working now and would get back to Hollie later.",
        "Ying posted a photo of her 10 years challenge.",
        "Kelly is going to wear a red dress. Mary will wear a red dress and bright red lipstick.",
        "Laura and Linda will go to an Italian restaurant tomorrow.",
        "Caroline thinks that her boyfriend's mother doesn't like her. She is his first girlfriend and he lives with his mother and grandmother. He is 26 years old and an introvert. He is writing something and will text Kate later.",
        "Mary is doing an online job. Mark told his sister about it. Mary doesn't care about what her sister says. Mark is sorry for what his sister did.",
        "Rob and Eve are going to meet up on Sunday morning.",
        "Kirsten and Larry are discussing the post about the insurance. Larry is going to take a look at the email and get back to Kirsten. Kirsten is going to get her husband to sign off on it since they are referencing him. Larry is going to post it. Kirsten is going to stay busy and she is",
        "Owen and Neil think there's something wrong with Amy. Penny wants to meet her in person.",
        "Sam is upstairs. Kate is downstairs. Jeff is in the little room next to the reception. Kate saw a woman making a cake with a huge penis on it. Sam must see it.",
        "Kelly picked the first question. Jessica's answer is Palermo in Italy. The Capuchin Catacombs are there with 8000 corpses. They are divided somehow, but Jessica doesn't know how. Most of them were exhibited in their clothes. Only skulls and hands are visible.",
        "Mr. Williams and Ms. Blair are going for a coffee at 2 p.m.",
        "Pat will come in the evening, around 9pm. Bart will open the door for him.",
        "Hannah wants Betty's number. Amanda can't find it. Amanda suggests Hannah to ask Larry. Hannah doesn't know him well. Amanda insists Hannah to text Larry. Hannah agrees.",
        "Julia's parents are having a fight over where to eat. Julia doesn't want to eat with them anymore. Ronald will call her when she gets back. Ronald has something to tell her.",
        "Steve's dishwasher has been installed. It's a 12 place setting one.",
        "Bella and Aria are talking about Valentine's Day. Bella is in Warsaw and Aria is in Seoul. Bella is going to order pizza home. Aria is going to leave work at 6. Bella is going to Korea to get a regular checkup.",
        "Mario wants Conor to bring him a bucket of fries from KFC.",
        "Alivia is having trouble writing her thesis.",
        "Patricia has found a fair-trade brand.",
        "Rob wants to start the Get off the couch challenge. He will start with 30 minutes of activity every day. Greg is already doing at least 60 minutes a day. Will thinks Rob should be realistic. Anna is in.",
        "Sharon's mum is angry with her. Sharon is grounded. She lives with her parents. Ahmed wants her to move in with him. Sharon is a student and has to go to work. She cares about her parents.",
        "Pegah will be back at 22:00. Miriam invited some people over and was hoping Pegah would be there too.",
        "Karine and Jessie are watching a video of them at kindergarten.",
        "Bennett is in town and he wants to meet Cynthia. They will meet at a new bistro that Cynthia discovered.",
        "Jess had a dream about being a lion tamer. She asked her friends if it means she should go to Africa this summer. Lynn thinks Jess might meet a handsome zookeeper. Charlie thinks Jess might get attacked by a stray cat. Jess doesn't believe in dreams.",
        "Rachel and Wai are going to the museum at 4. They will meet at the main entrance. After that, they will see if anyone wants to go to a bar.",
        "Grace has noticed that the hand sanitizer by the restrooms is empty. Mike will refill it.",
        "James and Hannah are going to meet on Saturday at 8.",
        "Callan's Samsung S8 has a black screen. He thinks it overheats. He's going to the store to let them see it. It's still under warranty.",
        "Molly and Margaret are hesitating whether to go to Sweden for a week in January. They bought cheap tickets half a year ago. Peter and Kai think it will be dark and cold. Kai suggests visiting museums and bars in Stockholm. Margaret thinks it's not a good time for nature. Peter recommends visiting the Vasa Museum",
        "Bart didn't study for his economy final and ended up with a bad score. He plans on re-taking the class next year. Adrian didn't do that bad this semester.",
        "Jack needs Kev's help. He can't get the application running. Kev will be with him right now.",
        "Gina needs a USB from Monica. Monica has a free USB. Gina will go to Monica's office.",
        "Whitney is asking William what they will have for dinner. William is making spaghetti alla vongole.",
        "Rael is fed up with her job. She doesn't have time to eat her lunch. She talked to her manager, but he doesn't understand that they are humans, not robots. She wants to quit, but she needs to find a new job first. Zach suggests her to try IT. He will talk to his friends who",
        "Charlee is in class. She is studying Portuguese theatre at the university. She is preparing a performance. The performance is a Polish one translated into Portuguese. The writer is Mrożek.",
        "Bobby is annoyed by pharmaceutical companies inventing illnesses. He found out that a certain illness mentioned in a commercial doesn't exist. He thinks that pharmaceutical companies are selling mints as medical products. The pharmaceutical industry is worth at least $1.2 billion.",
        "Luke asked Gina to send him the picture of the parrot she painted yesterday. Gina sent him a photo. If he wants better quality, she can send him a PDF file. Luke thinks the parrot looks fantastic. Gina sent him a PDF file.",
        "Sam is looking for a black dress for his wife. He wants it to be elegant and different from what she has seen before. Sarah from the fashion store is helping him to choose the dress. She sends him some pictures of dresses and he chooses one.",
        "Holt is looking for a birthday gift for his sister. She is 21 years old. Olive suggests cosmetics. Zula suggests DVDs or book series. Holt will get her a set of DVDs and some cosmetics.",
        "Maria and Spencer are catching up. Maria is working at a call centre and wants to go part time next year to do some freelancing. Spencer is working at a cafe and doing illustrations. He earns around £1000 a month from his illustrations.",
        "Jay and Joe are going to the concert in Kenya. Jay will lend Joe some money for the tickets. Jay has convinced Ruth and Paulette to accompany them. Joe will pay Jay back next time.",
        "Tom is asking who is around. Jack is telling him that his dick is around. Tom is telling Jack to go fuck himself. Robert is not in town.",
        "Nova and Dominic are discussing Timothée Chalamet's photoshopped portraits in artworks.",
        "Tanya asked Rosie if she was better today. Rosie said she was better but not good. Tanya was relieved.",
        "Kyle wants to call Lily and Mary in 10 minutes.",
        "Serena and Jeff are talking about Jeff's skin condition. Jeff says that he doesn't have to take meds all the time. Serena will tell Tina about it.",
        "Aubrianna's friend's dad died because of malaria in Kongo. Darien says it's dangerous for all people not just whites.",
        "Will is standing in a long line at the post office. He hates queues. Chris thinks that lines are a part of everyday life in a big city. Will is annoyed by the fact that the line consists almost entirely of elderly people who don't have bank accounts and pay their bills via post office paying cash.",
        "Iris' husband Pete has got an interview. Iris' parents are glad that she found a decent man. Pete will be home in an hour.",
        "Jen is fed up with her boyfriend. He's being a pain again and she's going to tell him to move out. Jane thinks Jen should get rid of him. Jen is afraid of asking him to leave because it will only cause another fight. Jane thinks Jen should cut her losses and move on.",
        "Ema is coming to the movie in 5 minutes.",
        "James is going to drive Richard to the airport. Richard should be ready at 6:15.",
        "Sally told her friends that Natalie is pregnant and the father is Dave.",
        "Biwott told Chloe about a series. Chloe hasn't watched it yet, but she will watch it during the weekend.",
        "Marek sent Adam a picture of a guy's ass. Adam thinks it's creepy.",
        "Mell and Gloria are planning a barbecue at Mell's place on Saturday.",
        "Carol has a lot of fruit from her garden. Jacob will come to pick it up on Wednesday at 6pm.",
        "Nate has received an Excel file with all the registrations. The registrations are transformed into text in Excel. Nate has to create a new file and feed the data into the tables himself.",
        "Mike will call Dale back in 2 hours.",
        "Eva is going to a party. Linta is with Olivia.",
        "Paul wants to know what color flowers Cindy wants. Cindy doesn't want yellow flowers. Paul asks if Cindy wants pink flowers. Cindy doesn't want pink flowers. Paul asks Cindy what color flowers she wants. Cindy wants red roses.",
        "Cathy left her sunglasses at Broke's place. She will come to pick them up at 10 tonight.",
        "Allison has got a scholarship.",
        "Martha wants to buy lenses similar to Ophelia's. Ophelia recommends Crazy Lenses.",
        "Alex and Benjamin are talking about the basketball game. Benjamin couldn't attend because he was taking care of his sick mom. Alex's team won 101-98.",
        "Paul is on holidays with his girlfriend. He will send Luke the login and password on Sunday. Luke will wire him the money every month.",
        "Olafur, Nathalie and Zoe are going to a party in Soho for New Year's Eve.",
        "Max and Payton are talking about shopping. Payton likes to browse and try on clothes, but doesn't always buy them. Max and Payton both like reading.",
        "Val and Candy are going to meet. It's raining. They will wait for half an hour and then decide whether to go or not.",
        "Tiffany wants Railey to buy her a burger on her way home.",
        "Andy is going to visit Paul in about an hour.",
        "Tim is thinking about inviting a few people from work over and he wants to consult Joe about it. Joe is always happy to share his expertise with anyone willing to listen. Tim knows that Joe ran the local club. Joe gives Tim some tips on how to organize a newbie gaming evening. Joe suggests starting games before you start drinking and not bringing",
        "Shelly is volunteering at the food shelter this year. Tracy and Jody are not volunteering.",
        "Harry is going to Ikea. Sarah needs a white table cloth 120 cm x 140 cm, two medium size wardrobe organisers (the ones with grey flowers), one wooden spatula and three bottle cleaners. If Harry goes to the food section, Sarah would like a Daim's frozen cake and",
        "John is considering trading for Lamar Jackson.",
        "Finn wants to track his shipment.",
        "Patricia will call George in an hour.",
        "Rory and Mitch are friends. Rory and Mitch are going to sign up Bill and Sammy for an international camp. Mitch will take Bill and Sammy to the camp. Mitch will leave on Sunday, the 29th. Bill will arrive around 10 am on Sunday. Joanna will pick him up.",
        "Jenny, Jeremy and Joan are going to a concert on Saturday. They will start with a drink at 8th av.",
        "Ken has hacked Greg's account and has taken all his money.",
        "John and Joan are going to see \"A Star is Born\" on Thursday at 8pm.",
        "Parker and Jason are discussing the Arrowverse and the DC Universe. Parker has downloaded the latest episode of Arrow Season 7.",
        "Anna will call Peter in 20 minutes.",
        "Harry wants Cindy to call Ela and tell her that he needs to talk to her urgently. Cindy is annoyed because she has to do this all the time.",
        "Melissa is saying that men should be allowed to be masculine.",
        "Catherine applied for an accounting position at Pandora. Jake is still working there. The company offers possibilities of personal development and promotion. The salary increases with each promotion. The company partially finances language and accounting courses. There's also a yearly bonus that depends on your achievements and private healthcare. Catherine will have an interview on Monday. She",
        "Pete is going to buy yogurt for Jen. She wants pear flavour, but if they don't have it, he should not buy anything.",
        "Lincoln broke Hudson's toilet seat. Hudson will try to replace the broken hinge.",
        "Paul will couch the game on Saturday.",
        "Maria is preparing for a conference.",
        "Peggy's computer might be too old to repair. Melody recommends her to buy a new one.",
        "Marleen is going to town in half an hour. She is considering buying a silk kerchief for Rita. Barry is at home.",
        "Sarah will arrive in New York on Thursday. Joshua will be waiting for her gift.",
        "Salma shared a cat meme. Hugh shared a photo of a cat.",
        "Debbie is asking for help in choosing a dress. Denise and Kelly are helping her. Kelly is going to buy the red dress for herself. The link to the store is <file_other>.",
        "Derek McCarthy needs an Android cable. Tommy's wife, Paulina, will give him one. She will be at home at 8:15 pm.",
        "Ed, Valerie, Chris, Lor, Atnee, Jessica and Matt are discussing about sex. Ed says that sex is for married people. Valerie says that it's a double sin if it's anything but missionary style. Chris says that they should get married and leave them alone. Lor says that they should hope that all",
        "Mick didn't get the confirmation email from AES yet. Barbara did. Mick has to call AES.",
        "Rita needs some information about Salvage Industries. Helen thinks they are legit. Rita wants Helen to double check if they have no PR problems.",
        "Carl and Duncan are discussing the upcoming championship. Carl is participating in it with his Evo 10. Duncan and Carl are cousins. Carl is hoping that his Evo 10 will not let him down this year. Duncan and Carl are planning to attend the championship. Carl will have Duncan and his friends reserved in the VIP",
        "Euodia doesn't know what TikTok is. Domigo explains that it's a new application where you can take videos, edit them with music and special effects, and share them with your friends or on YouTube.",
        "Jane is asking Ainsley if she can help her with her thesis. Ainsley is sick and can't help her.",
        "Georgia is considering buying a new dress.",
        "Sam wants to buy earphones. They are available in the store. Sam wants to have them delivered to him. The delivery costs £4. The earphones are new and white. Sam wants to buy them. The total cost is £187. Sam wants to lower the price to £180. The company policy does not allow",
        "Mike, Tom and Ben are going for a beer.",
        "Ann is going to host her son Tim at Katie's place. Katie will pick him up from the railway station. Ann and Katie have known each other for a long time.",
        "Aimee is looking for Maryam. She tried calling her and went to her home. Soren thinks Maryam might have gone somewhere with her father.",
        "Beth wants to try working in the salon. Deirdre agrees to let her work there for a couple of weeks as work experience.",
        "Conny is going to the library to do research for the paper he has to write.",
        "Hannah and Brooklyn are discussing their New Year's resolutions. Hannah wants to lose weight, learn how to cook and start using dating apps. Brooklyn doesn't believe in New Year's resolutions.",
        "Kelly and Betty went to the pub. Kelly met a guy from school. Betty is jealous.",
        "Randal is in the store to buy Sidney a nail polish. He is having trouble finding the right one.",
        "Max's sister is studying in Shanghai, China. She believes it's a good investment.",
        "Greg is coming for a business trip and will stay at Nina's place for two nights.",
        "Luke has booked another flight with easyjet. Erin's flights have been cancelled.",
        "Stan Lee is dead.",
        "Samara and JP are playing. JP has to go to work.",
        "Emma and Daniel are going to Amiens tomorrow. They will meet at Emma's place at 9 am. Daniel has to get up before 7 am.",
        "Sean overslept again.",
        "Steve will call Sue.",
        "Don and Hank are discussing the CSS tests for their kids. The tests are today from 5-8 pm. Don will take the kids next time.",
        "Claire is considering ordering a dress for her wedding.",
        "Miley doesn't want to go to work tomorrow. She wants to sleep and needs some rest. Aaron knows what she feels. He also wants a holiday.",
        "Sarah's PTO request for this week has been denied due to the number of requests. She will be given first choice of dates the week after.",
        "Dan cooked a BBQ for his friends. He will split the cost of the BBQ equally among all his friends. Sara, who wasn't there, will remove herself from the transaction. Eric and Gerardo cooked their own chicken and asparagus.",
        "Eric and Dan have watched Punisher season 2. Eric thinks the first season was better but the second one did some things better. Eric thinks they should have given Jigsaw more scars. They are disappointed that Netflix discontinued Daredevil.",
        "Tony posted a photo of a cat. Amy and Lucas liked it.",
        "Robyn drank too much beer last night.",
        "Laura is waiting for Paul. Paul is almost there. Laura is not waiting any more.",
        "Diana and Frann are going to a hip-hop workshop.",
        "Brenda and Sandra are going to meet up next Saturday for lunch and a trip down memory lane.",
        "Casper, Alexander and Igor are not going to Mr Linda's classes tomorrow. They are going to meet near the university and work something out.",
        "Abigail and Damien are going to church on Sunday.",
        "Rachel and Caron are going to meet at the Red Lion at 8.",
        "Emily is waiting to see her doctor. She is waiting with a nun and a blind crazy man. It feels spooky.",
        "Christine is not going to school tomorrow because she is not well. She has a cold. Annie will drop some Theraflu sachets through Christine's letterbox later on.",
        "Jeremih is mad at his sister. Hansel will tell her to text back.",
        "Ost bought a garage place in the garage. He wants to rent it out and do the restitution of his money. The prices for finding garage places are favorable in this area. The interest rates are very small, almost close to zero. Prices of garage places in Belgrade will only grow. The number of vehicles per family is growing",
        "Barry, Jake, Dave and Kelly are going to march in Women's strike. They will meet around the campus at noon.",
        "Anna and Jerry are discussing the fact that the more they learn about history, the more they realize how miserable the world is. They both find dark humor to be the only thing that makes them feel better.",
        "Zack and Dwayne are talking about the new Jersey Shore season.",
        "Joseph sent a photo of baby cows.",
        "Linda, Ronnie, Karen and Amanda are going to have lunch together. They will have pasta from a place near their apartment and they will take it to the park.",
        "Geri and Hilary are going to the mall tomorrow after work to buy some new heels. They will also have some frozen yogurt.",
        "Bailey and Mikaela are talking about the fabric they have. Bailey has a lot of fabric in her closet and she keeps buying new stuff. Mikaela has a box at Ikea.",
        "Clara and Ron were at Kasia's place last night. There was a weird smell. Ron didn't want to say anything about it. Clara thinks it was Kasia's 21 cats. Ron thinks it was Kasia's sleazy boyfriend. They will never know.",
        "Sebastian and Kevin are talking about Sebastian's life. Sebastian is happy with his life and he is satisfied with his decisions. Sebastian has someone he loves by his side. Kevin wishes he had someone by his side. Sebastian thinks that Kevin will have someone by his side soon.",
        "Robert is looking for a new job.",
        "Inez, Alicja, Gosia and Patrycja are planning another Food Evening. They are going to try Korean food. They will meet on Wednesday.",
        "Simon and Freddy are going to perform at the school concert. Freddy will sing and Simon will play the guitar. Freddy will send Simon three backing tracks.",
        "Adele will come to Anne's place for Easter.",
        "Marsha, Cynthia, Gavin and Mohammad have planned a trip to Nosy Be with John. They will spend a week in a little hotel.",
        "Charles is worried about his health. He feels bloated and gains weight even though he doesn't eat much. He thinks he may be allergic or intolerant to gluten. Karen suggests that Charles should quit eating gluten for a month and see if he feels better. Monica did the same thing with lactose and she",
        "Peter and Jack are talking about an emergency at school. It was a drill.",
        "Carla and Raul are talking. Raul is not feeling well. He had a bad night and a bad morning. He started off with a cigarette. He doesn't know what triggered him off. Jen stayed at her friend's place last night. Raul was pissed off all the time. He had weird dreams of his",
        "Sawyer, Sutter and Wheeler are going to play a ball game tonight. Wheeler is injured and can't play. Yardley is going to play next time.",
        "Alicja has a job interview tomorrow.",
        "George wants to meet Donna at his place tonight.",
        "Adele has a new dog, a 4-month-old Labrador Retriever named Bones.",
        "Don asked Margot and Yvonne what they bought for Nancy's birthday. Margot bought a bottle of nice wine. Yvonne didn't buy anything yet.",
        "Archie is coming to Judah's place from Southampton. He will arrive around midnight. He will be travelling by bus.",
        "Cara wants to pass by Celine's house. Celine is not at home. Celine will drop by in the evening if Cara doesn't mind.",
        "Maya wants to bring home the clothes that are hanging outside. She thinks they should be dry already. Boris is not home right now. He will tell Brian to take care of that.",
        "Sybille is trying to make her son's online registration for the flight AF3581 from Minneapolis to Paris the 29th. She has trouble with it. She has already paid for the ticket but it is not delivered. She is very angry because she has to wait 24 hours to get an answer.",
        "Damian watched Chelsea's game against Huddersfield. Higuain scored twice. Damian is happy for the team. Jacob and Mason didn't watch the game.",
        "Don and Cindy are discussing the arrangements for today's meeting and Don's trip next week.",
        "Robert is visiting his old pals. He thought he could catch Gabriel somewhere, but Gabriel is at home.",
        "Lawrence is working on an article. Madison needs it by today. Lawrence will get back to Madison once he is done.",
        "Zandra is organizing a birthday party for her daughter. She has decorations and food. Tricia is helping her with the cake. Erwin will deliver the cake by bike.",
        "Sally and Tim are going to see Imagine Dragons at the ABC Theatre on 12 July.",
        "Adam is going to take his exam in 10 minutes. He is very nervous. Dave believes in him and wishes him luck.",
        "Mark and Jeff are talking about Jeff's new car. Jeff is driving it.",
        "Pam needs Robert's help with Tom's birthday. She has to go shopping, cook and clean. She also needs to pick up the balloons. Robert will pick up the balloons for her.",
        "Ben and Steven will have pizza tonight at Marco's.",
        "Marta thinks Jay is a pathological liar.",
        "Robin is trying to read up on the poker platform called Bulls Eye. Jacks has played on it several times and made a few bucks. Jacks is sending Robin some links to good sites.",
        "Murphy is going to Poanań on Tuesday and coming back the same day in the afternoon.",
        "Tim has seen his mum today. Louise is with Autumn. Tim forgot about it. Tim doesn't need his mum for anything important.",
        "Steve wants Nick to buy him lunch.",
        "Mika is offering Linda some perennials for her garden. Linda won't be able to do any gardening before leaving.",
        "Joel, Becky and Trent are talking about Coco.",
        "Frank and Hope are in love.",
        "Michelle and Rachel are talking about Monica's pregnancy.",
        "Cindy is sad. She doesn't want to talk about it. Ellie tries to cheer her up. Cindy has seen a funny video that is viral on the internet. Ellie hasn't seen it yet.",
        "Doug and Jeni are talking about Doug's new shoes.",
        "Rashi is confused about her career. She has many interests. The teacher advises her to choose a career based on her passion. She should earn and learn.",
        "Jamilla will audition at Antena 3 at 7.30 P.M.",
        "Louis is looking for a gift for Lilly and Stephen's wedding.",
        "Ty wants to know if Veronica speaks French. Veronica doesn't.",
        "Damian is starving and wants Ethan to buy him a kebab. Ethan is annoyed because Damian doesn't cook for him.",
        "Felipe complimented Lydia's legs.",
        "Max has sent Jim his latest music project. Jim will listen to it when he gets home.",
        "Michael can't make it today. He will call Tom tomorrow.",
        "A cat invaded the pitch at Goodison.",
        "Mel is going to bring Xander to Mair's at 10:30 tomorrow.",
        "Avril and Frank are going to see horse racing.",
        "Andrew and John are playing a tank game. Andrew is on level 5 and John is on level 10. Andrew is not happy about it. Andrew and John are also talking about World of Warcraft. Andrew's cousin met his wife there. Andrew's favorite genre is RPGs. He likes the Final Fantasy series",
        "Mazie and her girls are going to have a drink tonight. Lee doesn't like Sheryl.",
        "Marvin asked Melany when was the last time she got laid.",
        "Dan asked Kevin to buy him a sandwich on his way to work.",
        "Richard and Anne will meet at Starbucks at 8th street after 3pm tomorrow to start planning their project. Holy will be back on Monday but will do some research tonight and send it back to them.",
        "Ellie is asking Aaliyah where their classes are now. Aaliyah is at the university. Camille is sick.",
        "Megan asked Nathan if he had any word from Jason. Nathan asked why she asked. Megan told him that Jason was absent today. Susy told her that Jason had a dental appointment.",
        "Drade and Marenda are discussing about Drade's brother. Drade's brother got out of the group chatting room. Marenda thinks Drade's brother is angry. Drade thinks he didn't say anything wrong. Marenda thinks Drade should apologize and send the invitation to him",
        "Olivia has to do her accounts and upload some videos to YouTube. She doesn't do much post-production. Jake also does post-production but he doesn't always have time to do much. Olivia once put on one of her own pieces and it was challenged by Sony Music.",
        "Laura's mom passed away this morning. Laura, Kristian and Anne want to spend more time with her.",
        "Harris's friend Aoki died yesterday. Harris hasn't seen her for a few months.",
        "Ryan and Sebastian are discussing the situation in Ukraine. Ryan is worried about it.",
        "Sarah and Laura are at the same hotel in Linate.",
        "Ursula got a 93 on her French exam. Vaughn got a 65.",
        "Pamela is applying for the RGS grant.",
        "Bob bought a game and wants to play it with Harry. Harry doesn't have money to spend on games.",
        "Hayden has to write his thesis in a month. He doesn't know what studies to choose. He's interested in African studies but he's not sure if he can make good money later on. He was thinking about working as a flight attendant. He can swim, he's a water rescuer, he knows English",
        "Natalie wants to go to the new club at Regents Street. She asks Judy if she can go with her. Judy is going there on Saturday with Miranda and Helen.",
        "Zoey and Thomas are chatting. Zoey is in the tropics and Thomas is in the cold. Thomas is fine and he has a walk around the summit of Belchen.",
        "Carl is waiting for Meg. Meg lost her key and needs 5 minutes more.",
        "Gaia has 6 exams this term.",
        "Madeline and Alex are going for a beer tomorrow.",
        "Jake, Nadia and Vanessa are going to have English today.",
        "Rachel's aunt was in an accident. She's bruised but she's fine. The driver who caused the accident was speeding and didn't see the red light. He's gonna pay for the rehabilitation.",
        "Nick and Jane are chatting. Jane is not interested in meeting Nick for a drink.",
        "Ashleigh got the job. She and Peter are going to the cinema.",
        "Marika is coming today.",
        "Sarah and Lia are discussing their plans for Passover. Sarah is going back home for Passover. Lia is not sure yet. Sarah bought her tickets yesterday for 500 quid. Lia is thinking about asking her family to help her out. Sarah and her family are going to the desert. Lia and her",
        "Anna is inviting everyone to her birthday party on the 6th of November at 19:30.",
        "Huda and Alex are going swimming in 2 hours.",
        "Morgan and Suzanne are chatting. Morgan is going to a concert next week.",
        "Marco found Sandra's present at his place. Sandra wants Marco to bring it over.",
        "Zariah has a pain in her back.",
        "Alan sent an email with an attachment to Ruth. She didn't have any trouble opening it.",
        "Tina and Steve are going to have pasta for dinner. They will meet in the car park after work to do some shopping.",
        "Celia and Mike are planning a holiday. Mike wants to go to Egypt, but Celia suggests Croatia instead.",
        "Ella asked her family to confirm their attendance and to inform her about their dietary requirements. Barbara filled out the form for her mom too.",
        "Freddie is asking Winnie if Nanna is coming to visit them soon. Winnie tells him that Nanna has broken her leg and she will come to visit them instead. Freddie asks Winnie to tell Mummy and Daddy to come when they can.",
        "Maxwell and Jeanice are discussing the payment for the babysitting. Maxwell is grateful for Jeanice's help. Jeanice is going to inform Maxwell about Marcus's behavior at school. Maxwell and Jeanice are going to grab a coffee some time and talk through all the issues.",
        "Hans wants Slade to come to the practice now. Slade agrees. Hans also wants Slade to bring the ball.",
        "Josh and Michelle are going to the movies tomorrow night.",
        "Jack is going to the casting. Ryan is going to come with him.",
        "Lisa and Peter are discussing about their health. Peter is a member of a gym near his office. He does weights and runs on the treadmill. Lisa is thinking of working out a bit. She also thinks she needs to eat better to help her keep in shape. Peter also thinks that sleep is another major requirement for good health.",
        "Daisy is in Naples. She is going to Rome, Florence, Venice and then to San Francisco. Charlie is going to Florence too.",
        "Margaret has a terrible headache.",
        "Trevor has got Abigail pregnant. It's her father's fault.",
        "Tomas is broke and waiting for the grant. Sierra can lend him some money if he needs it.",
        "Hannah is watching the game. James is going to work.",
        "Vinny has a red Mustang.",
        "Whitney and Hailey are going to the cinema to see Aquaman. Shadrack and his girlfriend will accompany them.",
        "Gina asked Warren if he locked the door. Warren confirmed that he did.",
        "Raymond and Charlotte are going to have pizza and pasta. Raymond is going to have a regular cheese and pepperoni pizza and Charlotte is going to have some pesto pennes. Raymond is going to have wine.",
        "Lara will pick up the cake and balloons for Tom's birthday party.",
        "Mia and Steven are going to see a movie at 9pm. They will meet at 8pm to eat Chinese food.",
        "William is making spaghetti. He needs fresh tomatoes and chocolate.",
        "Ally and Jill are working on the same project. Jill has done 20-30 tasks so far. She can't do more than 3-4 tasks per day. Ally has done the same amount of tasks.",
        "Mike wants to know John's new number. Ann doesn't know it. Mike should ask Mary.",
        "Emilia is still angry.",
        "Barbara is home already. Sean is on his way with the dog. He will stay overnight.",
        "Adelina asks Cyprien where he comes from. Cyprien answers that he was born in Jarrow, lives in London now, and was educated in Loughborough. Adelina asks if Cyprien is all right. Cyprien says that he comes from Planet Earth. Adelina says that if Cyprien",
        "Ania, Kasia and Jan will go to the church together tomorrow to praise Mary the Queen of Poland. Zuzia thinks it's inappropriate for a boy to go with them.",
        "Ola will be free by 8.",
        "John and Laurel are going to meet at Jade's collection in town at 5 pm to buy a birthday gift for Diana.",
        "Ken is having a bad day.",
        "Mario has been flying all over Europe today. He is now in Luxembourg.",
        "William is in a queue for the past 20 minutes. He will be back in 5 minutes.",
        "Susan and Jill are talking about Susan's date. Susan's date was perfect. Susan and her date went to rollerskating disco.",
        "Matt got his ticket for Dawid Podsiadlo. He will see Thomas there. Thomas will go by himself for now.",
        "Sophia sent Mason a photo of her kissing the screen. She's sorry for not being there. Mason is fine. Sophia will send him another photo later.",
        "Stan and Dave are talking about Stan's date with a girl. Stan is going to take her to Pat&Gill's.",
        "Erin is going to the restaurant to do the interview with Ashley. The wifi is better there.",
        "Aude asked Susie if she found plasters for Ted. Susie found them and Ted used them after his shower.",
        "Lindsey has just finished her class. She asked a girl to put her name on the attendance list instead of her. She did the same last week. She gave them a piece of paper with her name written on it.",
        "Brook had an accident yesterday. Gyle is coming home.",
        "Laura, Kelsey, Sid and Oona are going to see Aquaman on Thursday at 8:10 PM. Oona will get the tickets and Laura will pay her back later.",
        "Albert passed his driving exam after the 4th attempt.",
        "Vicky, Audrey, Ludovica, Greg, Michelle, and Ryan are meeting at Fratelli's. Michelle will be there in 10 minutes.",
        "Myah sent a photo of a phone number. Selah can't see the phone number very well. Myah sent a new photo of the phone number. Selah can't see the phone number very well. The phone of that person is off.",
        "Adam called Tina. Tina is still at work. She will call Adam when she gets home.",
        "Ron sent Josh an email.",
        "Cristina and Gaya will meet at Gaya's studio on Wednesday or Friday next week.",
        "Jacopo asked Ludmila if she had a favorite dinosaur when she was a child. Ludmila's favorite dinosaur was triceratops. Jacopo will tell her why later.",
        "Joana wants to play some games with Sandy. She will bring Dixit and Carcassonne.",
        "Thelma doesn't have anything to wear. Louisa will bring her a red velvet dress.",
        "Pet shop: Hi Breann&Dianne!👋 🐶😻 Here is a 10% coupon code (pawesome10) for new customers when you checkout! -> <link_other>\r\nBreann: oh thank you!!!!\r\nPet shop: Bre",
        "Jane and Ella went to La Perle. Jane is allergic to peanuts. They ordered a cheesecake. Jane asked if there were any peanuts in it. They ensured her there were no peanuts. Jane started swelling after the first bite. There were crushed nuts in the crust. Jane",
        "Jannet and Nadia are chatting. Nadia and her friends went to Jannet's place yesterday. They had a lot of fun. They will repeat it soon.",
        "Emma and Josh spent New Year's Eve with their friends. Emma and her friends went to the seaside and ended up on the beach for midnight. Emma has a cold now.",
        "Louis and Archie are talking about Melanie. Louis sends a gif of her. Archie sends a photo of her.",
        "Shanon, Victor, Oliver and Sid are discussing their teacher. He's no longer their teacher. He got fired and thrown out of school.",
        "Kim's mom is asking what kind of gift Kim should get for Harry. Harry doesn't need a gift. He just bought a new sofa and needs pillows.",
        "Jack is 10 minutes late. Laura will wait for him inside.",
        "Peadar, Annette, Helen, James and Oli are going to Jesus bar. Clare is not in town. Anne double booked herself.",
        "Tom and Camilla are going to Dublin this weekend.",
        "Linda missed the train to Amsterdam. The next one is in one hour. It was 80 euros.",
        "Kristian and Tabora are playing a game. Kristian asks Tabora about his preferences. Tabora answers that he prefers Adidas, orange, Batman, and films. Kristian asks Tabora if he wants to keep playing. Tabora agrees.",
        "Adrian and Simon are going to talk at 5."
    ],
    "oos_outputs_after": [
        "Claire is cooking a curry dish. Linda is also cooking a curry dish.",
        "Alyssa and Derek are talking about Fergie's national anthem. Derek saw it last week.",
        "Ann wants to buy a laptop from Josh. The laptop is available for 250 dollars. Ann will pick it up.",
        "Matt, Phil and Tony are going to see Bon Jovi in Warsaw next July.",
        "Anastasia and Darrell are talking about Anastasia's new school photos. Anastasia is not happy with her new school photos. Anastasia's school photos were taken in less than a minute. Anastasia needed a new school photo for her school ID.",
        "Mike wants to go for the research trip. Jake, Florence, Margot and others are going. Jake reminds Mike that it can be harsh in Swazi now. Mike is surprised that Jake doesn't know that the country's name has changed to Eswatini.",
        "Pauline and Tony are going to Greece for their holiday. Jacob and Anthony are going to Greece too. Nathalie's sister is getting married on August 10.",
        "Kim is looking for fresh ramal fish in Warsaw. She has already tried the marketplace at Polna street. Margot suggests Kim to check restaurants' menus and ask about their source. Kim is going to grill the fish as a surprise for someone.",
        "Malik and Samantha are going to try the paleo diet together. They are also going to go for runs together.",
        "Suzy asked Linda to follow her on Instagram.",
        "Angelina and Jones are going to meet in the afternoon in town.",
        "Erin baked something and Zachary is cleaning the flat.",
        "Piper is waiting for the payment from Bryan. Bryan's manager will send it tonight.",
        "Ulysses and Peter got an A. Julia got a B. Martha can check her grades online on the course page.",
        "Cora and Ellie are talking about the meet and greet with James Charles in Birmingham. About 8000 fans showed up for it, causing a gridlock around the mall. British media made a fuss about it.",
        "Adam's friend saw Tim with a guy. Julia knew Tim was gay. Adam made a fool of himself defending Tim. Julia didn't think it was her business to tell them. Nate thinks it's not fair that Tim didn't tell them.",
        "Lily needs to rent a popcorn machine for her office Christmas party. Daniel will check if he knows someone who rents them.",
        "Phil is still in the shop. He couldn't find any parking place and now he's standing in a gigantic queue. Nancy will make an apple pie for Phil.",
        "Timmy had a bad day at work. Gemma is organizing a BBQ at the weekend.",
        "Shaldona and her partner are getting married. Shaldona sent Piper a wedding invitation through Messenger. Piper is upset because Shaldona didn't have time to meet her in person to give her the invitation.",
        "Perry, Marlow, Janet and Forster are going to meet tomorrow evening at Perry's place.",
        "Joyce wants to take the car to pick up Harry. Kyle is running late and has to go to a mechanic because the car is making a weird noise. Joyce is supposed to go get Harry by bus, but she thinks it's ridiculous. Kyle will get Harry.",
        "Tim is running late. Gary will go in and make small talk to delay the main presentation.",
        "Ella heard that Molly met up with Chuck on Friday. Molly says that's not true.",
        "Taylor is having a party tomorrow at 8 PM. Harry is in.",
        "Christie and Katie had a great party.",
        "Chandler needs money to pay the delivery guy standing outside his door. Phoebe is on her way to help him.",
        "Carlton, Ana and Katy are going to see a film by Lola Arias. The film is about the making of the play Carlton saw last year. They will meet at Ana's place for an early dinner/drinks and then grab an uber.",
        "Ollie, Kelly, Mickey and Jessica are talking about scary places. Ollie suggests Nagoro village in Japan. Kelly suggests a sculpture garden in Finland. Mickey suggests a place in Japan. Jessica suggests a place in Japan. Ollie suggests Nagoro village in Japan. Kelly suggests a sculpture garden in Finland. Mic",
        "Ariana is going shopping in Midtown.",
        "Johnatan, Darren and Lucas are going to have a beer in the evening.",
        "Lisa wants Bob to clean the bathroom.",
        "Noah and Sophie are discussing the quince. William has already collected them. Sophie and her family will come to collect them. The twins will come to collect them. Sophie and her family will come to collect them.",
        "Chloe is on TV. She is participating in a programme in which women undergo a complete metamorphosis.",
        "Shari and Stewart are discussing the current political situation. They are not happy with the current president. They are looking for a good candidate to vote for.",
        "Harvey is waiting for Michelle to finish her research.",
        "Martin won two cinema tickets. He will go to the cinema with Aggie.",
        "Catherine and Ben are going to visit uncle Steve. Ben doesn't want to go. Catherine wants Ben to come with them because the boys miss him.",
        "Abby talked to Miro yesterday at the party. Miro's father came from Albania to the US in the early 1990s.",
        "Marty has sprained his ankle and can't pick up Marcel from school. Christine will pick up Marcel and take Marty to the doctor.",
        "Molly has a free ticket to the Muse concert in Cracow. She wants to go with Anna.",
        "Paul will be home later than he thought. He will call Lena in 15 minutes.",
        "Jane is going to Value Village to get Halloween costumes with her sister. Connor already got his. Jane is going with Connor.",
        "Adam will take the dog for a walk.",
        "Joanne is going back home to France for Christmas. Her parents separated a few months ago. Her mum is very depressed. Evelyn invites Joanne to spend Christmas with her.",
        "Rita and Tina are tired and bored at work.",
        "Adam has a gossip about Iga and her boyfriend. They planned a weekend getaway but had to cancel because her boyfriend couldn't change the date of his presentation. Iga is pissed.",
        "Chris and Rick are going to skype tomorrow at 3 pm Rick's time.",
        "Joyce found a cheap flight.",
        "Andy has tested the mould in Betty's spare bedroom and dining room. He thinks it's caused by condensation. The mould is on the walls because they are the coldest areas in the house. The mould is only in those rooms because they have external walls. The mould isn't in the kitchen",
        "Peter didn't get into Stanford. Matt and Oliver did. Peter has to look for other university.",
        "Phil wants to go out today. Phoebe can't because her mum is still angry. Phoebe used her mum's perfume and broke it. The whole house stinks.",
        "Stanley and Bill are working on the Lidem project. Stanley is finishing the analysis for the previous project. Bill is researching the funding. Alison is out of touch. Stanley is going to talk to Del.",
        "Dominique wants to know what's for the test tomorrow. Denise tells her that it's units 2 and 3.",
        "Luke and Martial will meet up at Carrington and go to the coach's office very early tomorrow. They will let him know that they are ready to play despite their injuries.",
        "Natalie is looking for her wallet.",
        "Ivan and Eric are talking about the wedding. Eric is coming to the wedding.",
        "Danna is angry because she called her friends and they are not around or are busy. Reed is in bed and off tomorrow.",
        "Ricky, Shelly and Tom are discussing the weather outside. Ricky is reminding Tom about a time when he went hiking in the mountains. Tom was a student and he went with a group of friends. They rented a cabin in the wild.",
        "Amelia is asking Emily about her favourite colour.",
        "Claire is asking Aaron about the conference about relations at school. Aaron tells her that it's in the teaching training thing in Sesame Street. Claire is going to attend Jo's workshop on teamwork.",
        "Rachel and Janice are discussing the Top 50 Best Films of 2018.",
        "Matthew has a cold. Lisa suggests him to drink orange juice and make some soup. Matthew will try. Lisa believes in him. Matthew is going to bed now.",
        "Joanne wants to talk to Bradley. Bradley is busy at work.",
        "Edward, Lauren and Kate are going on a business trip tomorrow. The boss is coming with them. They are going to an expo. They have to pretend to be nice. People coming to their booth actually have nothing to do with what they're doing.",
        "Jesse has an idea to do something for the less fortunate this year. He suggests to choose one of the wish lists of the Refuge, a foundation that helps women and children who escape from abuse. Jesse, Lee, and Melvin agree to chip in for the third wish list. Maxine suggests to choose the second one.",
        "Emma wants to take a stroll with Abigail and her children. Abigail doesn't think it's a good idea because the smog alert app shows that the norms have been exceeded by 30%.",
        "Miranda wants to cancel tomorrow's meeting with Stephanie.",
        "James and Mia are going to the art exhibition of their philosophy lecturer, Professor Evans, with Amelia. Afterwards, they will go to James' place and hang out, cuddle and so on.",
        "Mary is broke and needs a few bucks. Carter will lend her some money in an hour. He is at the train station.",
        "James, Mary and Patricia are going to Japan. Patricia is scared of earthquakes and tsunamis. James and Mary are trying to calm her down.",
        "Steffen twisted his ankle yesterday and can't walk properly. He can't go to the infinity pool.",
        "Rob is at the grocery store and Ann is at a meeting. Ann needs some food. Rob will buy cucumber, tomatoes, bananas, apples and whatever Rob likes.",
        "Emily is asking about the next ASEEES conference. James says it will be in San Francisco. Chloe hopes for Hawaii, but James says it won't happen too soon.",
        "Helen forgot her laptop at home and needs Debbie to bring it to her.",
        "Janice's son wants a hamster for his birthday. Martina advises her not to get one because her son's hamster stank up the whole house.",
        "Casey has done her nails herself. She used a new nail polish and it took her nearly 4 hours. Amelia and Kristen want their nails done like that too.",
        "Louis saw a huge crowd outside the book shop today. His friend told him that the writer Cole Grant was there signing copies of his books.",
        "Jack took Josh's notebook home by mistake. He will bring it back tomorrow.",
        "Jason and Dory are making a movie. Dory's friend is coming over the day after tomorrow and will stay for a week. They have 2 weekends left to finish the movie.",
        "Mia, Jennifer, Karine and Peter are discussing the wall. Karine thinks that Trump is not senile and stupid, but he is destroying the Earth and trying to shake the world's order. Jennifer thinks that Trump is quite stupid and his persistence and ignorance are dangerous. Mia thinks that they should do anything to win the next",
        "Ray is locked in his room. Max is out. Ray has to pee.",
        "Kathy and Olivia are going to get their hair cut today. Olivia is just chilling today.",
        "Jair is still busy.",
        "Mico and Jeff are going to the village party. Mico will drive.",
        "Derek had a very busy day. He closed some deals but also had a lot of stress. Phil couldn't close any deal. Some customers are just fishing and want to compare offers.",
        "Joanna's thesis mentor, Lewandowska, is hospitalized because she has measles. Anyone who had contact with her within the last couple of days must get vaccinated. Joanna is going to get vaccinated on 18th.",
        "Alexa asked Ethan to insult Hunter because she was jealous to see him with Ethan that day.",
        "Gill needs a new peeling. Bunny suggests making her own peeling.",
        "Desiree asked Lucian if he and his wife were at home. Lucian replied that he was not at home. Desiree asked Lucian to keep her pasta in the microwave.",
        "Eric and Samantha are watching a video of their favorite professor. Noah is also watching the video.",
        "Tobi, Nicholas, Serena and Ella have been to the new club in Cork. They all think it's a waste of time and a huge disappointment. They went there with Ella last weekend because of the cool ad campaign. The club was empty and nobody was there. Tobi, Nicholas, Serena and Ella won",
        "Charlie's sister has just passed her last exam on her Uni. Charlie and his friends want to celebrate. Frank will join them.",
        "Emma is on the bus. She is going to arrive in New York around 4.30 PM. She wants to wake up at 4.15 PM.",
        "Kris, Ovi, Jason and Nadine are all cold. Nadine is working at her clinic and they are getting lots of sick patients.",
        "Adam is going to fly tomorrow. He will arrive one hour later than planned. He will be back in half a year.",
        "A guy got beaten and mugged on campus. He's in the hospital, but he'll be fine. The assailant had a mask on.",
        "Karen passed her driving test.",
        "Ginger is coming to Phyllis's house to bake a pie.",
        "Maria is tired of her job and wants to quit. Anastasia and Felix are trying to calm her down.",
        "Daniel, Mary and Lucas are discussing Dragon Age. Daniel has just started playing Dragon Age: Inquisition. Mary and Lucas have played it before. Mary loves the game and is a fan of Dorian.",
        "Lenny is going to buy a pair of trousers. Bob will help him choose.",
        "Ross wants to do karaoke tonight. Chandler agrees, but only this once. Ross will do George Michael.",
        "Michelle loves Kelly. Jared likes Kelly too. Jared wants to ask Kelly out. Michelle doesn't mind.",
        "Fiona needs Anna to go with her to a doctor's appointment tomorrow at 8 a.m.",
        "Hollie asked Amy how she was. Amy said she's working now and will get back to Hollie later.",
        "Ying posted a photo of her 10 years challenge.",
        "Kelly is going to wear a red dress. Mary will wear a red dress and bright red lipstick.",
        "Laura and Linda will go to an Italian restaurant tomorrow.",
        "Caroline thinks that her boyfriend's mother doesn't like her. She is his first girlfriend and he lives with his mother and grandmother. Caroline is waiting for her boyfriend to text her.",
        "Mary is doing an online job. Mark told his sister about it. Mary doesn't care what her sister says. Mark is sorry for what his sister did.",
        "Rob and Eve are going to meet up on Sunday morning.",
        "Kirsten and Larry are discussing the insurance policy. Larry is going to take a look at the email and get back to Kirsten. Kirsten is going to get her husband to sign off on it since they are referencing him. Larry is going to post it. Kirsten is going to stay busy and learn. Larry is",
        "Owen and Neil think there's something wrong with Amy. Penny agrees.",
        "Kate and Jeff are in the little room next to the reception. Kate noticed a woman making a cake. There was a huge penis on it made of marzipan. Sam wants to see it.",
        "Kelly: Oh! Oh! Can I pick the first question?\nJessica: Sure. Go for it!\nKelly: What's the scariest place you've been to!\n\nJessica: I'll start: Palermo in Italy.\nMickey: And what's so scary about",
        "Mr. Williams asked Ms. Blair if she would like to go for a coffee. Ms. Blair agreed. They will meet at 2 p.m. near the square in a side alley.",
        "Pat will come to Bart's place in the evening, around 9pm. Bart will open the door for Pat. Pat is working on a stage project.",
        "Hannah wants Betty's number. Amanda can't find it. Amanda suggests Hannah to text Larry. Hannah is not comfortable with it. Amanda insists. Hannah agrees.",
        "Julia's parents are having a fight over where to eat. Julia doesn't want to eat with them anymore. Ronald will call her when she gets back. Ronald has something to tell her.",
        "Steve's dishwasher has been installed. It's a 12 place setting one.",
        "Bella and Aria are talking about Valentine's Day. Bella is in Warsaw and Aria is in Korea. Aria is not in a relationship and she feels a bit miserable on Valentine's Day. Bella is planning to order pizza home. Aria is hoping to leave work at 6. Bella is planning to",
        "Mario wants Conor to bring him a bucket of fries from KFC.",
        "Alivia is having trouble writing her thesis.",
        "Patricia has found a fair-trade brand.",
        "Rob wants to start the Get off the couch challenge. He will start with 30 minutes of activity every day. Greg is already doing at least 60 minutes a day. Will thinks Rob should be realistic. Anna is in.",
        "Sharon's mum is angry with her. Sharon is grounded. She lives with her parents. Ahmed wants her to move in with him. She is a student and has to go to work. Her parents are important to her.",
        "Pegah will be back at 22:00. Miriam invited a few people over and was hoping Pegah would be there too.",
        "Karine and Jessie are watching a video of them at kindergarten.",
        "Bennett is in town and he wants to meet Cynthia. They will meet at a new bistro that Cynthia discovered.",
        "Jess had a dream about being a lion tamer. She thinks it's a sign she should go to Africa this summer. Lynn thinks Jess might meet a handsome zookeeper. Charlie thinks Jess might get attacked by a stray cat. Jess doesn't believe in dreams.",
        "Rachel and Wai are going to the museum at 4. They will meet at the main entrance. After the museum, they will go to some bar.",
        "Grace has noticed that the hand sanitizer by the restrooms is empty. Mike will refill it.",
        "James and Hannah are going to meet on Saturday at 8.",
        "Callan's Samsung S8 has a black screen. He thinks it overheats. He's going to the store to let them see it.",
        "Molly and Margaret are hesitating whether to go to Sweden for a week in January. They bought cheap tickets half a year ago. Peter and Kai think it will be dark and cold. Kai recommends visiting museums and bars in Stockholm. Margaret thinks it's not a good time for nature. Peter recommends visiting the Vasa",
        "Bart didn't study for his economy final and ended up with a bad score. He plans to re-take the class next year.",
        "Jack needs Kev's help. He can't get the application running. Kev will be with him right now.",
        "Gina needs a free USB from Monica. Monica has one and will give it to Gina. Gina will go to Monica's office.",
        "Whitney is asking William what they will have for dinner. William is making spaghetti alla vongole.",
        "Rael is fed up with her job. She doesn't have time to eat her lunch. She talked to her manager, but he doesn't understand that they are humans, not robots. She wants to quit, but she needs to find a new job first. Zach suggests her to try IT. He will talk to his friends who",
        "Charlee is in class. She is studying Portuguese theatre at the university. She is preparing a performance. The performance is a Polish one translated into Portuguese. The writer is Mrożek.",
        "Bobby is annoyed by pharmaceutical companies. He thinks they invent illnesses to sell their products. Mickey doesn't think it's that serious. Bobby found out that a certain illness doesn't exist, but it's being sold as a medical product. He thinks that pharmaceutical companies are lying to people. The",
        "Luke wants to see the parrot Gina painted yesterday. Gina sends him a photo. Luke thinks the parrot looks fantastic. Gina sends him a PDF file.",
        "Sam is looking for a black dress for his wife. Sarah Fashion is going to help him.",
        "Holt is looking for a birthday present for his sister. She is 21 years old. Olive suggests cosmetics. Zula suggests DVDs or book series. Holt is considering to buy a set of DVDs and some cosmetics.",
        "Maria and Spencer are talking about their lives. Maria is working in a call centre and wants to go part time next year to do some freelancing. Spencer is working in a cafe and doing illustrations. He earns around £1000 a month from his illustrations.",
        "Jay and Joe are going to the concert in Kenya. Jay will lend Joe some money for the tickets. Jay has convinced Ruth and Paulette to accompany them.",
        "Tom is asking who is around. Jack is telling him that his dick is around. Tom is telling Jack to go fuck himself. Robert is not in town.",
        "Nova and Dominic are discussing Timothée Chalamet's photoshopped portraits in artworks.",
        "Tanya asked Rosie if she was better today. Rosie said she was better but not good. Tanya was relieved.",
        "Kyle wants to call Lily and Mary in 10 minutes.",
        "Serena and Jeff are talking about Jeff's skin condition. Jeff says it's fine right now, but the cold weather and eating the wrong foods can set it off. Serena says Tina has the same thing and takes meds on the daily. Jeff says he doesn't have to take meds all the time. Serena",
        "Aubrianna's friend's dad died because of malaria in Kongo. Darien says it's dangerous for all people not just whites.",
        "Will is standing in a long line at the post office. He hates queues. Chris thinks that lines are a part of everyday life in a big city. Will is annoyed by the fact that he has to send a traditional letter.",
        "Pete has an interview. Iris' parents are glad that Pete is a decent man.",
        "Jen is fed up with her boyfriend. He's been a dickhead again and she's going to tell him to move out. Jane thinks Jen should get rid of him. Jen is afraid of asking him to leave. Jane thinks Jen should cut her losses and move on.",
        "Ema is coming to the movie in 5 minutes.",
        "James is going to drive Richard to the airport. Richard should be ready at 6:15.",
        "Sally told her friends that Natalie is pregnant and the father is Dave.",
        "Biwott told Chloe about a series. Chloe hasn't watched it yet, but she will watch it during the weekend.",
        "Marek sent Adam a picture of a guy's ass. Adam thinks it's creepy.",
        "Mell and Gloria are planning a barbecue for this Saturday.",
        "Carol has a lot of fruit from her garden. Jacob will come to pick up the fruits on Wednesday at 6pm.",
        "Nate has received an Excel file with all the registrations. The registrations are transformed into text in Excel. Nate has to create a new file and feed the data into the tables himself.",
        "Mike will call Dale back in 2 hours.",
        "Eva is leaving the party in an hour. Olivia will keep Linta ready and her bag too. Eva will pick Linta up from Olivia's place.",
        "Paul wants to know what color flowers Cindy wants. Cindy doesn't want yellow flowers. Paul asks if red flowers are ok. Cindy wants red roses.",
        "Cathy forgot her sunglasses at Broke's place. She will come to pick them up at 10 tonight.",
        "Allison has got a scholarship.",
        "Martha wants to buy lenses similar to Ophelia's. Ophelia recommends Crazy Lenses.",
        "Alex and Benjamin are talking about the basketball game. Benjamin was unable to attend because his mom is sick. Alex's team won 101-98.",
        "Luke wants to join Netflix family. Paul will send him login and password on Sunday. Luke will wire him money every month. Paul is on holidays with his girl.",
        "Olafur, Nathalie and Zoe are going to a party at Breakfast at Tiffany's club in Soho for New Year's Eve. The tickets cost 100$.",
        "Max and Payton are talking about shopping. Payton likes to browse and try on clothes, but she doesn't always buy them. She also loves reading books.",
        "Val and Candy are going to meet. It's raining. They will wait for half an hour to see if it stops.",
        "Tiffany wants Railey to buy her a burger on her way home.",
        "Andy is going to visit Paul in about an hour.",
        "Tim is planning to invite some people from work over for a gaming evening. He wants to consult Joe about what games to bring. Joe suggests starting games before they start drinking, not bringing over-complicated games, and not bringing games that encourage direct conflict. He also suggests bringing cooperative games like Arkham Horror, Robinson Crusoe,",
        "Shelly is volunteering at the food shelter this year. Tracy and Jody are not volunteering.",
        "Harry is going to Ikea. Sarah needs a white table cloth 120 cm x 140 cm, two medium size wardrobe organisers (the ones with grey flowers), one wooden spatula and three bottle cleaners. If Harry goes to the food section, Sarah would like a Daim's frozen cake and",
        "John is considering trading for Lamar Jackson.",
        "Finn wants to track his shipment. Jim helps him.",
        "Patricia will call George in an hour.",
        "Rory and Mitch are friends. Rory and Mitch are going to sign up Bill and Sammy for an international camp. Mitch will take Bill and Sammy to the camp. Mitch will leave on Sunday, the 29th. Bill will arrive around 10 am on Sunday. Joanna will pick him up.",
        "Jenny, Jeremy and Joan are going to the concert on Saturday. They will start with a drink at 8th av.",
        "Ken has hacked Greg's account and has sent him a message.",
        "John and Joan are going to see \"A Star is Born\" on Thursday at 8pm.",
        "Parker and Jason are discussing the Arrowverse. Parker wants to download the latest episode of Arrow season 7.",
        "Peter needs to talk to Anna. Anna can't talk now, she's still at work. She will call Peter in 20 minutes.",
        "Harry wants Cindy to call Ela and tell her that he needs to talk to her urgently. Cindy is annoyed because she has to do this all the time.",
        "Melissa is saying that men should be allowed to be masculine.",
        "Catherine applied for an accounting position at Pandora. Jake is still working there. The company offers possibilities of personal development and promotion. The salary increases with each promotion. The company partially finances language and accounting courses. There's also a yearly bonus that depends on your achievements and private healthcare. Catherine will have an interview on Monday. She",
        "Pete is going to buy yogurt for Jen. She wants pear flavour, but if they don't have it, he should not buy anything.",
        "Lincoln broke Hudson's toilet seat. Hudson will try to replace the broken hinge.",
        "Paul will couch the game on Saturday.",
        "Maria is preparing for a conference.",
        "Peggy's computer might be too old to repair. She's using the library computers. Melody recommends her to buy a new Mac laptop.",
        "Marleen is going to town to buy a present for Rita. She is considering buying a silk kerchief. Barry is at home.",
        "Joshua and Sarah are going to meet in New York on Thursday. Sarah will bring a gift for Joshua.",
        "Salma shared a cat meme. Hugh shared a photo of a cat.",
        "Debbie is asking for help in choosing a dress. Denise and Kelly are helping her. Kelly is considering buying the red dress for herself. The link to the store is <file_other>.",
        "Derek McCarthy needs an Android cable for an hour. Tommy will ask his wife Paulina to give it to him.",
        "Ed, Valerie, Chris, Lor, Atnee, Jessica, Matt are discussing about sex. Ed says that sex is for married people. Valerie says that it's a double sin if it's anything but missionary style. Chris says that they should get married and leave them alone. Lor says that they should hope that all",
        "Mick didn't get the confirmation email from AES yet. Barbara did. Mick has to call them.",
        "Rita needs some information about Salvage Industries. Helen will check if they have no PR problems.",
        "Carl and Duncan are discussing the upcoming championship. Carl is participating in it with his Evo 10. Duncan and Carl are cousins. Carl is hoping that his Evo 10 will not let him down this year. Duncan and Carl are planning to attend the championship. Carl will have Duncan and Carl reserved in the VIP.",
        "Euodia doesn't know what TikTok is. Domigo explains that it's an application where you can take videos, edit them with music and special effects, and share them with your friends or on YouTube. Euodia feels old because she doesn't know what TikTok is.",
        "Jane wants to know if Ainsley is free now to help her with her thesis. Ainsley is sick and can't help her.",
        "Georgia is considering buying a new dress.",
        "Sam wants to buy earphones. They are available in Garstang. Sam wants to have them delivered to him. The delivery costs £4. The earphones are new. They are also available in grey and pink. The total cost is £187. Sam wants to lower the price to £180. The delivery generally arrives",
        "Mike, Tom and Ben are going for a beer.",
        "Ann wants to thank Katie for hosting her son Tim on Monday evening and for dropping him at the railway station next morning. Ann will confirm Katie. Ann and Katie spent a weekend together 20 years ago in Saint Fargeau. Ann's son Tim will be hosted by Katie tomorrow.",
        "Aimee is looking for Maryam. She tried calling her and went to her home. Soren thinks Maryam might have gone somewhere with her father.",
        "Beth wants to try work experience in the salon. Deirdre agrees to let her try it out for a couple of weeks.",
        "Conny is going to write a paper for next week. He did some research on the internet. Fitz suggested him to go to the library.",
        "Hannah and Brooklyn are discussing their New Year's resolutions. Hannah wants to lose weight, learn how to cook and find her future husband. Brooklyn doesn't believe in New Year's resolutions.",
        "Betty and Kelly went to the pub. Kelly met a guy from school. Betty is jealous.",
        "Randal is in the store trying to find the pink nail polish. Sidney is helping him.",
        "Max's sister is studying in Shanghai, China. She believes it's a good investment.",
        "Greg is coming for a business trip and will stay at Nina's place for two nights.",
        "Erin's flight with Ryanair has been cancelled. Luke has booked another flight with easyjet.",
        "Jack and Oliver are discussing Stan Lee's death. Stanley is alive and well.",
        "Samara and JP are playing. JP has to go to work.",
        "Emma and Daniel are going to Amiens tomorrow. They will meet at Emma's place at 9am.",
        "Sean overslept again.",
        "Steve will call Sue.",
        "Don and Hank are discussing the CSS tests for their kids. The tests are today. Don hasn't registered yet. Hank is not sure if he has to fill out all the fields. The tests are supposed to last 5-8 pm. Hank will probably wait and work on the computer. Don will take the kids next time",
        "Claire is considering ordering a dress for her wedding.",
        "Miley doesn't want to go to work tomorrow. She wants to sleep. Aaron knows what she feels. He wants some holiday too.",
        "Sarah's PTO request for this week has been denied due to the number of requests. She will be able to take her PTO the following week, Monday through Wednesday.",
        "Dan cooked a BBQ for his friends. He will split the cost of the BBQ equally among all his friends. Sara, who was not present, will remove herself from the transaction. Eric and Gerardo cooked their own chicken and asparagus.",
        "Eric and Dan are discussing the Punisher season 2. Eric thinks the first season was better but the second one did some things better. Eric thinks they should have given Jigsaw more scars. They are also discussing the discontinuation of Daredevil on Netflix.",
        "Tony sent a photo of his cat to Amy and Lucas.",
        "Robyn drank too much beer last night.",
        "Laura is waiting for Paul. Paul is close to the Mac. Laura is not waiting any more. Paul is sorry.",
        "Frann and Diana are going to a hip-hop workshop.",
        "Brenda and Sandra are going to meet up next Saturday for lunch and a trip down memory lane.",
        "Casper, Alexander and Igor are not going to attend Mr. Linda's classes tomorrow. They are going to meet near the university and work something out.",
        "Abigail and Damien are going to church on Sunday.",
        "Rachel and Caron are going to meet at the Red Lion at 8.",
        "Emily is waiting to see her doctor. She is waiting with a nun and a blind crazy man. It feels spooky.",
        "Christine is not going to school tomorrow because she is not well. She has a flu. She is not eating well. She needs some Theraflu. Annie will drop them through her letterbox later on.",
        "Jeremih is mad at his sister. Hansel will tell her to text back.",
        "Ost bought a garage place in the garage. He wants to rent it out and do the restitution of his money. The prices for finding garage places are favorable in this area. The interest rates are very small, almost close to zero. Prices of garage places in Belgrade will only grow. The number of vehicles per family is growing",
        "Barry, Jake, Dave and Kelly are going to march in Women's strike. They will meet around the campus at noon.",
        "Anna and Jerry are discussing the fact that the more you study, the more you realize how miserable the world is. They both agree that ignorance is bliss.",
        "Zack and Dwayne are talking about the new Jersey Shore season.",
        "Joseph sent a photo of baby cows.",
        "Linda, Ronnie, Karen and Amanda are going to have lunch together. They will have pasta from a place near their apartment and they will take it to the park.",
        "Geri and Hilary are going to the mall tomorrow after work to buy some heels. They will also get some frozen yogurt.",
        "Bailey and Mikaela are talking about a sewing class. Bailey is going to a sewing class. Mikaela is not going to the class. Bailey has a lot of fabric in her closet. Mikaela has a box of fabric from IKEA.",
        "Clara and Ron were at Kasia's place last night. There was a weird smell. Ron didn't want to say anything about it. Clara thinks it was Kasia's 21 cats. Ron thinks it was Kasia's sleazy boyfriend. They don't know what it was.",
        "Sebastian and Kevin are talking about Sebastian's life. Sebastian has been in the city for a year and he is happy with his life. Sebastian has learned how to be resourceful and responsible. Sebastian has a girlfriend and he is happy with her. Kevin wishes he had someone by his side. Sebastian believes that if Kevin wants something really",
        "Robert is looking for a new job.",
        "Inez, Alicja, Gosia and Patrycja are planning a Food Evening. They are going to have Korean food. They will meet on Wednesday.",
        "Simon and Freddy are discussing about the school concert. Freddy is asked to sing at the school concert. Freddy is not sure if he can do it. Simon is not sure if he can find time to practice. Freddy will send Simon three tracks.",
        "Adele will come to Anne's place for Easter.",
        "Marsha, Cynthia, Gavin and Mohammad have planned a trip to Nosy Be with John. They will spend a week in a little hotel on the beach.",
        "Charles is worried about his health. He feels bloated and gains weight even though he doesn't eat much. His GP said all his problems are linked to his diet. Charles is thinking about doing a blood test. Monica stopped eating gluten and she's much better now. Karen thinks that Charles may have a very light allergy",
        "Peter and Jack are talking about an emergency at school. It was a drill.",
        "Carla and Raul are talking. Raul had a bad night and a bad morning. He started off with a fag. He doesn't know what triggered him off. Yesterday, Jen had to go to a friend. She'd broken up with her bf and Jen went to sit with her and stayed for the night",
        "Sawyer, Sutter and Wheeler are going to play a ball game tonight. Sawyer and Sutter are going to play at 8. Wheeler is injured and can't play. Yardley is going to play next time.",
        "Alicja has a job interview tomorrow.",
        "George wants to meet Donna at his place tonight.",
        "Adele got a new dog, a 4-month-old Labrador Retriever named Bones.",
        "Don asked Margot and Yvonne what they bought for Nancy's birthday. Margot bought a bottle of nice wine. Yvonne didn't buy anything yet.",
        "Archie is coming to Judah's place at midnight.",
        "Cara wants to pass by Celine's house. Celine is not at home. Celine will drop by in the evening if Cara doesn't mind.",
        "Maya wants to bring home the clothes that are hanging outside. It's going to rain. Boris is not home right now. He will tell Brian to take care of that.",
        "Sybille is trying to make her son's online registration for the flight AF3581 from Minneapolis to Paris the 29th. She is having trouble with it. She has already paid for the ticket but it has not been delivered. She is very angry because she has already spent more than 40 euros",
        "Damian watched Chelsea's game against Huddersfield. Higuain scored twice. Damian is happy for the team. Jacob and Mason didn't watch the game.",
        "Cindy has arranged a meeting with the management board at 2 pm in the conference room. Catering will bring some tea, coffee and snacks. Andy hasn't read the agenda. Cindy has booked a hotel for Don's trip. Don will have to get a cab at the airport.",
        "Robert is visiting his old pals. He thought he could catch Gabriel somewhere, but Gabriel is at home now.",
        "Lawrence is working on an article. Madison wants it to be finished quickly. Lawrence will get back to Madison once he is done.",
        "Zandra is organizing a birthday party for her daughter. Tricia is helping her. The cake is not ready yet. Erwin will deliver it by bike. Zandra is taking care of decorations. Tricia is taking care of food and outside attractions.",
        "Sally and Tim are going to see Imagine Dragons at the ABC Theatre on 12 July.",
        "Adam is going to take an exam in 10 minutes. He is very nervous. Dave believes in him and wishes him luck.",
        "Mark and Jeff are talking about Jeff's new car. Jeff is driving it.",
        "Pam asked Robert to pick up the balloons for Tom's birthday.",
        "Ben and Steven will have pizza tonight at Marco's.",
        "Marta thinks Jay is a pathological liar.",
        "Robin is trying to read up on the poker platform called Bulls Eye. Jacks has played on it several times and made a few bucks. He will send Robin some links to good sites.",
        "Sophie is going to Poanań on Tuesday. She will come back in the afternoon, but she doesn't know the exact hour.",
        "Tim has seen his mum today. Louise is with Autumn. Tim forgot about it. Tim doesn't need his mum for anything important.",
        "Steve wants Nick to buy him lunch.",
        "Mika is offering Linda some plants for her garden. Linda won't manage to do any gardening before leaving.",
        "Joel, Becky and Trent are talking about Coco.",
        "Frank and Hope are in love.",
        "Michelle and Rachel are discussing Monica's pregnancy.",
        "Cindy is sad. She doesn't want to talk about it. Ellie tries to cheer her up. Cindy has sent a video. Ellie has sent a gif.",
        "Doug has bought new shoes.",
        "Rashi is confused about her career. She is discussing with her friends about the career options. There are too many to choose from. The teacher advises her to choose a career based on what truly interests her. The passion you have for what you do drives you to success. The teacher also advises her to choose a career which interests her,",
        "Jamilla will audition at Antena 3 at 7.30 P.M.",
        "Louis is looking for a gift for Lilly and Stephen's wedding.",
        "Ty wants to know if Veronica speaks French. Veronica doesn't.",
        "Damian is starving and wants Ethan to buy him a kebab. Ethan is annoyed with Damian for not cooking something for both of them.",
        "Felipe complimented Lydia's legs.",
        "Max has sent Jim his latest music project. Jim will listen to it when he gets home.",
        "Michael can't make it today. He will call Tom tomorrow.",
        "Bradley and Jill are watching a football match at Goodison Park. A cat invaded the pitch. Jill sent Bradley a video of the cat.",
        "Mel is going to bring Xander to Mair's at 10:30.",
        "Avril and Frank are going to see horse racing.",
        "John and Andrew are playing a tank game. Andrew is on level 5 and John is on level 30. They are playing against each other. Andrew is playing Final Fantasy.",
        "Mazie and her girls are going to have a drink tonight. Lee doesn't want to know where. Mazie thinks Lee is cold. Lee doesn't like Sheryl. Mazie thinks Lee is cold. Lee spilled a drink on Sheryl.",
        "Marvin asked Melany when was the last time she got laid.",
        "Dan asked Kevin to buy him a sandwich on his way to work.",
        "Richard and Anne are going to meet up at Starbucks down 8th street after 3pm tomorrow to start planning their project. Holy will be back on Monday but will do some research tonight and send it back to them.",
        "Ellie is asking Aaliyah where their classes are now. Aaliyah is at the university. Camille is sick.",
        "Megan asked Nathan if he had any word from Jason. Nathan asked why she asked. Megan said that Jason was absent today. Susy said that Jason had a dental appointment.",
        "Drade and Marenda are discussing about Drade's brother. Drade's brother got out of the group chatting room. Marenda is sure he is angry. Drade acted aggressively. Marenda wants Drade to apologize and send the invitation to him. Drade doesn't want to",
        "Olivia has to do her accounts and upload some videos to YouTube. She doesn't do much post-production. Jake also does post-production but he doesn't always have time to do much. One time he put on one of his own pieces and it was challenged by Sony Music.",
        "Laura's mom passed away this morning. Laura, Kristian and Anne want to spend more time with her.",
        "Harris' friend Aoki died yesterday. Harris hasn't seen her for a few months.",
        "Ryan and Sebastian are discussing the situation in Ukraine. Ryan is worried about it.",
        "Sarah and Laura are in Milan.",
        "Ursula got a 93 on her French exam. Vaughn got a 65.",
        "Pamela is applying for the RGS grant.",
        "Bob bought a game and wants to play it with Harry. Harry doesn't have money to spend on games because he has a broken car and a shitty job.",
        "Hayden has to write his thesis in a month. He doesn't know what to study to make good money in the future. He's interested in African studies but he's not sure he can make big money later on. He was thinking about working as a flight attendant. He can swim, he's a water resc",
        "Natalie wants to go to the new club at Regents Street. She asks Judy if she can go with her. Judy is going there on Saturday with Miranda and Helen.",
        "Zoey and Thomas are chatting. Zoey is in the tropics and Thomas is in the cold. Thomas is fine and he had a walk around the summit of Belchen.",
        "Meg is going to meet Carl. Meg lost her key and needs 5 minutes more.",
        "Gaia is doing fine at the university. She has 6 exams this term, but only one is really hard.",
        "Madeline and Alex are going for a beer tomorrow.",
        "Jake, Nadia and Vanessa will not have English today.",
        "Rachel's aunt was in a car accident. She's bruised but she's fine. The driver who caused the accident was speeding and didn't see the red light. He's gonna pay for the rehabilitation.",
        "Nick and Jane are chatting. Jane is not interested in meeting Nick for a drink.",
        "Ashleigh got the job and she and Peter are going to the cinema.",
        "Marika is coming today.",
        "Sarah and Lia are discussing their plans for Passover. Sarah is going back home, while Lia is not sure yet. Sarah bought her tickets for 500 quid. Lia is thinking about asking her family for help. Sarah and her family are going to the desert to sleep in a huge tent. Lia and",
        "Anna is inviting everyone to her birthday party on the 6th of November at 19:30.",
        "Huda and Alex are going swimming in 2 hours.",
        "Morgan and Suzanne are talking. Morgan is trying to cheer Suzanne up. Morgan has two tickets for Maroon 5 concert at the Hulu Theater at Madison Square Garden. Suzanne is happy and she wants to go to the concert.",
        "Marco found Sandra's present at his place. Sandra wants Marco to bring it over.",
        "Zariah has a pain in her back.",
        "Alan sent an email with an attachment to Ruth. She didn't have any trouble opening it.",
        "Tina and Steve are going to have pasta for dinner. They will meet in the car park after work to do some shopping.",
        "Mike wants to go to Croatia for holiday.",
        "Ella asked her family to confirm their attendance and to inform her about their dietary requirements. She needs this information for the catering company. Barbara filled out the form for her mother too.",
        "Freddie wants to visit his Nanna. Winnie tells him that Nanna has broken her leg and she will come to visit Freddie instead. Freddie asks Winnie to tell his parents to come when they can.",
        "Maxwell and Jeanice are discussing the payment for the babysitting. Maxwell is grateful for Jeanice's help. Jeanice is going to inform Maxwell about Marcus's behavior at school. Maxwell and Jeanice are going to grab a coffee some time and talk through all the issues.",
        "Hans and Slade are going to the practice. Slade is bringing the ball.",
        "Josh and Michelle are going to the movies tomorrow night.",
        "Jack is going to the casting. Ryan thinks he can dance. Jack is going to the casting. Ryan wants to go with him.",
        "Lisa and Peter are talking about their health. Peter is working out at the gym near their office. Lisa is thinking of working out too. Peter also mentions that sleep is important for good health.",
        "Daisy is in Naples. She is going to Florence, Rome and Venice. She is flying to San Francisco. Charlie is going to Florence too. He will take a train. Daisy is going to be in Florence from 1-5 of September. Charlie wants to see Florence with Daisy.",
        "Margaret has a terrible headache.",
        "Trevor has got Abigail pregnant. It's her father's fault.",
        "Tomas is broke and waiting for the grant. Sierra can lend him some money if he needs it.",
        "Hannah is watching the game. James is going to work.",
        "Willy and Vinny are talking about Vinny's new car, a red Mustang.",
        "Whitney and Hailey are going to the cinema to see Aquaman. Shadrack and his girlfriend will also be joining them.",
        "Gina asked Warren if he locked the door. Warren confirmed that he did.",
        "Raymond and Charlotte are going to have pizza and pasta. Raymond is going to have a regular cheese and pepperoni pizza and Charlotte is going to have some pesto pennes. Raymond is going to have wine.",
        "Gary and Lara are planning Tom's birthday party. Lara will pick up the cake and balloons.",
        "Mia and Steven are going to see a movie at 9pm. They will meet at 8pm to have dinner at a Chinese restaurant.",
        "William is making spaghetti. He needs fresh tomatoes and chocolate.",
        "Ally and Jill are working on the same project. Jill has done 20-30 tasks so far. She can't do more than 3-4 tasks per day. Ally has done the same amount of tasks.",
        "Mike wants to know John's new number. Ann doesn't know it. Mike should ask Mary.",
        "Emilia is still angry.",
        "Barbara is home already. Sean is on his way with the dog. He will stay overnight.",
        "Adelina asks Cyprien where he comes from. Cyprien answers that he was born in Jarrow, lives in London now, and was educated in Loughborough. Adelina asks if he's all right. Cyprien says that he comes from Planet Earth. Adelina says that if he's going",
        "Ania, Kasia, and Jan will go to the church together tomorrow to praise Mary the Queen of Poland. Zuzia thinks it's inappropriate for a boy to go with them.",
        "Ola will be free by 8.",
        "John and Laurel are going to meet at Jade's collection in town at 5 pm to buy a birthday gift for Diana.",
        "Ken is having a bad day.",
        "Mario has been flying all over Europe today. He is now in Luxembourg.",
        "William is in a queue for the past 20 minutes. He is waiting for his turn. He will be back in 5 minutes.",
        "Jill and Susan are discussing Susan's date. Susan had a great time with her date. He picked her up from home and took her to a rollerskating disco.",
        "Matt got his ticket for Dawid Podsiadlo. Thomas will go with him.",
        "Sophia sent Mason a photo of her kissing the screen. She's sorry for not being there. Mason is fine. Sophia would give Mason a hot kiss for apologizing. Mason would love to see Sophia even if she doesn't look good. Sophia sent Mason a photo of her kissing the screen.",
        "Stan and Dave are talking about Stan's date with a girl. Stan is going to take her to Pat&Gill's.",
        "Erin is going to the restaurant to do the interview with Ashley. The wifi is better there.",
        "Aude asked Susie if she found plasters for Ted. Susie found them and Ted used them after his shower.",
        "Lindsey has just finished her class and she is going to attend another one. She asked a girl to put her name on the attendance list instead of her. She did the same last week.",
        "Brook had an accident yesterday. Gyle is coming home.",
        "Laura, Kelsey, Sid and Oona are going to see Aquaman on Thursday at 8:10 PM. Oona will get the tickets and Laura will pay her back later.",
        "Albert passed his driving exam after the 4th attempt.",
        "Vicky, Audrey, Ludovica, Greg, Michelle, and Ryan are meeting at Fratelli's. Michelle will be there in 10 minutes.",
        "Myah sent a photo of a phone number. Selah can't see the phone number very well. Myah sent a photo of the phone number again. Selah says the phone of that person is off.",
        "Adam called Tina. Tina is still at work. She will call Adam when she gets home.",
        "Ron sent Josh something he wanted.",
        "Cristina and Gaya will meet up next week to discuss the shoot. They will meet at Gaya's studio. Cristina is more free on Wednesday and Friday.",
        "Jacopo asked Ludmila if she had a favorite dinosaur growing up. Ludmila's favorite dinosaur was triceratops. Jacopo will tell her why later.",
        "Joana wants to play some games with Sandy. She will bring Dixit and Carcassonne.",
        "Thelma doesn't have anything to wear. Louisa will bring her a red velvet dress.",
        "Pet shop gave Breann and Dianne a 10% coupon code for new customers. They are going to pick the colors of their pet hut.",
        "Jane and Ella went to La Perle. Jane is allergic to peanuts. They ordered a cheesecake. Jane asked if there were any peanuts in it. They ensured her there were no peanuts. Jane started swelling after the first bite. There were crushed nuts in the crust. Jane",
        "Jannet and Nadia are having breakfast. Nadia and her friends came to Jannet's place yesterday. They had a lot of fun. They will repeat it soon.",
        "Emma and Josh spent New Year's Eve with their friends. Emma and her friends went to the seaside and ended up on the beach for midnight. Emma has a cold now.",
        "Louis and Archie are talking about Melanie. Louis sends a gif of her. Archie sends a photo of her.",
        "Shanon, Victor, Oliver and Sid are discussing their teacher. He's no longer their teacher. He got fired and thrown out of school.",
        "Kim's mom is asking what kind of gift Kim should get for Harry. Harry doesn't need a gift, but he just bought a new sofa and needs pillows.",
        "Jack is 10 minutes late. Laura will wait for him inside.",
        "Peadar, Annette, Helen, James and Oli are going to Jesus bar. Clare is not in town. Anne double booked herself.",
        "Tom and Camilla are going to Dublin this weekend.",
        "Linda missed the train to Amsterdam. The next one is in one hour. It was 80 euros.",
        "Kristian and Tabora are playing a game. Kristian asks Tabora about his preferences. Tabora answers that he prefers Adidas, orange, Batman and films. Kristian asks Tabora if he wants to keep playing. Tabora agrees.",
        "Adrian and Simon are going to talk at 5."
    ],
    "best_params": "{'do_sample': True, 'generation_seed': 42, 'max_new_tokens': 70, 'no_repeat_ngram_size': 0, 'stopping_criteria': [<llmsearch.scripts.stopping_criteria.MultiTokenStoppingCriteria object at 0x7f7d0b89cbe0>], 'temperature': 0.1, 'top_k': 50}"
}