{
    "scores_before": 0.26152565713310133,
    "scores_after": 0.25086302690438184,
    "outputs_before": [
        "Lucy and Sue are talking about JK. Sue tries to avoid it. Lucy thinks it's disgusting. Sue listens to the radio in the mornings.",
        "Simon is painting his cupboards green. Angela is meeting Chris. Wendy is having a lazy weekend. Ben is in the garden.",
        "Petra is in lectures all day. She will call Zack back in the lunch break. Zack can also write to her.",
        "Amelia and Anna are not going shopping tomorrow. Anna is meeting her study group in the morning and then she has to help her mum cleaning windows in the evening. Amelia is going shopping next weekend.",
        "Niki and Jeanna are talking about Angel. Angel has a boyfriend. Angel is disgusting. Angel eats in front of the teacher. Angel's boyfriend is disgusting too.",
        "Gabriel is picking up his new car today. It's a Mercedes-Benz, sedan, 180hp, 0-100 kmh in 6.2 seconds. It cost 55k. He's going to insure it now. He wants to go for a ride later.",
        "Danny and Kate are bored. Danny heard that Frank and Sue are dating.",
        "Jenna is cooking tonight. She is going to cook chicken in Indian way. Lilly and Eaton are going to eat with her. Lilly is going to add her spices to Jenna's food.",
        "Maria's parents decided to move to Costa Rica as soon as her father retires.",
        "Monica asks Larry and Fiona about their coming home time. Larry will come home at 6 and Fiona at 7:30.",
        "Adam, Kim, Kris and Jackie are discussing the presents they usually get for Christmas. They all agree that it's not very practical and they often end up with things they don't really need or want. Adam wants to buy a stereo system, but he needs a bit more money. He's afraid to tell his parents",
        "Deb missed seeing Danie when she visited last month. Danie would love to visit Deb some time. Danie is on the to-do list. Danie and Deb should do something together sometime.",
        "Irma will take the garbage out when she goes out.",
        "Lane and Cadence are talking. Lane is going to sleep now. Cadence will send him something funny on Facebook. Lane will write to him tomorrow when he can Skype for a while.",
        "Sandy wants to join Tina. Tina is writing an essay. She has 5 pages left.",
        "Molly is not eligible for short term disability as she gets weekly allowance from her insurance. Dirk told her about a law firm that doesn't take any fees until you get paid. Molly is considering getting her loss of wages back. Molly has credit card debt running high. Molly doesn't know when she can get back to work as",
        "Anna and Zoe are talking about Zoe's dress. Zoe bought it from C&A.",
        "Robbie invites Kris to a board game night on Friday. Kris agrees to come.",
        "Donald is asking Scofield where Mike is. Scofield told him that Mike was not at home. Donald doesn't believe him.",
        "Esme has finished her file photo.",
        "Diana is the new neighbor of Linda. She is waving to Linda from her house.",
        "Bernie's wife will be out of town for a couple of days. Chris and Marty will come over to Bernie's house on Friday after work. Chris's wife wanted to go to some exhibition, but they decided to implement date night instead.",
        "Shelly's daughter Taylor found out there was no Santa. Shelly called the teacher. Diane misses the Santa days.",
        "Katie is in front of the door. Martin is asking someone to open the door. Andy is not at home. Greg is shitting and will open the door in 5 minutes.",
        "Kate's boyfriend Matt fell off his bike and has a broken leg. Simon sprained his toe yesterday.",
        "Frank is going to IKEA to get some furniture stuff for their kids. He might get something special for Morris, his bday is coming up. They need some new lamps. Eliza needs a new lamp for Jeanine before she goes to school. Frank will go for a few rounds in Ikea and will let her know",
        "Noel is late for a meeting with a client because of the cyclists blocking the city centre. He has to put it off. Oliver invites him to grab a few beers.",
        "Leo and Evie are talking about Miley's new song.",
        "Pamela's dad has just come from the police station. He hired Jack, who was in jail for fraud. Jack begged Pamela's dad to pay back his debt. Pamela's dad thought he became another man. He cut down his salary for a few months for the amount of money he asked Pamela's",
        "Amber lost her flower necklace at the party yesterday. Mariah found it in her pocket. Gabriel is cleaning his flat.",
        "Jack has played RDR2 and he thinks it's great. He used to play with cowboy-themed lego sets when he was a kid.",
        "Leah, Gary and Maggie are discussing a new track by a band. They are excited about it. They are planning to go to a concert.",
        "Jessie's boyfriend Tom sent Martha a message. He told her that she looked cute in the green dress. Samantha and Fiona think that Tom is an asshole.",
        "Brandon wants to see a new Queen movie with Sheila and some others.",
        "Gaby and Ivan are going to Venice to see the Biennale. Leda and Marc are going to see Homo Faber.",
        "Rose bought a new jacket.",
        "Amy, Oli, Deborah and Adrienne are going to Spoons at 5:30.",
        "Larisa is waiting for Hubert to bring the spoons and she is going to vacuum the hall. Hubert will take care of the cleaning and taking out the trash.",
        "Marie loves Tamara's T-shirts.",
        "Tessa and Austen are going to read letters tomorrow.",
        "Lin is bored and can't sleep. Samuel is sleepwalking and typing to Lin.",
        "Griff and Tea are going to meet in the park in 10 minutes.",
        "Patricia and Jacob are planning to meet next week. Patricia will let them know tomorrow.",
        "Alan is going to visit his dad in the afternoon.",
        "Sharon is looking for Harry. He was at the canteen at lunchtime and later left the building to get his hair cut.",
        "Hannah is going to put all the recipes she's gathering for Mary into one pdf.",
        "Steve is waiting for the technician.",
        "Donna wants to know if there is a laundromat around. Ellis tells her that there is one, but it closes at 10 PM.",
        "Henning and Max are discussing the nationality of waiters. Max thinks that there are no huge differences throughout Europe. Henning thinks that Italian waiters are much nicer and much less professional than in Germany. Max thinks that all those theories say more about their authors than about the waiters and the countries.",
        "Lisa asks Dan how he is. Dan says he is much better now.",
        "Angelica is feeling ill a bit.",
        "Terry is looking for a physiotherapist in Carlisle. Jennifer recommends her physiotherapist, David. He helped her with her spine and her boyfriend Mick with his knee. He is a magician, Jennifer says.",
        "Julian and his band have to cancel their performance tonight at Blind Goose due to unforeseen circumstances. They are planning to reschedule it for next Tuesday, weather permitting.",
        "Conrad is pissed off because Frank forgot to meet him.",
        "Taylor is waiting for Owen.",
        "Andy yelled at Laura for an hour. He was upset over some things at work and just exploded. He ordered sushi and bought a bottle of Laura's favorite wine. Laura will think about coming home.",
        "Ann and July are going to the cinema tonight. Ann has to buy a new dishwasher for her mom.",
        "Fanny wants to make an appointment with Carol on Friday at 3.30 pm.",
        "Ann and Mark will meet at Ann's place at 11 on Saturday. They will decide where to go.",
        "Isabel and Joe are planning a trip to New York. They are staying in Soho. Gina recommends Barbuto, Café Altro Paradiso and Via Corota for Italian restaurants.",
        "Adam is looking for a band name. He wants to buy a CD for Samantha.",
        "Howard's sister Claire got a job at a cafe that employs only people with special needs.",
        "Dianne is pissed off because Andy told her that he is making a lot of money. She doesn't like that. Barrett thinks that Andy is always like this and Dianne should just let it go.",
        "Paul, Joe and Rob are going to an escape room on Friday. The theme of the escape room is narcos. Rob will book a slot for them.",
        "Meryl is going to the gala. Clint is not going. Roberta is working there.",
        "Miles had a dream where he was stuck in the 80's and couldn't figure out how to get back to 2018.",
        "Edward gave his mom $1,000 for her birthday. She gave it to her new boyfriend who lost it all gambling in Las Vegas.",
        "Jose passed his driving test. He's looking for a nice car now.",
        "Lenny and Rick are excited about the Venom trailer. Thomas thinks it's going to be rubbish.",
        "Luke, Chloe and Jack are going to the party. Jack will drive his car.",
        "Violet has read Austin's article.",
        "Joseph is sorry about what happened to Carlos' mates. Carlos says that it's not the first time this kind of things happen in Argentina. People can get really violent when it comes to football.",
        "Gemma forgot her keys and Suze invited her to come to her office.",
        "Kela sent Cher a birthday message and some photos.",
        "Pete is coming home. He's been in a line at the store. Nicole is making dinner.",
        "Jacqui has a new idea for a website. She wants to create a self-learning institute. Andy will write the architecture for her. The cost of getting the start of content is going to be something between two and three hundred dollars. Jacqui will see if she can get some crowdfunding going.",
        "Stephanie and Victor are going to see Captain Marvel together.",
        "Jill and Jack are talking about their upstairs neighbors who are having sex again. Jack is away and Jill is jealous. Jack is at a meeting and he will know tomorrow if his idea is accepted.",
        "Charles thinks long distance relationships don't work. Jim agrees.",
        "Michael and Jane have seen the last episode of Supernatural. They both liked it.",
        "Andy asked Sharol to pick up Mary from university because her car was hit when it was parked.",
        "Caroline and Blake are in Basel for the art fair. Hans and Reinhard are on their yacht in Monaco. Caroline can't join them because she has to be in Basel tomorrow. Hans and Reinhard will be in Monaco for a few days.",
        "Carol's computer stopped working. She needs help. Michelle will give her Bill's number.",
        "Diana's mother passed away one year ago. Danielle's mother was a communist and a fighter in the resistance movement. She was lucky to survive. She met Danielle's father in 1943. He was also a communist. He was killed one year after Danielle was born. Danielle's",
        "Adalyn and Nora are going to attend self-defence classes for women.",
        "Mat is waiting for Chris to finish his work. Chris is not answering. Mat will try to contact him. Mat is working on his presentation.",
        "Cass is ordering pizza for dinner. Drew and Cassie are having a date. Braden and Mickey are in.",
        "Wendy and Diana are planning a surprise party for Pam's birthday.",
        "Peter is home already. Liz will be home before 6. They will watch Netflix and drink wine.",
        "Scott is back in Uganda. Sasha is going to a party with her mates from the uni.",
        "Kyle has finished reading the new D&D expansion. Stephen, Carol and Josie are interested in checking it out.",
        "Boyle moved out because he was tired of living with his mom. He moved to Stonehenge with his buddy from work.",
        "Cora, Lydia and Kaylee are going to a spa.",
        "Sasha asked Dean to print her essay on modernism for her.",
        "Ralph has found a company called \"Venque\". Charles thinks that the company has very beautiful but expensive products. Ralph has found a bag from this company.",
        "Gera and Hope will meet at 2.",
        "Fiona and Tom are going to meet after work. Tom might be late because of a meeting.",
        "Caron found the Beautiful South on her Tidal app.",
        "Susanne, Lilly and Rachel are going to a concert. Susanne is asking what time the concert starts. Lilly is looking for their tickets.",
        "Dora can't come to the party because her mom is ill."
    ],
    "outputs_after": [
        "Lucy and Sue are discussing JK.",
        "Simon is painting his cupboards green. Angela is meeting Chris. Wendy is having a lazy weekend. Ben is in the garden.",
        "Petra is in lectures all day. She will call Zack back in the lunch break. Zack can also write to her.",
        "Amelia and Anna are not going shopping tomorrow. Anna is meeting her study group in the morning, visiting her grandma who turns 86, and then helping her mum cleaning windows. Amelia is looking forward to shopping next weekend.",
        "Niki and Jeanna are talking about Angel, who has a boyfriend. They are discussing how Angel behaves in class and how her boyfriend copes with her smell.",
        "Gabriel is picking up his new car today. He bought a Mercedes-Benz, sedan, 180hp, 0-100 kmh in 6.2 seconds. It cost 55k. He will insure it now. He wants to go for a ride later.",
        "Danny and Kate are bored. Danny heard that Frank and Sue are dating.",
        "Jenna is cooking tonight. She is cooking chicken in Indian way. Lilly and Eaton will join her. Lilly will add her spices to Jenna's food.",
        "Maria's parents decided to move to Costa Rica as soon as her father retires.",
        "Monica asks Larry and Fiona what time they are coming home. Larry will come home at 6 and Fiona at 7:30.",
        "Adam, Kim, Kris and Jackie are discussing their Christmas presents. Adam is fed up with getting socks every year. Kim and Kris are going to tell their families about their idea of leaving lists of presents they would like to get. Adam is going to tell Kim how to talk to her parents.",
        "Deb missed seeing Danie when she visited Melbourne last month. Danie would love to visit Deb some time.",
        "Irma will take the garbage out when she goes out.",
        "Lane and Cadence are talking. Lane is going to sleep now. Cadence will send Lane something funny on Facebook. Lane and Cadence will talk tomorrow.",
        "Tina is writing an essay for Monday. She has 5 pages left to write.",
        "Molly is not eligible for short term disability as she gets weekly allowance from her insurance. Dirk told her about a law firm that doesn't take any fees until you get paid. Molly is considering getting her loss of wages back. Molly has credit card debt running high. Molly doesn't know when she can get back to work as",
        "Anna and Zoe are talking about Zara's dress.",
        "Robbie invites Kris to a board game night on Friday. Kris agrees to come.",
        "Donald is asking Scofield where Mike is. Scofield told Donald that Mike was not at home. Donald doesn't believe Scofield.",
        "Esme finished her file photo.",
        "Diana is the new neighbor of Linda. She is waving to Linda.",
        "Bernie's wife will be out of town for a couple of days. Chris and Marty are going to come over to Bernie's house on Friday after work. Chris's wife wanted to go to some exhibition, but they decided to implement date night instead.",
        "Shelly's daughter Taylor found out there was no Santa. Shelly called the teacher. Diane misses the Santa days.",
        "Katie is in front of the door. Martin is asking someone to open the door. Andy is not at home. Greg is shitting and will open the door in 5 minutes.",
        "Kate's boyfriend Matt fell off his bike and has a broken leg. Simon sprained his toe.",
        "Frank is going to IKEA to buy furniture for their kids. He will also buy a special gift for Morris's birthday. Eliza needs a new lamp for Jeanine.",
        "Noel is late for a meeting with a client. He is stuck in traffic because of a cycling event. He is going to meet Oliver at the usual place.",
        "Leo and Evie are talking about Miley's new song.",
        "Pamela's dad has just come from the police station. He hired Jack, who was in jail for fraud. Jack begged Pamela's dad to pay back his debt. Pamela's dad thought he became another man. He cut down his salary for a few months for the amount of money he asked Pamela's",
        "Amber lost her flower necklace at the party yesterday. Gabriel will look for it in his flat. Amber fell asleep in Glen's car and Glen carried her inside. Mariah found Amber's necklace in her pocket. Mariah will bring it to the office on Monday. Gabriel will clean his flat after breakfast.",
        "Jack has played RDR2 and he thinks it's great. He used to play with cowboy-themed lego sets when he was a kid.",
        "Leah, Gary and Maggie are discussing the new track of a band. They are excited about it. They are planning to go to a concert.",
        "Jessie's boyfriend Tom sent a message to Martha. He told her that she looked cute in the green dress. Samantha and Fiona think that Tom is an asshole.",
        "Brandon wants to see a new Queen movie with Sheila and some others.",
        "Gaby and Ivan are going to Venice to see the Biennale. They will go to Giardini and Arsenale.",
        "Rose bought a new jacket.",
        "Amy, Oli, Deborah and Adrienne will meet at Spoons at 5:30.",
        "Larisa is waiting for Hubert to bring the spoons and she's going to vacuum the hall. Hubert will wash the spoons when he comes back.",
        "Marie loves Tamara's T-shirts.",
        "Tessa and Austen are going to study tomorrow.",
        "Lin is bored and can't sleep. Samuel is sleepwalking and typing to Lin.",
        "Griff and Tea are going to meet in the park in 10 minutes.",
        "Patricia and Jacob are planning to meet next week. Patricia's father has his 50th birthday next week.",
        "Alan is going to visit his dad in the afternoon.",
        "Sharon wants to know if Harry is in the building. Benjamin and Ali saw him at lunchtime. Josh saw him later, he was going to get his hair cut. The system has just collapsed, they need Harry.",
        "Hannah is going to put all the easy recipes she's gathering for Mary into one pdf.",
        "Steve is waiting for the technician.",
        "Donna wants to know if there is a laundromat around. Ellis tells her that there is one, but it closes at 10 PM.",
        "Henning and Max are talking about waiters and waitresses in different countries. They are discussing the theories of Louis about the waiters in Italy and France. They are also discussing the theories of Jakob about the waiters in Italy and Poland. They are also discussing the theories of Max about the waiters in Germany and France. They are",
        "Lisa asks Dan how he is. Dan says he's much better now.",
        "Angelica is feeling ill a bit.",
        "Terry is looking for a physiotherapist in Carlisle. Jennifer recommends her physiotherapist, David. He helped her with her spine and her boyfriend Mick with his knee. He is a magician, Jennifer says.",
        "Julian and his band have to cancel their performance tonight at Blind Goose due to unforeseen circumstances. They are planning to reschedule the show for next Tuesday, weather permitting.",
        "Conrad is pissed off because Frank forgot to meet him.",
        "Taylor is waiting for Owen.",
        "Andy yelled at Laura for an hour. He was upset over some things at work and exploded. He ordered sushi and bought a bottle of Laura's favorite wine. Laura will think about coming home.",
        "Ann and July are going to the cinema tonight. Ann has to buy a new dishwasher for her mom.",
        "Fanny wants to make an appointment with Carol on Friday at 3.30 pm.",
        "Ann and Mark will meet at Ann's place at 11 on Saturday. They will decide where to go.",
        "Isabel and Joe are planning a trip to New York. They are staying in Soho. Gina recommends Barbuto, Café Altro Paradiso and Via Corota for Italian restaurants.",
        "Adam is looking for a band name. He wants to buy a CD for Samantha.",
        "Howard's sister Claire got a job at a cafe that employs only people with special needs.",
        "Dianne is upset with Andy because he told her that he is making a lot of money. She is also upset because he paid for her lunch. Barrett thinks that Andy is always like this and Dianne should just let it go.",
        "Paul, Joe and Rob are going to an escape room on Friday. The theme of the escape room is narcos.",
        "Meryl is going to the gala. Clint is not going. Roberta is working there.",
        "Miles had a dream where he was stuck in the 80's and couldn't figure out how to get back to 2018.",
        "Edward gave his mom $1,000 for her birthday. She gave it to her new boyfriend who lost it all gambling in Las Vegas.",
        "Jose passed his driving test. He's looking for a nice car now.",
        "Lenny and Rick are excited to see the trailer for Venom. Thomas thinks it's going to be rubbish.",
        "Luke, Chloe and Jack will go to the party in Jack's car.",
        "Violet found an article about Austin and thought Claire might be interested in it.",
        "Joseph is sorry about what happened to Carlos' mates. Carlos says that it is not the first time this kind of things happen in Argentina. People can get really violent when it comes to football.",
        "Gemma forgot her keys and Suze invited her to come to her office.",
        "Kela sent Cher a birthday message and some photos.",
        "Pete is coming home. He's been in a line at the store. Nicole is making dinner.",
        "Jacqui has a new idea for a website. It's a self-learning institute. The Institute of Self-Tuition. If anyone wanted to learn a topic, they would go to that section of the site and the site would give an introduction to the areas of learning within that topic and what to look out for.",
        "Stephanie and Victor are going to see the movie Captain Marvel together.",
        "Jill and Jack are discussing the meeting Jack had today. Jack will know tomorrow if his idea was accepted. Jill and Jack are also talking about their upstairs neighbors who are having sex again.",
        "Charles thinks that long distance relationships don't work. Jim agrees.",
        "Michael and Jane have seen the last episode of Supernatural. They both liked it.",
        "Sharol will pick up Mary from university. Mary's car has been hit and she can't start it.",
        "Caroline and Blake are in Basel for the art fair. Hans and Reinhard are on their yacht in Monaco. Caroline can't join them because she has to be in Basel tomorrow. Hans and Reinhard will be in Monaco for a few days. The weather is perfect. Caroline and Blake want to buy some more art",
        "Carol's computer stopped working. She needs help. Michelle told her about Bill who can fix any computer. Bill's number is 717-222-4877.",
        "Diana's mother passed away one year ago. Danielle's mother was a communist and a fighter in the resistance movement. She was lucky to survive. She met Danielle's father in 1943. He was also a communist. He was killed one year after Danielle was born. Danielle's",
        "Adalyn and Nora are going to attend self-defence classes for women.",
        "Mat is waiting for Chris to finish his work. Chris is not answering. Mat will try to contact him. Mat is working on his presentation.",
        "Cass is ordering pizza for dinner. Drew and Cassie are having a date. Braden and Mickey are in.",
        "Wendy and Diana are planning a surprise party for Pam's birthday.",
        "Peter is home already. Liz will be home before 6. They will watch Netflix and drink wine.",
        "Scott is back in Uganda. Sasha is going to a party with her mates from the uni.",
        "Kyle has finished reading the new D&D expansion. He will DM the game.",
        "Boyle moved out. He's tired of living with his mom. He moved to the other side of the city with his buddy from work.",
        "Cora, Lydia and Kaylee are going to a spa.",
        "Sasha asks Dean to print her essay on modernism for her. Dean agrees to do it.",
        "Ralph has found a company called \"Venque\". Charles thinks that the company has very beautiful but expensive products. Ralph is interested in a bag from this company.",
        "Gera and Hope will meet at 2. Hope will be in her office.",
        "Fiona and Tom are going to meet after work. Tom might be late because of a meeting.",
        "Caron found the Beautiful South on her Tidal app.",
        "Susanne, Lilly and Rachel are going to a concert. Susanne and Lilly are going to meet Rachel there.",
        "Dora can't come to the party because her mom is ill."
    ],
    "best_params": "{'do_sample': True, 'generation_seed': 42, 'max_new_tokens': 70, 'no_repeat_ngram_size': 0, 'stopping_criteria': [<llmsearch.scripts.stopping_criteria.MultiTokenStoppingCriteria object at 0x7f7d0b89cbe0>], 'temperature': 0.1, 'top_k': 50}"
}