{
    "scores_before": 0.257852927825895,
    "scores_after": 0.2581935494075166,
    "outputs_before": [
        "Claire is cooking a curry. Linda is also cooking a curry.",
        "Alyssa and Derek are talking about Fergie's national anthem. Derek saw it last week.",
        "Ann wants to buy a laptop from Josh. The laptop is available for 250 dollars. Ann will pick it up.",
        "Matt, Phil and Tony are going to see Bon Jovi in Warsaw next July.",
        "Anastasia and Darrell are talking about Anastasia's new school photos. Anastasia is not happy with her new school photos. She took the photo in less than a minute. School photos always suck. Anastasia needed a new one for her school ID.",
        "Mike wants to apply for the research trip. Jake, Florence, Margot and others are going. Jake reminds Mike that it can be harsh in Swazi now. Mike is surprised that Jake doesn't know that the country's name has changed to Eswatini.",
        "Nathalie, Pauline, Jacob and Anthony are planning a holiday. They are thinking about Greece. Nathalie's sister is getting married on August 10th. They need to be back by that date.",
        "Kim is looking for fresh ramal fish in Warsaw. She has already tried Polna street market. Margot suggests Kim to check restaurants' menus and ask about their source. Kim is going to grill the fish for a surprise.",
        "Malik and Samantha are going to try the paleo diet together. They will also go for runs together.",
        "Suzy asked Linda to follow her on Instagram.",
        "Angelina and Jones are going to meet in the afternoon in town.",
        "Erin has baked something and Zachary is busy cleaning the flat.",
        "Piper is waiting for the payment from Bryan. Bryan's manager will send it tonight.",
        "Ulysses and Peter got an A. Julia got a B. Martha can check her grades online on the course page.",
        "Cora and Ellie are talking about the meet and greet with James Charles in Birmingham. About 8000 fans showed up for it, causing a gridlock around the mall. British media made a fuss about it.",
        "Adam's friend saw Tim with a guy. Julia knew Tim was gay. Adam defended Tim. Julia didn't think it was her business to tell Adam. Nate thinks it's not fair that Tim didn't tell them.",
        "Lily needs to rent a popcorn machine for her office Christmas party. She will screen Love Actually. Daniel will check if he knows someone who rents them.",
        "Phil is still in the shop. He couldn't find any parking place and now he's standing in a gigantic queue. Nancy will make an apple pie for Phil.",
        "Timmy had a bad day at work. Gemma is organizing a BBQ at the weekend.",
        "Shaldona and her partner are getting married. They sent a wedding invitation to Piper through Messenger. Piper is upset because Shaldona didn't have time to meet her in person to give her the invitation.",
        "Perry, Marlow, Janet and Forster are going to meet tomorrow evening to discuss their holiday plans.",
        "Joyce wants to take the car to pick up Harry. Kyle is running late and has to go to a mechanic because the car is making a weird noise. Joyce is annoyed because she has to go by bus. Kyle will get Harry.",
        "Tim is running late. Gary will go in and make small talk to delay the main presentation.",
        "Ella heard that Molly met up with Chuck on Friday. Molly says that she didn't meet up with Chuck.",
        "Taylor is having a party tomorrow at 8 PM at her house. Her parents are away. Harry is going to attend.",
        "Christie and Katie had a great party.",
        "Chandler needs money to pay the delivery guy standing outside his door. Phoebe is on her way to help him.",
        "Carlton, Ana and Katy are going to see a film by Lola Arias. Carlton is going to join them. They will meet at Ana's place for an early dinner/drinks and then they will grab an uber.",
        "Ollie, Kelly, Mickey and Jessica are talking about scary places. Ollie starts with Nagoro village in Japan. Kelly goes next with a sculpture garden in Finland. Mickey is last with a place in Japan. Jessica is scared of the sculptures in Finland.",
        "Ariana is going shopping in Midtown. Aviana wishes she could go with her.",
        "Johnatan, Darren and Lucas are going to have a beer in the evening.",
        "Lisa wants Bob to clean the bathroom.",
        "Noah and Sophie are discussing the quince. William has already collected them for Sophie. Sophie and her family will come to collect them tomorrow. Sophie and her family are coming home this weekend for Alexa's ceremony.",
        "Chloe is on TV. She is participating in a programme in which women undergo a complete metamorphosis.",
        "Shari and Stewart are discussing the current political situation. Stewart is upset with the current president's ignorance and lack of understanding about the forestry department. Shari is also upset with the current president's legal problems and the fact that he is breaking amendments to the constitution. Stewart and Shari are planning to vote for anyone else but",
        "Harvey is waiting for an update from Michelle.",
        "Martin won two cinema tickets. He will go to see the new film with Redford.",
        "Catherine and Ben are going to visit uncle Steve. Ben doesn't want to go because he doesn't like such visits. Catherine wants Ben to come because the boys miss him.",
        "Abby talked to Miro yesterday at the party. Miro's father came from Albania to the US in the early 1990s.",
        "Marty has sprained his ankle and can't pick up Marcel from school. Christine will pick up Marcel from school and take Marty to the doctor.",
        "Molly has a free ticket to the Muse concert in Cracow. Anna wants to go with her.",
        "Paul will be home later than he thought. He will call Lena in 15 minutes and then he will tell her what happened.",
        "Jane is going to Value Village with her sister to get Halloween costumes. If anyone wants to join, they can. Connor already got his costume today.",
        "Adam will take the dog for a walk.",
        "Joanne is going back home to France for the holidays. Her parents separated a few months ago. Joanne's mum is very depressed. Evelyn invites Joanne to spend Christmas with her.",
        "Rita and Tina are tired and bored at work.",
        "Adam has a gossip about Iga and her boyfriend. They planned a weekend getaway but had to cancel because her boyfriend couldn't change the date of his presentation. Iga is pissed.",
        "Chris and Rick are going to skype tomorrow at 3 pm Rick's time.",
        "Joyce found a cheap flight.",
        "Andy has tested the mould in Betty's house and found out that it is caused by condensation. The mould is mainly on the walls of the spare bedroom and the dining room because they have external walls which are cooler than internal walls. The mould is not in the kitchen and bathroom because the kitchen doesn't",
        "Peter didn't get into Stanford. Matt and Oliver did. Peter has to look for other university.",
        "Phil wants to go out today. Phoebe can't because her mum is still angry. Phoebe used her mum's perfume and broke it. The whole house stinks now.",
        "Stanley and Bill are working on the Lidem project. Stanley is finishing the analysis for the previous project. Bill is researching the funding. Alison is out of touch. Stanley is going to talk to Del.",
        "Dominique asks Denise what's for the test tomorrow. Denise answers that it's units 2 and 3.",
        "Luke and Martial are going to Carrington tomorrow morning to meet Jose. They will tell him that they are ready to play despite their injuries.",
        "Natalie is looking for her wallet. Jenny is not at home. Tobias has found Natalie's wallet.",
        "Ivan and Eric are talking about the wedding. Eric is coming to the wedding.",
        "Danna is angry because she called her friends and they are not around or are busy. Reed is in bed.",
        "Ricky, Shelly and Tom are discussing the weather outside. Ricky is reminding Tom about a time when he was hiking in the mountains. Tom was a student and he went with a group of friends. They rented a cabin in the wild.",
        "Amelia is asking Emily about her favourite colour.",
        "Claire is asking Aaron about the conference about relations at school. Aaron tells her that it's in the teaching training thing in Sesame Street. Claire is going to attend Jo's workshop on teamwork.",
        "Rachel and Janice are discussing the Top 50 Best Films of 2018.",
        "Matthew has a cold. Lisa advises him to drink orange juice and make some soup. Matthew will try. Lisa believes in him. Matthew will take a rest.",
        "Joanne wants to talk to Bradley. Bradley is busy at work.",
        "Edward, Lauren and Kate are going on a business trip tomorrow. The boss is coming with them. They are going to an expo. They have to pretend to be nice to people coming to their booth.",
        "Jesse has an idea to do something for the less fortunate this year. He suggests to choose one of the wish lists of the Refuge and chip in. Jesse is in for the third list. Lee and Melvin agree to help.",
        "Emma wants to take a stroll with Abigail and her children. Abigail doesn't think it's a good idea because the smog alert app shows that the norms have been exceeded by 30%.",
        "Miranda wants to cancel tomorrow's meeting with Stephanie.",
        "James and Mia are going to the art exhibition of their lecturer in philosophy, Professor Evans, tomorrow. They will also go to the cinema with Amelia.",
        "Mary is broke and needs a few bucks. Carter will lend her some money. He is at the train station. He will give her the money in an hour.",
        "James, Mary and Patricia are going to Japan. Patricia is scared of earthquakes and tsunamis. James and Mary are trying to calm her down.",
        "Steffen twisted his ankle yesterday and can't walk properly. He can't go to the infinity pool.",
        "Rob is at the grocery store and Ann is at a meeting. Ann wants Rob to buy some food. Rob will buy cucumber, tomatoes, bananas, apples and whatever Rob likes.",
        "Emily is asking where the next ASEEES conference will take place. James says it will be in San Francisco. Chloe hopes for Hawaii, but James says it won't happen too soon.",
        "Helen forgot her laptop at home and needs Debbie to bring it to her.",
        "Janice's son wants a hamster for his birthday. Martina advises against it.",
        "Casey has done her nails herself. She used a new nail polish. It took her nearly 4 hours. Amelia and Kristen want Casey to do their nails too.",
        "Louis and Sara saw a huge crowd outside the book shop today. Louis' friend told him that the writer Cole Grant was there signing copies of his books.",
        "Jack has Josh's notebook. He will bring it tomorrow.",
        "Jason and Dory are making a video. Dory's friend is coming over the day after tomorrow and will stay for a week. Jason and Lucy have a script and an app to make the video.",
        "Mia, Jennifer, Karine and Peter are discussing about the wall. Karine thinks that Trump is not senile and stupid as they would like to believe, but he is pure evil. He is destroying the Earth and trying to shake the world's order. Jennifer thinks that Trump is quite stupid and his persistence and ignorance are dangerous.",
        "Ray is locked in his room. Max is out. Ray has to pee.",
        "Kathy and Olivia are going to get their hair cut today. Kathy's aunt is getting her hair cut too.",
        "Jair is still busy.",
        "Mico and Jeff are going to the village party. Mico will drive.",
        "Derek and Phil had a long day. Derek closed some deals but also had a lot of stress. Phil couldn't close any deal. Some customers are just fishing for offers.",
        "Joanna's thesis mentor, Lewandowska, is hospitalized because she has measles. Anyone who had contact with her within the last couple of days must get vaccinated. Joanna will try to get vaccinated before work on 18th.",
        "Alexa asked Ethan to insult Hunter.",
        "Gill needs a new peeling. Bunny suggests making her own peeling.",
        "Desiree asked Lucian if he and his wife were at home. Lucian replied that he was not at home. Desiree asked Lucian to keep her pasta in the microwave.",
        "Eric and Samantha are talking about a video. Samantha is laughing. Eric is talking about a scandal on the news. Noah is laughing.",
        "Tobi, Nicholas, Serena and Ella have been to the new club in Cork. They all think it's a waste of time and a huge disappointment. They went there with Ella last weekend because of the cool ad campaign. The club was empty and nobody was there. Tobi, Nicholas, Serena and Ella won",
        "Charlie's sister has just passed her last exam on her Uni. Charlie and his friends want to go out tonight. Frank will join them.",
        "Emma is on the bus. She will arrive in New York around 4.30 PM. She wants to wake up around 4.15 PM.",
        "Kris, Ovi, Jason and Nadine are all cold. Nadine is working at her clinic and they are getting lots of sick patients.",
        "Adam is going to visit his parents. His flight was rescheduled and will arrive one hour later.",
        "A guy got beaten and mugged on campus. He's in the hospital, but he'll be fine. The assailant had a mask on.",
        "Karen passed her driving test.",
        "Ginger is coming to Phyllis's house to bake a pie.",
        "Maria is tired of her job and wants to quit. Anastasia and Felix are trying to calm her down.",
        "Daniel, Mary and Lucas are discussing Dragon Age. Daniel has just started playing Dragon Age: Inquisition. Mary and Lucas have played it before. Mary loves it and recommends it to Daniel.",
        "Lenny is going to buy a pair of trousers. He is asking Bob for advice. Bob is suggesting Lenny to pick the best quality.",
        "Ross wants to do karaoke tonight. Chandler agrees, but only this once. Ross will do George Michael.",
        "Michelle loves Kelly and Jared likes her too. Jared wants to ask Kelly out. Michelle doesn't mind.",
        "Fiona needs to go to a doctor tomorrow at 8 a.m. She asked Anna to go with her. Anna agreed.",
        "Hollie asked Amy how she was. Amy said she was working now and would get back to Hollie later.",
        "Ying posted a photo of her 10 years challenge.",
        "Kelly is going to wear a red dress. Mary will wear a red dress and bright red lipstick.",
        "Laura and Linda will go to an Italian restaurant tomorrow.",
        "Caroline thinks that her boyfriend's mother doesn't like her. She is his first girlfriend and he lives with his mother and grandmother. He is 26 years old and an introvert. He is writing something and will text Kate later.",
        "Mary is doing an online job. Mark told his sister about it. Mary doesn't care about what her sister says. Mark is sorry for what his sister did.",
        "Rob and Eve are going to meet up on Sunday morning.",
        "Kirsten and Larry are discussing the post about the insurance. Larry is going to take a look at the email and get back to Kirsten. Kirsten is going to get her husband to sign off on it since they are referencing him. Larry is going to post it. Kirsten is going to stay busy and she is",
        "Owen and Neil think there's something wrong with Amy. Penny wants to meet her in person.",
        "Sam is upstairs. Kate is downstairs. Jeff is in the little room next to the reception. Kate saw a woman making a cake with a huge penis on it. Sam must see it.",
        "Kelly picked the first question. Jessica's answer is Palermo in Italy. The Capuchin Catacombs are there with 8000 corpses. They are divided somehow, but Jessica doesn't know how. Most of them were exhibited in their clothes. Only skulls and hands are visible.",
        "Mr. Williams and Ms. Blair are going for a coffee at 2 p.m.",
        "Pat will come in the evening, around 9pm. Bart will open the door for him.",
        "Hannah wants Betty's number. Amanda can't find it. Amanda suggests Hannah to ask Larry. Hannah doesn't know him well. Amanda insists Hannah to text Larry. Hannah agrees.",
        "Julia's parents are having a fight over where to eat. Julia doesn't want to eat with them anymore. Ronald will call her when she gets back.",
        "Steve's dishwasher has been installed. It's a 12 place setting one.",
        "Bella and Aria are talking about Valentine's Day. Bella is in Warsaw and Aria is in Korea. Bella is going to order pizza home. Aria is going to leave work at 6. Bella is going to Korea to get a regular checkup.",
        "Mario wants Conor to bring him a bucket of fries from KFC.",
        "Alivia is having trouble writing her thesis.",
        "Patricia has found a fair-trade brand.",
        "Rob wants to start the Get off the couch challenge. He will start with 30 minutes of activity every day. Greg is already doing at least 60 minutes a day. Will thinks Rob should be realistic. Anna is in.",
        "Sharon's mum is angry with her. Sharon is grounded. She lives with her parents. Ahmed wants her to move in with him. Sharon is a student and has to go to work. She cares about her parents.",
        "Pegah will be back at 22:00. Miriam invited some people over and was hoping Pegah would be there too.",
        "Karine and Jessie are watching a video of them at kindergarten.",
        "Bennett is in town and he wants to meet Cynthia. They will meet at a new bistro that Cynthia discovered.",
        "Jess had a dream about being a lion tamer. She asked her friends if it means she should go to Africa this summer. Lynn thinks Jess might meet a handsome zookeeper. Charlie thinks Jess might get attacked by a stray cat. Jess doesn't believe in dreams.",
        "Rachel and Wai are going to the museum at 4. They will meet at the main entrance. After that, they will see if anyone wants to go to a bar.",
        "Grace is out of hand sanitizer. Mike will refill it.",
        "James and Hannah are going to meet on Saturday at 8.",
        "Callan's Samsung S8 has a black screen. He thinks it overheats. He's going to the store to let them see it. It's still under warranty.",
        "Molly and Margaret are hesitating whether to go to Sweden for a week in January. They bought cheap tickets half a year ago. Peter and Kai think it will be dark and cold. Kai suggests visiting museums and bars in Stockholm. Margaret thinks it's not a good time for nature. Peter recommends visiting the Vasa Museum",
        "Bart didn't study for his economy final and ended up with a bad score. He plans on re-taking the class next year. Adrian didn't do that bad this semester.",
        "Jack needs Kev's help. He can't get the application running. Kev will be with him right now.",
        "Gina needs a USB from Monica. Monica has a free USB. Gina will go to Monica's office.",
        "Whitney is asking William what they will have for dinner. William is making spaghetti alla vongole.",
        "Rael is fed up with her job. She doesn't have time to eat her lunch. She talked to her manager, but he doesn't understand that they are humans, not robots. She wants to quit, but she needs to find a new job first. Zach suggests her to try IT. He will talk to his friends who",
        "Charlee is in class. She is studying Portuguese theatre at the university. She is preparing a performance. The performance is a Polish one translated into Portuguese. The writer is Mrożek.",
        "Bobby is annoyed by pharmaceutical companies inventing illnesses. He found out that a certain illness mentioned in a commercial doesn't exist. He thinks that pharmaceutical companies are selling mints as medical products. The pharmaceutical industry is worth at least $1.2 billion.",
        "Luke wants to see the parrot Gina painted yesterday. Gina sends him a photo. Luke thinks the parrot looks fantastic. Gina sends him a PDF file.",
        "Sam is looking for a black dress for his wife. He wants it to be elegant and different from what is available in the store. Sarah from the fashion store is helping him to choose the dress.",
        "Holt is looking for a birthday gift for his sister. She is 21 years old. Olive suggests cosmetics. Zula suggests DVDs or book series. Holt will get her a set of DVDs and some cosmetics.",
        "Maria and Spencer are catching up. Maria is working at a call centre and wants to go part time next year to do some freelancing. Spencer is working at a cafe and doing illustrations. He earns around £1000 a month from his illustrations.",
        "Jay and Joe are going to the concert in Kenya. Jay will lend Joe some money for the tickets. Jay has convinced Ruth and Paulette to accompany them. Joe will pay Jay back next time.",
        "Tom is asking who is around. Jack is telling him that his dick is around. Tom is telling Jack to go fuck himself. Robert is not in town.",
        "Nova and Dominic are discussing Timothée Chalamet's photoshopped portraits in artworks.",
        "Tanya asked Rosie if she was better today. Rosie said she was better but not good. Tanya was relieved.",
        "Kyle wants to call Lily and Mary in 10 minutes.",
        "Serena and Jeff are talking about Jeff's skin condition. Jeff says that he doesn't have to take meds all the time. Serena will tell Tina about it.",
        "Aubrianna's friend's dad died because of malaria in Kongo. Darien says it's dangerous for all people not just whites.",
        "Will is standing in a long line at the post office. He hates queues. Chris thinks that lines are a part of everyday life in a big city. Will is annoyed by the fact that the line consists almost entirely of elderly people who don't have bank accounts and pay their bills via post office paying cash.",
        "Iris' husband Pete has got an interview. Iris' parents are glad that she found a decent man. Pete will be home in an hour.",
        "Jen is fed up with her boyfriend. He's being a pain again and she's going to tell him to move out. Jane thinks Jen should get rid of him. Jen is afraid of asking him to leave because it will only cause another fight. Jane thinks Jen should cut her losses and move on.",
        "Ema is coming to the movie in 5 minutes.",
        "James is going to drive Richard to the airport. Richard should be ready at 6:15.",
        "Sally told her friends that Natalie is pregnant and the father is Dave.",
        "Biwott told Chloe about a series. Chloe hasn't watched it yet, but she will watch it during the weekend.",
        "Marek sent Adam a picture of a guy's ass. Adam thinks it's creepy.",
        "Mell and Gloria are planning a barbecue at Mell's place on Saturday.",
        "Carol has a lot of fruit from her garden. Jacob will come to pick it up on Wednesday at 6pm.",
        "Nate has received an Excel file with all the registrations. The registrations are transformed into text in Excel. Nate has to create a new file and feed the data into the tables himself.",
        "Mike will call Dale back in 2 hours.",
        "Eva is going to a party. Linta is with Olivia.",
        "Paul wants to know what color flowers Cindy wants. Cindy doesn't want yellow flowers. Paul asks if Cindy wants pink flowers. Cindy doesn't want pink flowers. Paul asks Cindy what color flowers she wants. Cindy wants red roses.",
        "Cathy left her sunglasses at Broke's place. She will come to pick them up at 10 tonight.",
        "Allison has got a scholarship.",
        "Martha wants to buy lenses similar to Ophelia's. Ophelia recommends Crazy Lenses.",
        "Alex and Benjamin are talking about the basketball game. Benjamin couldn't attend because he was taking care of his sick mom. Alex's team won 101-98.",
        "Paul is on holidays with his girlfriend. He will send Luke the login and password on Sunday. Luke will wire him the money every month.",
        "Olafur, Nathalie and Zoe are going to a party in Soho for New Year's Eve.",
        "Max and Payton are talking about shopping. Payton likes to browse and try on clothes, but doesn't always buy them. Max and Payton both like reading.",
        "Val and Candy are going to meet. It's raining. They will wait for half an hour and then decide whether to go or not.",
        "Tiffany wants Railey to buy her a burger on her way home.",
        "Andy is going to visit Paul in about an hour.",
        "Tim is thinking about inviting a few people from work over and he wants to consult Joe about it. Joe is always happy to share his expertise with anyone willing to listen. Tim knows that Joe ran the local club. Joe gives Tim some tips on how to organize a newbie gaming evening. Joe suggests starting games before you start drinking and not bringing",
        "Shelly is volunteering at the food shelter this year. Tracy and Jody are not volunteering.",
        "Harry is going to Ikea. Sarah needs a white table cloth 120 cm x 140 cm, two medium size wardrobe organisers (the ones with grey flowers), one wooden spatula and three bottle cleaners. If Harry goes to the food section, Sarah would like a Daim's frozen cake and",
        "John is considering trading for Lamar Jackson.",
        "Finn wants to track his shipment.",
        "Patricia will call George in an hour.",
        "Rory and Mitch are friends. Rory and Mitch are going to sign up Bill and Sammy for an international camp. Mitch will take Bill and Sammy to the camp. Mitch will leave on Sunday, the 29th. Bill will arrive around 10 am on Sunday. Joanna will pick him up.",
        "Jenny, Jeremy and Joan are going to a concert on Saturday. They will start with a drink at 8th av.",
        "Ken has hacked Greg's account and has taken all his money.",
        "John and Joan are going to see \"A Star is Born\" on Thursday at 8pm.",
        "Parker and Jason are discussing the Arrowverse and the DC Universe. Parker has downloaded the latest episode of Arrow Season 7.",
        "Anna will call Peter in 20 minutes.",
        "Harry wants Cindy to call Ela and tell her that he needs to talk to her urgently. Cindy is annoyed because she has to do this all the time.",
        "Melissa is saying that men should be allowed to be masculine.",
        "Catherine applied for an accounting position at Pandora. Jake is still working there. The company offers possibilities of personal development and promotion. The salary increases with each promotion. The company partially finances language and accounting courses. There's also a yearly bonus that depends on your achievements and private healthcare. Catherine will have an interview on Monday. She",
        "Pete is going to buy yogurt for Jen. She wants pear flavour, but if they don't have it, he should not buy anything.",
        "Lincoln broke Hudson's toilet seat. Hudson will try to replace the broken hinge.",
        "Paul will couch the game on Saturday.",
        "Maria is preparing for a conference.",
        "Peggy's computer might be too old to repair. Melody recommends her to buy a new one.",
        "Marleen is going to town in half an hour. She will buy a silk kerchief for Rita.",
        "Sarah will arrive in New York on Thursday. Joshua will be waiting for her gift.",
        "Salma shared a video of a cat. Hugh shared a photo of a cat.",
        "Debbie is asking for help in choosing a dress. Denise and Kelly are helping her. Kelly is going to buy the red dress for herself. The link to the store is <file_other>.",
        "Derek McCarthy needs an Android cable. Tommy's wife, Paulina, will give him one. She will be at home at 8:15 pm.",
        "Ed, Valerie, Chris, Lor, Atnee, Jessica and Matt are discussing about sex. Ed says that sex is for married people. Valerie says that it's a double sin if it's anything but missionary style. Chris says that they should get married and leave them alone. Lor says that they should hope that all",
        "Mick didn't get the confirmation email from AES yet. Barbara did. Mick has to call AES.",
        "Rita needs some information about Salvage Industries. Helen thinks they are legit. Rita wants Helen to double check if they have no PR problems.",
        "Carl and Duncan are discussing the upcoming championship. Carl is participating in it with his Evo 10. Duncan and Carl are cousins. Carl is hoping that his Evo 10 will not let him down this year. Duncan and Carl are planning to attend the championship. Carl will have Duncan and his friends reserved in the VIP",
        "Euodia doesn't know what TikTok is. Domigo explains that it's a new application where you can take videos, edit them with music and special effects, and share them with your friends or on YouTube.",
        "Jane is asking Ainsley if she can help her with her thesis. Ainsley is sick and can't help her.",
        "Georgia is considering buying a new dress.",
        "Sam wants to buy earphones. They are available in the store. Sam wants to have them delivered to him. The delivery costs £4. The earphones are new and white. Sam wants to buy them. The total cost is £187. Sam wants to lower the price to £180. The company policy does not allow",
        "Mike, Tom and Ben are going for a beer.",
        "Ann is going to host her son Tim at Katie's place. Katie will pick him up from the railway station. Ann and Katie have known each other for a long time.",
        "Aimee is looking for Maryam. She tried calling her and went to her home. Soren thinks Maryam might have gone somewhere with her father.",
        "Beth wants to try working in the salon. Deirdre agrees to let her work there for a couple of weeks as work experience.",
        "Conny is going to the library to do research for the paper he has to write.",
        "Hannah and Brooklyn are discussing their New Year's resolutions. Hannah wants to lose weight, learn how to cook and find her future husband. Brooklyn doesn't believe in New Year's resolutions.",
        "Kelly and Betty went to the pub. Kelly met a guy from school. Betty is jealous.",
        "Randal is in the store to buy Sidney a nail polish. He is having trouble finding the right one.",
        "Max's sister is studying in Shanghai, China. She believes it's a good investment.",
        "Greg is coming for a business trip and will stay at Nina's place for two nights.",
        "Luke has booked another flight with easyjet. Erin's flights have been cancelled.",
        "Stan Lee is dead.",
        "Samara and JP are playing. JP has to go to work.",
        "Emma and Daniel are going to Amiens tomorrow. They will meet at Emma's place at 9 am. Daniel has to get up before 7 am.",
        "Sean overslept again.",
        "Steve will call Sue.",
        "Don and Hank are discussing the CSS tests for their kids. The tests are today from 5-8 pm. Don will take the kids next time.",
        "Claire is considering ordering a dress for her wedding.",
        "Miley doesn't want to go to work tomorrow. She wants to sleep and needs some rest. Aaron knows what she feels. He also wants a holiday.",
        "Sarah's PTO request for this week has been denied due to the number of requests. She will be given first choice of dates the week after.",
        "Dan cooked a BBQ for his friends. He will split the cost of the BBQ equally among all his friends. Sara, who wasn't there, will remove herself from the transaction. Eric and Gerardo cooked their own chicken and asparagus.",
        "Eric and Dan have watched Punisher season 2. Eric thinks the first season was better but the second one did some things better. Eric thinks they should have given Jigsaw more scars. They are disappointed that Netflix discontinued Daredevil.",
        "Tony posted a photo of a cat. Amy and Lucas liked it.",
        "Robyn drank too much beer last night.",
        "Laura is waiting for Paul. Paul is almost there. Laura is not waiting any more.",
        "Diana and Frann are going to a hip-hop workshop.",
        "Brenda and Sandra are going to meet up next Saturday for lunch and a trip down memory lane.",
        "Casper, Alexander and Igor are not going to Mr Linda's classes tomorrow. They are going to meet near the university and work something out.",
        "Abigail and Damien are going to church on Sunday.",
        "Rachel and Caron are going to meet at the Red Lion at 8.",
        "Emily is waiting to see her doctor. She is waiting with a nun and a blind crazy man. It feels spooky.",
        "Christine is not going to school tomorrow because she is not well. She has a cold. Annie will drop some Theraflu sachets through Christine's letterbox later on.",
        "Jeremih is mad at his sister. Hansel will tell her to text back.",
        "Ost bought a garage place in the garage. He wants to rent it out and do the restitution of his money. The prices for finding garage places are favorable in this area. The interest rates are very small, almost close to zero. Prices of garage places in Belgrade will only grow. The number of vehicles per family is growing",
        "Barry, Jake, Dave and Kelly are going to march in Women's strike. They will meet around the campus at noon.",
        "Anna and Jerry are discussing the fact that the more they learn about history, the more they realize how miserable the world is. They both find dark humor to be the only thing that makes them feel better.",
        "Zack and Dwayne are talking about the new Jersey Shore season.",
        "Joseph sent a photo of baby cows.",
        "Linda, Ronnie, Karen and Amanda are going to have lunch together. They will have pasta from a place near their apartment and they will take it to the park.",
        "Geri and Hilary are going to the mall tomorrow after work to buy some new heels. They will also have some frozen yogurt.",
        "Bailey and Mikaela are talking about the fabric they have. Bailey has a lot of fabric in her closet and she keeps buying new stuff. Mikaela has a box at Ikea.",
        "Clara and Ron were at Kasia's place last night. There was a weird smell. Ron didn't want to say anything about it. Clara thinks it was Kasia's 21 cats. Ron thinks it was Kasia's sleazy boyfriend. They will never know.",
        "Sebastian and Kevin are talking about Sebastian's life. Sebastian is happy with his life and he is satisfied with his decisions. Sebastian has someone he loves by his side. Kevin wishes he had someone by his side. Sebastian thinks that Kevin will have someone by his side soon.",
        "Robert is looking for a new job.",
        "Inez, Alicja, Gosia and Patrycja are planning another Food Evening. They are going to try Korean food. They will meet on Wednesday.",
        "Simon and Freddy are going to perform at the school concert. Freddy will sing and Simon will play the guitar. Freddy will send Simon three backing tracks.",
        "Adele is coming for Easter. Anne will invite Louise too. Adele will bring eggs.",
        "Marsha, Cynthia, Gavin and Mohammad have planned a trip to Nosy Be with John. They will spend a week in a little hotel.",
        "Charles is worried about his health. He feels bloated and gains weight even though he doesn't eat much. He thinks he may be allergic or intolerant to gluten. Karen suggests that Charles should quit eating gluten for a month and see if he feels better. Monica did the same thing with lactose and she",
        "Peter and Jack are talking about an emergency at school. It was a drill.",
        "Carla and Raul are talking. Raul is not feeling well. He had a bad night and a bad morning. He started off with a cigarette. He doesn't know what triggered him off. Jen stayed at her friend's place last night. Raul was pissed off all the time. He had weird dreams of his",
        "Sawyer, Sutter and Wheeler are going to play a ball game tonight. Wheeler is injured and can't play. Yardley is going to play next time.",
        "Alicja has a job interview tomorrow.",
        "George wants to meet Donna at his place tonight.",
        "Adele has a new dog, a 4-month-old Labrador Retriever named Bones.",
        "Don asked Margot and Yvonne what they bought for Nancy's birthday. Margot bought a bottle of nice wine. Yvonne didn't buy anything yet.",
        "Archie is coming to Judah's place from Southampton. He will arrive around midnight.",
        "Cara wants to pass by Celine's house. Celine is not at home. Celine will drop by in the evening if Cara doesn't mind.",
        "Maya wants to bring home the clothes that are hanging outside. She thinks they should be dry already. Boris is not home right now. He will tell Brian to take care of that.",
        "Sybille is trying to make her son's online registration for the flight AF3581 from Minneapolis to Paris the 29th. She has trouble with it. She has already paid for the ticket but it is not delivered. She is very angry because she has to wait 24 hours to get an answer.",
        "Damian watched Chelsea's game against Huddersfield. Higuain scored twice. Damian is happy for the team. Jacob and Mason didn't watch the game.",
        "Don and Cindy are discussing the arrangements for today's meeting and Don's trip next week.",
        "Robert is visiting his old pals. He thought he could catch Gabriel somewhere, but Gabriel is at home.",
        "Lawrence is working on an article. Madison needs it by today. Lawrence will get back to Madison once he is done.",
        "Zandra is organizing a birthday party for her daughter. She has decorations and food. Tricia is helping her with the cake. Erwin will deliver the cake by bike.",
        "Sally and Tim are going to see Imagine Dragons at the ABC Theatre on 12 July.",
        "Adam is going to take his exam in 10 minutes. He is very nervous. Dave believes in him and wishes him luck.",
        "Mark and Jeff are talking about Jeff's new car. Jeff is driving it.",
        "Pam needs Robert's help with Tom's birthday. She has to go shopping, cook and clean. She also needs to pick up the balloons. Robert will pick up the balloons for her.",
        "Ben and Steven will have pizza tonight at Marco's.",
        "Marta thinks Jay is a pathological liar.",
        "Robin is trying to read up on the poker platform called Bulls Eye. Jacks has played on it several times and made a few bucks. Jacks is sending Robin some links to good sites.",
        "Murphy is going to Poanań on Tuesday and coming back the same day in the afternoon.",
        "Tim has seen his mum today. Louise is with Autumn. Tim forgot about it. Tim doesn't need his mum for anything important.",
        "Steve wants Nick to buy him lunch.",
        "Mika is offering Linda some perennials for her garden. Linda won't be able to do any gardening before leaving.",
        "Joel, Becky and Trent are talking about Coco.",
        "Frank and Hope are in love.",
        "Michelle and Rachel are talking about Monica's pregnancy.",
        "Cindy is sad. She doesn't want to talk about it. Ellie tries to cheer her up. Cindy has seen a funny video that is viral on the internet. Ellie hasn't seen it yet.",
        "Doug has bought new shoes.",
        "Rashi is confused about her career. She has many interests. The teacher advises her to choose a career based on her passion. She should earn and learn.",
        "Jamilla will audition at Antena 3 at 7.30 P.M.",
        "Louis is looking for a gift for Lilly and Stephen's wedding.",
        "Ty wants to know if Veronica speaks French. Veronica doesn't.",
        "Damian is starving and wants Ethan to buy him a kebab. Ethan is annoyed because Damian doesn't cook for him.",
        "Felipe complimented Lydia's legs.",
        "Max has sent Jim his latest music project. Jim will listen to it when he gets home.",
        "Michael can't make it today. He will call Tom tomorrow.",
        "Bradley and Jill are watching a football match at Goodison Park. A cat invaded the pitch. Jill shared a video of the cat.",
        "Mel is going to bring Xander to Mair's at 10:30 tomorrow.",
        "Avril and Frank are going to see horse racing.",
        "Andrew and John are playing a tank game. Andrew is on level 5 and John is on level 10. Andrew is not happy about it. Andrew and John are also talking about World of Warcraft. Andrew's cousin met his wife there. Andrew's favorite genre is RPGs. He likes the Final Fantasy series",
        "Mazie and her girls are going to have a drink tonight. Lee doesn't like Sheryl.",
        "Marvin asked Melany when was the last time she got laid.",
        "Dan asked Kevin to buy him a sandwich on his way to work.",
        "Richard and Anne will meet at Starbucks at 8th street after 3pm to start planning their project. Holy will be back on Monday and will do some research tonight and send it back to them.",
        "Ellie is asking Aaliyah where their classes are now. Aaliyah is at the university. Camille is sick.",
        "Megan asked Nathan if he had any word from Jason. Nathan asked why she asked. Megan told him that Jason was absent today. Susy told her that Jason had a dental appointment.",
        "Drade and Marenda are discussing about Drade's brother. Drade's brother got out of the group chatting room. Marenda thinks Drade's brother is angry. Drade thinks he didn't say anything wrong. Marenda thinks Drade should apologize and send the invitation to his",
        "Olivia has to do her accounts and upload some videos to YouTube. She doesn't do much post-production. Jake also does post-production but he doesn't always have time to do much. Olivia once put on one of her own pieces and it was challenged by Sony Music.",
        "Laura's mom passed away this morning. Laura, Kristian and Anne want to spend more time with her.",
        "Harris's friend Aoki died yesterday. Harris hasn't seen her for a few months.",
        "Ryan and Sebastian are discussing the situation in Ukraine. Ryan is worried about it.",
        "Sarah and Laura are at the same hotel in Linate.",
        "Ursula got a 93 on her French exam. Vaughn got a 65.",
        "Pamela is applying for the RGS grant.",
        "Bob bought a game and wants to play it with Harry. Harry doesn't have money to spend on games.",
        "Hayden has to write his thesis in a month. He doesn't know what studies to choose. He's interested in African studies but he's not sure if he can make good money later on. He was thinking about working as a flight attendant. He can swim, he's a water rescuer, he knows English",
        "Natalie wants to go to the new club at Regents Street. She asks Judy if she can go with her. Judy is going there on Saturday with Miranda and Helen.",
        "Zoey and Thomas are chatting. Zoey is in the tropics and Thomas is in the cold. Thomas is fine and he has a walk around the summit of Belchen.",
        "Carl is waiting for Meg. Meg lost her key and needs 5 minutes more.",
        "Gaia has 6 exams this term.",
        "Madeline and Alex are going for a beer tomorrow.",
        "Jake, Nadia and Vanessa are going to have English today.",
        "Rachel's aunt was in an accident. She's bruised but she's fine. The driver who caused the accident was speeding and didn't see the red light. He's gonna pay for the rehabilitation.",
        "Nick and Jane are chatting. Jane is not interested in meeting Nick for a drink.",
        "Ashleigh got the job. She and Peter are going to the cinema.",
        "Marika is coming today.",
        "Sarah and Lia are discussing their plans for Passover. Sarah is going back home for Passover. Lia is not sure yet. Sarah bought her tickets yesterday for 500 quid. Lia is thinking about asking her family to help her out. Sarah and her family are going to the desert. Lia and her",
        "Anna is inviting everyone to her birthday party on the 6th of November at 19:30.",
        "Huda and Alex are going swimming in 2 hours.",
        "Morgan and Suzanne are chatting. Morgan is going to a concert next week.",
        "Marco found Sandra's present at his place. Sandra wants Marco to bring it over.",
        "Zariah has a pain in her back.",
        "Alan sent an email with an attachment to Ruth. She didn't have any trouble opening it.",
        "Tina and Steve are going to have pasta for dinner. They will meet in the car park after work to do some shopping.",
        "Celia and Mike are planning a holiday. Mike wants to go to Egypt, but Celia suggests Croatia instead.",
        "Ella asked her family to confirm their attendance and to inform her about their dietary requirements. Barbara filled out the form for her mom too.",
        "Freddie is asking Winnie if Nanna is coming to visit them soon. Winnie tells him that Nanna has broken her leg and she will come to visit them instead. Freddie asks Winnie to tell Mummy and Daddy to come when they can.",
        "Maxwell and Jeanice are discussing the payment for the babysitting. Maxwell is grateful for Jeanice's help. Jeanice is going to inform Maxwell about Marcus's behavior at school. Maxwell and Jeanice are going to grab a coffee some time and talk through all the issues.",
        "Hans wants Slade to come to the practice now. Slade agrees. Hans also wants Slade to bring the ball.",
        "Josh and Michelle are going to the movies tomorrow night.",
        "Jack is going to the casting. Ryan is going to come with him.",
        "Lisa and Peter are discussing about their health. Peter is a member of a gym near his office. He does weights and runs on the treadmill. Lisa is thinking of working out a bit. She also thinks she needs to eat better to help her keep in shape. Peter also thinks that sleep is another major requirement for good health.",
        "Daisy is in Naples. She is going to Rome, Florence, Venice and then to San Francisco. Charlie is going to Florence too.",
        "Margaret has a terrible headache.",
        "Trevor has got Abigail pregnant. It's her father's fault.",
        "Tomas is broke and waiting for the grant. Sierra can lend him some money if he needs it.",
        "Hannah is watching the game. James is going to work.",
        "Vinny has a red Mustang.",
        "Whitney and Hailey are going to the cinema to see Aquaman. Shadrack and his girlfriend will accompany them.",
        "Gina asked Warren if he locked the door. Warren confirmed that he did.",
        "Raymond and Charlotte are going to have pizza and pasta. Raymond is going to have a regular cheese and pepperoni pizza and Charlotte is going to have some pesto pennes. Raymond is going to have wine.",
        "Lara will pick up the cake and balloons for Tom's birthday party.",
        "Mia and Steven are going to see a movie at 9pm. They will meet at 8pm to eat Chinese food.",
        "William is making spaghetti. He needs fresh tomatoes and chocolate.",
        "Ally and Jill are working on the same project. Jill has done 20-30 tasks so far. She can't do more than 3-4 tasks per day. Ally has done the same amount of tasks.",
        "Mike wants to know John's new number. Ann doesn't know it. Mike should ask Mary.",
        "Emilia is still angry.",
        "Barbara is home already. Sean is on his way with the dog. He will stay overnight.",
        "Adelina asks Cyprien where he comes from. Cyprien answers that he was born in Jarrow, lives in London now, and was educated in Loughborough. Adelina asks if Cyprien is all right. Cyprien says that he comes from Planet Earth. Adelina says that if Cyprien",
        "Ania, Kasia and Jan will go to the church together tomorrow to praise Mary the Queen of Poland. Zuzia thinks it's inappropriate for a boy to go with them.",
        "Ola will be free by 8.",
        "John and Laurel are going to meet at Jade's collection in town at 5 pm to buy a birthday gift for Diana.",
        "Ken is having a bad day.",
        "Mario has been flying all over Europe today. He is now in Luxembourg.",
        "William is in a queue for the past 20 minutes. He will be back in 5 minutes.",
        "Susan and Jill are talking about Susan's date. Susan's date was perfect. Susan and her date went to rollerskating disco.",
        "Matt got his ticket for Dawid Podsiadlo. He will see Thomas there. Thomas will go by himself.",
        "Sophia sent Mason a photo of her kissing the screen. She's sorry for not being there. Mason is fine. Sophia will send him another photo later.",
        "Stan and Dave are talking about Stan's date with a girl. Stan is going to take her to Pat&Gill's.",
        "Erin is going to the restaurant to do the interview with Ashley. The wifi is better there.",
        "Aude asked Susie if she found plasters for Ted. Susie found them and Ted used them after his shower.",
        "Lindsey has just finished her class. She asked a girl to put her name on the attendance list instead of her. She did the same last week. She gave them a piece of paper with her name written on it.",
        "Brook had an accident yesterday. Gyle is coming home.",
        "Laura, Kelsey, Sid and Oona are going to see Aquaman on Thursday at 8:10 PM. Oona will get the tickets and Laura will pay her back later.",
        "Albert passed his driving exam after the 4th attempt.",
        "Vicky, Audrey, Ludovica, Greg, Michelle, and Ryan are meeting at Fratelli's. Michelle will be there in 10 minutes.",
        "Myah sent a photo of a phone number. Selah can't see the phone number very well. Myah sent a new photo of the phone number. Selah can't see the phone number very well. The phone of that person is off.",
        "Adam called Tina. Tina is still at work. She will call Adam when she gets home.",
        "Ron sent Josh an email.",
        "Cristina and Gaya will meet at Gaya's studio on Wednesday or Friday next week.",
        "Jacopo asked Ludmila if she had a favorite dinosaur when she was a child. Ludmila answered that her favorite dinosaur was triceratops. Jacopo promised to tell her why later.",
        "Joana wants to play some games with Sandy. She will bring Dixit and Carcassonne.",
        "Thelma doesn't have anything to wear. Louisa will bring her a red velvet dress.",
        "Pet shop: Hi Breann&Dianne!👋 🐶😻 Here is a 10% coupon code (pawesome10) for new customers when you checkout! -> <link_other>\r\nBreann: oh thank you!!!!\r\nPet shop: Bre",
        "Jane and Ella went to La Perle. Jane is allergic to peanuts. They ordered a cheesecake. Jane asked if there were any peanuts in it. They ensured her there were no peanuts. Jane started swelling after the first bite. There were crushed nuts in the crust. Jane",
        "Jannet and Nadia are chatting. Nadia and her friends went to Jannet's place yesterday. They had a lot of fun. They will repeat it soon.",
        "Emma and Josh spent New Year's Eve with their friends. Emma and her friends went to the seaside and ended up on the beach for midnight. Emma has a cold now.",
        "Louis and Archie are talking about Melanie. Louis sends a gif of her. Archie sends a photo of her. Archie thinks Melanie was hotter when she had curly hair. Louis disagrees.",
        "Shanon, Victor, Oliver and Sid are discussing their teacher. He's no longer their teacher. He got fired and thrown out of school.",
        "Kim's mom is asking what kind of gift Kim should get for Harry. Harry doesn't need a gift, but he just bought a new sofa and needs pillows.",
        "Jack is 10 minutes late. Laura will wait for him inside.",
        "Peadar, Annette, Helen, James and Oli are going to Jesus bar. Clare is not in town. Anne double booked herself.",
        "Tom and Camilla are going to Dublin this weekend.",
        "Linda missed the train to Amsterdam. The next one is in one hour. It was 80 euros.",
        "Kristian and Tabora are playing a game. Kristian asks Tabora about his preferences. Tabora answers that he prefers Adidas, orange, Batman, and films. Kristian asks Tabora if he wants to keep playing. Tabora agrees.",
        "Adrian and Simon will talk at 5.",
        "Leticia lost her wallet and needs 10$ from Lora.",
        "Carrie has just come back from watching Fantastic Beasts and Where to Find Them. She thinks it's generally good, with nice special effects and visuals, an okay plot, and a glimpse of the wizarding community in the US. Gina saw it last week and she's satisfied. Eddie Redmayne as New",
        "Amelia thanked Lindsay for coming to Elliot's birthday party.",
        "Cole and Luis are roommates. They are in the same room.",
        "Julie watched a Japanese horror movie and is scared. Paula and Rose are coming over to have a sleepover with her.",
        "Evan has the flu and can't make it to his lesson tomorrow. He'll be back next Thursday.",
        "John is at school. Nora talked to his math teacher. Theresa and Nora are his mothers.",
        "Alexander will send a taxi for Tom. Tom and his wife arrived safely, but without their luggage.",
        "Jayden doesn't want to have children now. She wants to have a normal life. She doesn't want to get pregnant. She wants to have sex and wait for a baby. She doesn't want to suffer. She wants to have a good job and be financially independent. She wants to have a good life. She",
        "Hugh and Wanda are going to make pizza. They will arrive, make the pizza base and prepare everything earlier, then stick it in the oven.",
        "Lorenzo, Amanda and Will are in Tuscany. They are going to meet in Florence. Amanda and Will are on the highway. Lorenzo is already in Florence. Amanda and Will are going to arrive in Florence in an hour. Lorenzo is going to take the keys of the room. The room is very nice and they have an",
        "Sam thinks that the guy doesn't like her. Cathy thinks that he does. Sam will talk with him tomorrow.",
        "Sam will bring his son over in the morning.",
        "Dick and Frank are going to see an apartment. Dick is going to buy it. Frank is going to be his neighbor. Dick and Frank have seen 5 apartments in total. Dick is going to bring a measure.",
        "Adele is listening to a song that Kode recommended her. Kode is coming to her home to give her the whole album in USB.",
        "Milena asked Kate and Regina about their presentation. They had a good feedback from 3 people.",
        "Luke's train arrives at 3 pm. Fred will pick him up at 3:15.",
        "Anna will call Mark and give him Marcus's number. Marcus will pick Mark up from the airport at 4 pm on Thursday.",
        "Amanda, Peter and Dan are talking about a guy with dreads. Amanda has not seen him yet. Peter and Dan have seen him and think he is awkward. Amanda is not convinced.",
        "Jess is in a traffic jam in West Bronx.",
        "Tom and his friends are standing near Jeffrey and Elena. They are wearing red jackets.",
        "Lily spent a great night with Thomas, a Romanian guy from a rich family who studies at LSE.",
        "Frederick and Ricky met their new neighbors yesterday. They seem to be nice people, but they are very noisy. They also have a parakeet that wouldn't stop squawking all night long.",
        "Maria, Alexander, Sarah and Lawrence will meet tomorrow evening at 17:15 to discuss the remaining questions and do the calculations.",
        "Sam, Jessica and Michael are going to stay at a hotel in August.",
        "Dan's pipe under the wash basin exploded. Andrea will write to the owner.",
        "Elena and Dorothea are celebrating Dorothea's birthday. Dorothea is going to meet Tom and they are going to eat something in the town. Elena is going to see Dorothea on her party on Saturday.",
        "Gab and Kat are chatting. Gab is trying to convince Kat to meet him in real life.",
        "Freddie and Kelly have just finished watching Mad Men and The Crown on Netflix. Kelly is looking forward to the new episodes of The Crown. Freddie recommends Outlander or The Tudors to Kelly. Jim is watching I, Zombie. Bob recommends Grimm or Sabrina. Kelly thinks they are horrible and disgust",
        "Samuel is in Laos. He is at a place called \"Happy Menu\". He ordered a joint.",
        "Rob wants to sell his flat because he and his wife are thinking about having a baby and it is too small. He is looking for a three bed flat.",
        "Craig needs help with his computer. Derek will be there in 20 minutes.",
        "Janette has mice in her kitchen.",
        "Derek asks Judy if she is leaving for the weekend. Judy says no. Derek asks Judy if she can feed his animals on Friday and Saturday. Judy agrees. Derek asks Judy if she can have his keys on Thursday. Judy agrees. Derek will tell Judy the details later.",
        "Susan's presentation was a disaster. Becky has a fever and Susan needs Tom to pick her up. Tom will pick her up and take her to his mother's house.",
        "Matt and Nick are discussing the internet connection. Matt needs it for an application. Nick usually uses his mobile service.",
        "Sara asked Victor if he was free this Saturday to help with an event. Victor is busy this Saturday.",
        "Anthony and Robert are going to meet in the evening.",
        "Sean won't be able to take the car to the carwash today. He has to finish a report. Alice is disappointed because the car is dirty. They will leave a bit earlier tomorrow and get the car washed somewhere on the road.",
        "Today is derby day. Julius and Titus are supporting Manchester United and Manchester City respectively.",
        "Dan, Tim, Chris and Martin are going out on Saturday. Tom is not going. They will start at 8 and finish at 8 if they are lucky. Dan and Martin need to be home at 2 and ready to drive on Sunday noon.",
        "David babysat Ethan's sister. Avery got a text from Ethan.",
        "Camila and Harper are going to stay in tonight. They are going to order a take-away, buy a bottle of wine and watch a movie.",
        "Mr. Benson is in Peru discussing a contract with a new client. He needs to discuss some matters with his team.",
        "Kate is at the grocery store. She is buying an apple for George.",
        "Jacky and David will talk later.",
        "Paul came back home after a busy day. He forgot about his physiotherapy. Emma will be home after midnight. Paul will prepare some food for her.",
        "Betty and Phil are going to the cinema tonight. They will watch a thriller. They will meet at 6.30pm near the theatre. Betty will prepare dinner for Phil.",
        "Chris and June pushed some girls into the pool.",
        "Kate wants to borrow Emilly's blue handbag on Friday for Monica's wedding. Emilly will bring it to the office tomorrow.",
        "Calum and Bethany are discussing a job ad for a computer investigator.",
        "Andre read the news about the bear attack on the zoo. Megan is not surprised the bear reacted that way.",
        "Lauren will work tomorrow. Pam will call her in the morning to let her know if there are more rota. Lauren had a good holiday and will tell Pam about it tomorrow.",
        "Anne found out that Mark lied about his age.",
        "Aldo sent Marco an email with an article. Marco will print it and read it right now.",
        "Ella's mom won a hundred thousand dollars in the lottery.",
        "Tommy got home from the station.",
        "Kayla will bring her at 11 am.",
        "Phil is on his way from one client to another. Rob wants to talk to him. Phil will be in Rob's office first thing tomorrow morning.",
        "Ella received a photo of Maya from Caleb.",
        "Jenny asked Maria and Louis where Mary lives now. Maria and Louis told her that Mary moved to Southampton in December.",
        "Dan got an injection with anaesthesia. It doesn't work any more and it hurts. He is swollen.",
        "Thessalia and Mike are celebrating Christmas.",
        "Ditty is back from his trip. Inga collected a parcel for him. He will be home around 6 pm.",
        "Henny and Frances are exchanging New Year's wishes. Frances has sent a photo of a beautiful view from her holiday flat in the Vosges. She and her family had a great time there.",
        "Jason and Mike are going to the gym after work. Jason will bring his food and they will play Destiny 2 on PS4 afterwards.",
        "Beatrice is in town, shopping. She found nice scarfs in the shop next to the church. Leo doesn't need a scarf.",
        "Joanna has a stain on her dress. Ethel advises her to take it to a dry-cleaner's.",
        "Nathan and Deborah are going to the forest with their daughters tomorrow. Nathan will see the dentist after work. Deborah will pick up the girls from school. Nathan will buy the syrup for travel sickness on his way from work.",
        "Jake pulled a TOTW. He's going to sell it and try him in one or two matches. Tom's luck with pulls is bad this year.",
        "Mia needs to buy a flight ticket. She doesn't have a credit card. Tom will help her.",
        "Dodson and Trish are going to the seaside for winter break. Winslow and Reeve are going to the seaside too. Booker is going to Italy for skiing.",
        "George, Robert, Yousuf and Paul are going to play basketball on Friday at 7 p.m. Paul will bring some beers.",
        "Angie has severe stomach pain and she's going to see Doctor McCormick in an hour.",
        "John and Matt are going to practice today.",
        "Josh wants to buy an iPad. Brian recommends Samsung, Xiaomi, or Sony. Josh's budget is 2000. Brian will call him after work.",
        "Kevin's mum has been calling him all day. Lilian is at Helen's place.",
        "Ian told Kate that Mike had an accident on his motorcycle and broke his leg.",
        "Jill called Sarah and sent her pictures of Bob. Bob is angry with Jill.",
        "Nathan wants to buy a bike in spring. He will hang it on the wall. He also has a stationary bike.",
        "Emma is not hungry and she will be home soon.",
        "Harry sent Jacob a song 3 days ago. Jacob forgot to listen to it. He will listen to it later tonight.",
        "Anna has a stomachache. She had cereal with milk and a banana for breakfast. Joanna thinks Anna should go to the doctor. Anna will bring Joanna a hot tea with fresh mint leaves.",
        "James left the team because the coach annoyed him. Tony knows the coach is annoying but he is good. James already texted the coach.",
        "Keira and Lois are talking about Lois's account.",
        "Adelle didn't clean the hamster cage. Pete asked her to do it after school.",
        "Celine and Mark are on skates.",
        "Jennifer, Jack and Reece are going to watch Mad Max tomorrow evening.",
        "Kim is going to Seoul in April with Jane. Mark is jealous.",
        "Maya is in the pharmacy. Randolph wants her to buy him 5 packs of earplugs.",
        "David wants a new tattoo on his back. He's thinking of a skull and rose. Mike doesn't like the idea. David wants to add something personal to the tattoo. Mike will go with David to get the tattoo.",
        "Mark, Clint and Phil are going to see 'Batman. New Beginning' this Saturday at 7.",
        "Samuel is 35 years old and he is from Telugu, a language spoken in South East India. He is working hard for less than a hundred dollars a month.",
        "Peter asked Joy for the link of her beauty shop. Joy sent him the link.",
        "Amal and Amir are talking about Beyonce's tweet.",
        "Gloria and Emma are discussing the exam. Gloria is going to take the exam in 4 hours. Emma is going to read everything from the website.",
        "Russ and Gurdun are talking. Gurdun is feeling a bit better. He won't be back at the uni tomorrow, but he hopes to be there on Wednesday. Russ had flu like that three months ago. Gurdun's headache is gone. Russ's team won the last match. Gurdun",
        "Martin is asexual.",
        "Josh, Sean and Logan are going to the pub tonight. Logan wants to meet some girls.",
        "Charlotte asks Paula how to pronounce 'Natal lily'. Paula says 'nu tell', 'nu' as in 'number'. The stress is on the second syllable."
    ],
    "outputs_after": [
        "Claire is cooking a curry dish. Linda is also cooking a curry dish.",
        "Alyssa and Derek are talking about Fergie's national anthem. Derek saw it last week.",
        "Ann wants to buy a laptop from Josh. The laptop is available for 250 dollars. Ann will pick it up.",
        "Matt, Phil and Tony are going to see Bon Jovi in Warsaw next July.",
        "Anastasia and Darrell are talking about Anastasia's new school photos. Anastasia is not happy with her school photos. She took a photo of her new school photos. Anastasia is not worried about her school photos.",
        "Mike wants to apply for the research trip. Jake, Florence, Margot and others are going. Jake reminds Mike that it can be harsh in Swazi now. Mike says that Jake should know that it's not even Swazi anymore. Margot says that the country's name has been changed to Eswatini.",
        "Nathalie, Pauline, Jacob and Anthony are planning a holiday. They are thinking about Greece. Nathalie and Pauline are going to Greece with their husbands. They are going to Greece in August. Nathalie's sister is getting married on August 10. They are going to Greece for 10 days.",
        "Kim is looking for fresh ramal fish in Warsaw. She has already tried Polna street market. Margot suggests Kim to check restaurants' menus and ask about their source. Kim is going to grill the fish as a surprise for a special occasion.",
        "Malik and Samantha are going to try the paleo diet together. They will also go for runs together.",
        "Suzy asked Linda to follow her on Instagram.",
        "Angelina and Jones are going to meet in the afternoon in town.",
        "Erin has baked a cake. Zachary is busy cleaning the flat.",
        "Piper is waiting for the payment from Bryan. Bryan's manager will send it tonight.",
        "Ulysses and Peter got an A. Julia got a B. Martha can check her grades online on the course page.",
        "Cora and Ellie are talking about a meet and greet with James Charles in Birmingham. About 8000 fans showed up for it, causing a gridlock around the mall. British media made a fuss about it.",
        "Adam's friend saw Tim with a guy. Julia knew Tim was gay. Adam and Nate didn't know. Julia didn't tell them. They think it's not fair that Tim didn't tell them.",
        "Lily wants to rent a popcorn machine for her office Christmas party. She will screen Love Actually. Daniel will check if he knows someone who rents them.",
        "Phil is still in the shop. He couldn't find any parking place and now he's standing in a gigantic queue. Nancy will make an apple pie for Phil.",
        "Timmy had a bad day at work. Gemma is organizing a BBQ at the weekend.",
        "Shaldona and her partner are getting married. They sent a wedding invitation to Piper through Messenger. Piper is upset because Shaldona didn't have time to meet her in person to give her the invitation.",
        "Perry, Marlow, Janet and Forster are going to meet tomorrow evening to discuss their holiday plans.",
        "Joyce wants to take the car to get Harry. Kyle is running late and has to go to a mechanic because the car is making a weird noise. Joyce is supposed to go get Harry by bus, but she thinks it's ridiculous. Kyle will get Harry.",
        "Tim is running late. Gary will go in and make some small talk to delay the main presentation.",
        "Ella heard that Molly met up with Chuck on Friday.",
        "Taylor is having a party tomorrow at 8 PM. Harry is going to be there.",
        "Christie and Katie had a great party.",
        "Chandler needs money to pay the delivery guy standing outside his door.",
        "Carlton, Ana and Katy are going to see a film by Lola Arias. The film is about the making of the play Carlton saw last year. They will meet at Ana's place for an early dinner/drinks and then grab an uber.",
        "Ollie, Kelly, Mickey and Jessica are talking about scary places. Ollie's turn is next. Kelly's turn is next. Mickey's turn is next. Jessica's turn is next. Ollie's turn is next. Kelly's turn is next. Mickey's turn is next",
        "Ariana is going shopping in Midtown. Aviana wishes she could go with her.",
        "Johnatan, Darren and Lucas are going to have a beer in the evening.",
        "Lisa wants Bob to clean the bathroom.",
        "Noah and Sophie are discussing the quince. Sophie is going to collect them from Noah's terrace. The twins are coming home this weekend and they will collect the quince.",
        "Chloe is on TV. She is participating in a programme where women undergo a complete metamorphosis.",
        "Shari and Stewart are discussing the current political situation. Stewart is surprised that the man he voted for is doing such a bad job. Shari is not surprised, she always knew he was an ignorant man. Stewart and Shari are planning to vote for anyone else but him. They are also planning to volunteer to get out the voters.",
        "Michelle is researching about the update.",
        "Martin won two cinema tickets. He will go to see the new film with Redford.",
        "Catherine and Ben are going to visit uncle Steve. Ben doesn't want to go. Catherine wants Ben to come with them. Ben doesn't want to. Catherine says that the boys want to see Ben. Ben says that he can visit them some other day. Catherine says that uncle Steve will be disappointed. Ben says that he doesn'",
        "Abby talked to Miro yesterday at the party. Miro's father came from Albania to the US in the early 1990s.",
        "Marty has sprained his ankle and can't pick up Marcel from school. Christine will pick up Marcel from school and take Marty to the doctor.",
        "Molly has a free ticket to the Muse concert in Cracow. Anna wants to go with her.",
        "Paul will be home later than he thought. He will call Lena in 15 minutes and then he will tell her what happened.",
        "Jane is going to Value Village with her sister to get Halloween costumes. Connor already got his costume there. Jane is going to meet Connor there.",
        "Adam will take the dog for a walk.",
        "Joanne is going back home to France for the holidays. Her parents separated a few months ago. Joanne is going to cheer her mum up. Evelyn invites Joanne to spend Christmas with her.",
        "Rita and Tina are tired and bored at work.",
        "Adam has a gossip for Katia and Borys. Iga and her boyfriend were supposed to go on a weekend getaway, but they had to cancel because her boyfriend couldn't talk his group into changing the date of the presentation. Iga is pissed.",
        "Chris and Rick are going to skype tomorrow at 3 pm Rick's time.",
        "Joyce found a cheap flight.",
        "Andy has tested the mould in Betty's house and found out that it is caused by condensation. The mould is mostly on the windows and walls of the spare bedroom and the dining room because they have external walls which are cooler than internal walls. The mould is not in other rooms because they have internal walls.",
        "Peter didn't get into Stanford. Matt and Oliver got in. Peter has to look for other university.",
        "Phil wants to go out today. Phoebe can't go out because her mum is still angry. Phoebe used her mum's perfume and broke it. The whole house stinks now.",
        "Stanley and Bill are working on the Lidem project. Stanley is finishing the analysis for the previous project. Alison is out of touch. Stanley is going to talk to Del.",
        "Dominique asks Denise what's for the test tomorrow. Denise answers that it's units 2 and 3.",
        "Luke and Martial are going to the coach's office tomorrow morning to let him know that they are ready to play despite their injuries.",
        "Natalie is looking for her wallet. Jenny is not at home. Tobias has found Natalie's wallet.",
        "Ivan and Eric are talking about Eric coming to Ivan's brother's wedding. Eric doesn't know if he can come because he has a lot to do at home and he doesn't know if his parents would let him. Ivan will take care of his parents.",
        "Danna is angry because she called her friends and they are not around or are busy. Reed is in bed and he is off tomorrow.",
        "Ricky, Shelly and Tom are discussing the weather outside. Ricky is reminding Tom about a time when he was hiking in the mountains. Tom was a student and he went with a group of friends. They rented a cabin in the wild.",
        "Amelia is asking Emily about her favourite colour.",
        "Claire is going to the conference about relations at school. Aaron is giving two lectures and is a host there. Claire is going to attend Jo's workshop on teamwork.",
        "Rachel and Janice are discussing the Top 50 Best Films of 2018.",
        "Matthew has a cold. Lisa advises him to drink orange juice and make some soup. Matthew will try. Lisa believes in him. Matthew will take a rest.",
        "Joanne wants to talk to Bradley. Bradley is busy at work.",
        "Edward doesn't want to go on a business trip tomorrow. Lauren is stressed. Kate is okay with the boss coming. Edward thinks it's just a few meetings with clients. Kate says they're going to an expo. Lauren and Kate agree that people coming to their booth have nothing to do with what they're doing.",
        "Jesse has an idea to do something for the less fortunate this year. He suggests to choose one of the wish lists of the Refuge and chip in. Jesse is in for the third list. Lee and Melvin agree to help.",
        "Emma wants to take a stroll with the little ones. Abigail doesn't think it's a good idea because the smog alert app shows that the norms have been exceeded by 30%.",
        "Miranda wants to cancel tomorrow's meeting with Stephanie.",
        "James and Mia are going to the art exhibition of their lecturer in philosophy, Professor Evans, tomorrow. They will also go to the cinema with Amelia.",
        "Mary is broke and needs a few box. Carter will lend her a few box in an hour.",
        "James, Mary and Patricia are going to Japan. Patricia is scared of the long flight, earthquakes and tsunamis. James and Mary try to calm her down.",
        "Steffen twisted his ankle yesterday and can't walk on it. He can't go to the infinity pool.",
        "Rob is at the grocery store and Ann is at a meeting. Ann wants Rob to buy some food. Rob is going to buy cucumber, tomatoes, bananas, apples and whatever Rob likes.",
        "Emily is asking where the next ASEEES conference takes place. James says it will be in San Francisco. Chloe hopes for Hawaii, but James says it won't happen too soon.",
        "Helen forgot her laptop at home and needs Debbie to bring it to her.",
        "Janice's son wants a hamster for his birthday. Martina advises against it.",
        "Casey has done her nails herself. She used a new nail polish. It took her nearly 4 hours. Amelia and Kristen want Casey to do their nails too.",
        "Louis and Sara saw a huge crowd outside the book shop today. Louis's friend told him that the writer Cole Grant was there signing copies of his books.",
        "Jack took Josh's notebook home by accident. He will bring it back tomorrow.",
        "Jason and Dory are making a video. Dory's friend is coming over the day after tomorrow and will stay for a week. Jason and Lucy have a script and an app to make the video.",
        "Karine thinks that Trump is not senile and stupid as we would like to believe, but he is pure evil. He is destroying the Earth and trying to shake the world's order. Jennifer thinks that Trump is quite stupid and his persistence and ignorance are dangerous. Mia thinks that they should do anything to win the next elections.",
        "Ray is locked out of his room. Max is out. Ray has to pee.",
        "Kathy and Olivia are going to get their hair cut today. Kathy's aunt is getting her hair cut too.",
        "Jair is still busy.",
        "Mico and Jeff will go to the village party. Mico will drive.",
        "Derek and Phil had a long day. Derek closed some deals but had a lot of stress. Phil couldn't close any deal. Some customers are just fishing for offers.",
        "Joanna's thesis mentor, Lewandowska, is hospitalized because she has measles. Anyone who had contact with her within the last couple of days must get vaccinated. Joanna will try to get vaccinated before work on 18th.",
        "Alexa asked Ethan to insult Hunter.",
        "Gill needs a new peeling. Bunny suggests making her own peeling.",
        "Desiree asked Lucian if he and his wife were at home. Lucian replied that he was not at home. Desiree asked Lucian to keep her pasta in the microwave.",
        "Eric and Samantha are talking about a video. They are also talking about a scandal on the news. Noah is also there.",
        "Tobi, Nicholas, Serena and Ella have been to the new club in Cork. They all think it's a waste of time. Ella and Serena went there last weekend because of the cool ad campaign. The club was empty. Tobi and Nicholas won't risk going there again.",
        "Charlie's sister has just passed her last exam on her Uni. Charlie and his friends want to go out tonight. Frank will join them.",
        "Emma is on the bus. She will arrive in New York around 4.30 PM. She wants to wake up around 4.15 PM.",
        "Kris, Ovi, Jason and Nadine are all cold. Nadine is working at her clinic and they are getting lots of sick patients.",
        "Adam is going to visit his parents tomorrow. The plane was rescheduled and will arrive one hour later. Adam will be there in less than 24 hours.",
        "A guy got beaten and mugged on campus. He's in the hospital, but he'll be fine. The assailant had a mask on.",
        "Karen passed her driving test.",
        "Ginger is coming to Phyllis's house to get some sugar. Phyllis is baking a pie.",
        "Maria is tired of her job. Anastasia and Felix are trying to calm her down.",
        "Daniel, Mary and Lucas are playing Dragon Age. Daniel has just started playing Dragon Age: Inquisition. Mary and Lucas have played it before. Mary loves it. Lucas has played Dragon Age II.",
        "Lenny is going to buy a pair of trousers. He is asking Bob for advice. Bob is telling him to pick the best quality.",
        "Ross wants to do karaoke tonight. Chandler agrees, but only this once.",
        "Michelle loves Kelly. Jared likes Kelly too. Jared wants to ask Kelly out. Michelle doesn't mind.",
        "Fiona needs to go to a doctor tomorrow at 8 a.m. She asked Anna to go with her.",
        "Hollie asked Amy how she was. Amy said she's working now and will get back to Hollie later.",
        "Ying posted a photo of her 10 years challenge.",
        "Kelly is going to wear a red dress. Mary will wear a red dress and bright red lipstick.",
        "Laura and Linda will go to an Italian restaurant tomorrow.",
        "Caroline thinks that her boyfriend's mother doesn't like her. She is his first girlfriend and he lives with his mother and grandmother. He is 26 years old and is an introvert. He is writing something and will text Kate later.",
        "Mary is doing an online job. Mark told his sister about it. Mary doesn't care about what her sister says. Mark is sorry for what his sister did.",
        "Rob and Eve are going to meet up on Sunday morning.",
        "Kirsten and Larry are discussing the post about the insurance. Larry is going to take a look at the email and get back to Kirsten. Kirsten is going to get her husband to sign off on it since they are referencing him. Larry is going to post it. Kirsten is going to stay busy and she is",
        "Owen and Neil think that Amy looks serious all the time. They haven't talked to her.",
        "Sam is upstairs. Kate is downstairs. Jeff is in the little room next to the reception. Kate saw a woman making a cake with a huge penis on it. Sam must see it.",
        "Kelly: Oh! Oh! Can I pick the first question?\nJessica: Sure. Go for it!\nKelly: What's the scariest place you've been to!\n\nJessica: I'll start: Palermo in Italy.\nMickey: And what's so scary about",
        "Mr. Williams and Ms. Blair are going to have a coffee together at 2 p.m.",
        "Pat will come to Bart's place in the evening, around 9pm. Bart will open the door for him. Pat is working on a stage project.",
        "Hannah wants Betty's number. Amanda can't find it. Amanda suggests Hannah to ask Larry. Hannah doesn't know him well. Amanda insists Hannah to text him. Hannah agrees.",
        "Julia is having a bad weekend because her parents are fighting. Ronald will call her when he gets back.",
        "Steve's dishwasher has been installed. It's a 12 place setting one.",
        "Bella and Aria are talking about Valentine's Day. Bella is in Warsaw and Aria is in Seoul. Bella is going to order pizza home. Aria is going to leave work at 6. Bella is going to Korea to get a regular checkup.",
        "Mario wants Conor to bring him a bucket of fries from KFC.",
        "Alivia is having trouble writing her thesis.",
        "Patricia has found a fair-trade brand.",
        "Rob wants to start the Get off the couch challenge. He will start with 30 minutes of activity every day. Greg is already doing at least 60 minutes a day. Will thinks Rob should be realistic. Anna is in.",
        "Sharon's mum is angry with her. Sharon is grounded. She lives with her parents. She is a student. Ahmed wants her to move in with him.",
        "Pegah will be back at 22:00. Miriam invited a few people over and was hoping Pegah would be there too.",
        "Karine and Jessie are watching a video of them at kindergarten.",
        "Bennett is in town and he wants to meet Cynthia. They will meet at a new bistro that Cynthia discovered.",
        "Jess had a dream about being a lion tamer. She wants to go to Africa this summer. Lynn thinks Jess might meet a handsome zookeeper. Charlie thinks Jess might get attacked by a stray cat. Jess doesn't believe in dreams.",
        "Rachel and Wai are going to the museum at 4. They will meet at the main entrance. After that, they will see if anyone will be up to going to some bar.",
        "Grace is out of hand sanitizer. Mike will refill it.",
        "James wants to see Hannah on Saturday.",
        "Callan's Samsung S8 has a black screen. He thinks it overheats and then takes a while to restart. He's going to the store to let them see it. It's still under warranty.",
        "Molly and Margaret are hesitating whether to go to Sweden for a week in January. They bought cheap tickets half a year ago. Peter and Kai think it will be dark and cold. Kai recommends visiting museums, bars etc in Stockholm. Margaret thinks it's not a good time for nature. Peter recommends visiting the V",
        "Bart didn't study for his economy final and ended up with a bad score. He plans on re-taking the class next year. Adrian didn't study much but he did well in his classes.",
        "Jack needs Kev's help. He can't get the application running. Kev will be with him right now.",
        "Gina needs a USB from Monica. Monica has one and is ready to give it to Gina. Gina will go to Monica's office.",
        "Whitney is asking William what they will have for dinner. William is going to cook spaghetti alla vongole. Whitney is asking what vongole means. William explains that it is a kind of seashells, seafood. Whitney is asking how William is going to do that. William explains that he will cook",
        "Rael is fed up with her job. She doesn't have time to eat her lunch. She talked to her manager, but he doesn't understand that they are humans and not robots. She wants to quit, but she needs to find a new job first. Zach suggests her to try IT. He will talk to his friends who",
        "Charlee is in class. She is studying Portuguese theatre at the university. She is preparing a performance. The performance is a Polish one translated into Portuguese. The writer is Mrożek.",
        "Bobby is annoyed by pharmaceutical companies inventing illnesses. He found a commercial for mints that were being sold as a medical product. The pharmaceutical industry is worth at least $1.2 billion.",
        "Luke asked Gina to send him the picture of the parrot she painted yesterday. Gina sent him a photo. If he wants better quality, she can send him a PDF file. Luke thinks the parrot looks fantastic. Gina sent him a PDF file.",
        "Sam is looking for a nice black dress for his wife. He wants it to be a surprise gift. Sarah from the fashion store is helping him. She is sending him some pictures of dresses. Sam chooses the cut, sleeves, length and buttons of the dress.",
        "Holt is looking for a birthday gift for his sister. She is 21 years old. Olive suggests cosmetics. Zula suggests DVDs or book series. Holt will get her a set of DVDs and some cosmetics.",
        "Maria and Spencer are catching up. Maria is working at a call centre and wants to go part time next year to start freelancing. Spencer is working at a cafe and doing illustrations. He earns around £1000 a month from his illustrations.",
        "Jay and Joe are going to Kenya for a concert. Jay will lend Joe some money for the tickets. Jay has convinced Ruth and Paulette to accompany them. Joe will pay Jay back next time.",
        "Tom is asking who is around. Jack is saying Tom's dick is around. Tom is telling Jack to go fuck himself. Robert is not in town.",
        "Nova and Dominic are discussing Timothée Chalamet's photoshopped portraits in artworks.",
        "Tanya asked Rosie if she was better today. Rosie said she was better but not good. Tanya was relieved.",
        "Kyle wants to call Lily and Mary in 10 minutes.",
        "Serena and Jeff are talking about Jeff's skin condition. Jeff says that he doesn't have to take meds all the time. Serena will tell Tina about it.",
        "Aubrianna's friend's dad died because of malaria in Kongo. Darien says it's dangerous for all people not just whites.",
        "Will is standing in a long line at the post office. He hates queues. He is sending a letter. Chris is in a line at the post office too. He thinks it's a part of everyday life in a big city. Will is annoyed that the line is full of elderly people who don't have bank accounts and",
        "Iris's husband Pete has got an interview. Iris's parents are glad that she found a decent man. Pete will be home in an hour.",
        "Jen is fed up with her boyfriend. He's being a pain again. Jen is going to tell him to move out. Jane is right. Jen has to cut her losses and move on.",
        "Ema is coming to the movie in 5 minutes.",
        "James is going to drive Richard to the airport. Richard should be ready at 6:15.",
        "Sally, Tom, Jane, Greg and Henriette are talking about Natalie. Sally is telling them that Natalie is pregnant and the father is Dave.",
        "Biwott told Chloe about a series. Chloe hasn't watched it yet, but she will watch it during the weekend.",
        "Marek sent Adam a picture of a guy's ass. Adam thinks it's creepy.",
        "Mell and Gloria are planning a barbecue at Mell's house on Saturday.",
        "Carol has a lot of fruit from her garden. Jacob will come to pick it up on Wednesday at 6pm.",
        "Nate has received an excel file with all the registrations. The registrations are transformed into text in Excel. Nate has to create a new file and feed the data into the tables himself.",
        "Mike will call Dale back in 2 hours.",
        "Eva is going to a party. She will leave in an hour. Olivia will keep Linta ready and her bag too. Eva will pick Linta up from Olivia's place.",
        "Paul wants to know what color flowers Cindy wants. Cindy doesn't want yellow flowers. Paul asks if Cindy wants pink flowers. Cindy doesn't want pink flowers. Paul asks Cindy what color flowers she wants. Cindy wants red roses.",
        "Cathy left her sunglasses at Broke's place. She will come to pick them up at 10 tonight.",
        "Allison got a scholarship.",
        "Martha wants to buy lenses similar to Ophelia's. Ophelia recommends Crazy Lenses.",
        "Alex and Benjamin are talking about the basketball game. Benjamin couldn't attend because he is taking care of his sick mom.",
        "Luke is joining Netflix family. Paul will send him login and password on Sunday. Luke will wire him the money every month. Paul is on holidays with his girl.",
        "Olafur, Nathalie and Zoe are going to a party at Breakfast at Tiffany's club in Soho for New Year's Eve. The tickets cost 100$.",
        "Max and Payton are talking about shopping. Payton likes browsing and trying on clothes, but doesn't always buy them. Max likes shopping too, but he doesn't like buying everything he likes. Payton also loves reading books.",
        "Val and Candy are going to meet. It's raining. They will wait for half an hour and then decide whether to go or not.",
        "Tiffany wants Railey to buy her a burger on her way home.",
        "Andy is coming to Paul's house in about an hour.",
        "Tim is thinking about inviting a few people from work over and he wants to consult Joe about the idea. Joe is always happy to share his expertise with anyone willing to listen. Tim knows that Joe ran the local club. Joe gives Tim some tips on how to organize a newbie gaming evening. Joe suggests starting games before you start drinking and not",
        "Shelly is volunteering at the food shelter this year. Tracy is not into volunteering. Jody does some charity work every year for Christmas.",
        "Harry is going to Ikea. Sarah needs a white table cloth 120 cm x 140 cm, two medium size wardrobe organisers (the ones with grey flowers), one wooden spatula and three bottle cleaners. If Harry goes to the food section, Sarah would like a Daim's frozen cake and",
        "John is considering trading for Lamar Jackson.",
        "Finn wants to track his shipment.",
        "Patricia will call George in an hour.",
        "Rory is asking Mitch to take Bill and Sammy to Croatia. Mitch will leave on Sunday, the 29th.",
        "Jenny, Jeremy and Joan are going to a concert on Saturday. They are going to start with a drink at 8th av.",
        "Ken hacked Greg's account and sent a message to him.",
        "John and Joan are going to see \"A Star is Born\" on Thursday at 8pm.",
        "Parker and Jason are discussing the Arrowverse. Parker is downloading the latest episode of Arrow Season 7.",
        "Anna is still at work and will call Peter in 20 minutes.",
        "Harry wants Cindy to call Ela and tell her that he needs to talk to her urgently. Cindy is annoyed because she has to do this all the time.",
        "Melissa is saying that men should be allowed to be masculine.",
        "Catherine applied for an accounting position at Pandora. Jake is still working there. The company offers possibilities of personal development and promotion. The salary increases with each promotion. The company partially finances language and accounting courses. There's also a yearly bonus that depends on your achievements and private healthcare. Catherine will have an interview on Monday. She",
        "Jen wants pear yogurt. Pete will look for it. If they don't have pear, Jen doesn't want any other flavour.",
        "Lincoln broke Hudson's toilet seat. Hudson will try to replace the hinge.",
        "Paul will couch the game on Saturday.",
        "Maria is preparing for a conference.",
        "Peggy's computer might be too old to repair. Melody recommends her to buy a new one.",
        "Marleen is going to town in half an hour. She is considering buying a silk kerchief for Rita. Barry is at home.",
        "Sarah will arrive in New York on Thursday. Joshua will be waiting for her gift.",
        "Salma sent a video file. Hugh sent a photo file.",
        "Debbie is asking for help in choosing a dress. Denise and Kelly are helping her. Debbie is going to buy the green dress. Kelly is considering buying the red dress for herself.",
        "Derek McCarthy needs an Android cable. Tommy's wife Paulina will give him one.",
        "Ed, Valerie, Chris, Lor, Atnee, Jessica and Matt are discussing about sex. Ed says that sex is for married people. Valerie says that it's a double sin if it's anything but missionary style. Chris says that they should get married and leave them alone. Lor says that they should hope that all",
        "Mick didn't get the confirmation email from AES yet. Barbara did. Mick has to call them.",
        "Rita needs some information about Salvage Industries. Helen will check if they have any PR problems.",
        "Carl is participating in the championship this year. He is using a 6 speed hydrolic shift gearbox. Duncan and Carl are going to attend the championship.",
        "Euodia doesn't know what TikTok is. Domigo explains that it's a new application where you can take videos, edit them with music and special effects, and share them with your friends or on YouTube. Euodia feels old because she doesn't know what TikTok is.",
        "Jane is asking Ainsley if she can help her with her thesis. Ainsley is sick and can't help her.",
        "Georgia is thinking about buying a new dress.",
        "Sam is interested in a product. Lia informs him that the product is available and can be delivered to him. The product costs £187. Sam wants to lower the price to £180, but Lia says that it's not possible. The product will generally arrive the next day.",
        "Mike, Tom and Ben are going for a beer.",
        "Ann is going to send a text to Katie to confirm that her son will be picked up tomorrow. Ann and Katie are old friends.",
        "Aimee is looking for Maryam. She tried calling her and went to her home. Soren thinks Maryam might have gone somewhere with her father.",
        "Beth wants to try working in the salon. Deirdre will give her a tenner or so per session to start off for her lunch, coffee and bus fare etc. If she likes, they'll take it from there.",
        "Conny is going to the library to do research for the paper he has to write.",
        "Hannah and Brooklyn are talking about their New Year's resolutions. Hannah wants to lose weight, learn how to cook and find her future husband. Brooklyn doesn't believe in New Year's resolutions.",
        "Kelly and Betty went to the pub. Kelly met a guy from school. Betty is jealous.",
        "Randal is in a store to buy Sidney a nail polish. He is having trouble finding the right one.",
        "Max's sister is studying in Shanghai, China. She believes it's a good investment.",
        "Greg is coming for a business trip and will stay at Nina's place for two nights.",
        "Luke has booked another flight with easyjet.",
        "Stan Lee is dead.",
        "Samara and JP are playing. JP has to go to work.",
        "Emma and Daniel are going to Amiens tomorrow. They will meet at Emma's place at 9am.",
        "Sean overslept again.",
        "Steve will call Sue.",
        "Don and Hank are going to the CSS tests today. Don will take the kids next time.",
        "Claire is looking for a dress for her wedding. She found a dress that she likes. The price of the dress is good. The dress is very beautiful.",
        "Miley doesn't want to go to work tomorrow. She wants to sleep and needs some rest. Aaron knows what she feels. He also wants a holiday.",
        "Sarah's PTO request for this week has been denied due to the number of requests. She will be able to take off the following week, Monday through Wednesday.",
        "Dan cooked a BBQ. He will split the cost of the BBQ equally among all the people who ate from it. Sara, who wasn't there, will remove herself from the transaction. Eric and Gerardo cooked their own chicken and asparagus.",
        "Eric and Dan watched Punisher season 2. Eric thinks the first season was better. Dan agrees. Eric thinks they should have given Jigsaw more scars. Dan agrees.",
        "Tony posted a photo of a cat. Amy and Lucas liked it.",
        "Robyn drank too much beer last night.",
        "Laura is waiting for Paul. Paul is almost there. Laura is not waiting any more.",
        "Diana is going to a hip-hop workshop and she invites Frann to come with her. The workshop is for beginners. It will be next week.",
        "Brenda and Sandra are going to meet up next Saturday for lunch and a trip down memory lane.",
        "Casper, Alexander and Igor are not going to attend Mr. Linda's classes tomorrow. They are going to meet near the university and work something out.",
        "Abigail and Damien are going to church on Sunday.",
        "Rachel and Caron are going to meet at the Red Lion at 8.",
        "Emily is waiting to see her doctor. She is waiting with a nun and a blind crazy man. It feels spooky.",
        "Christine is not going to school tomorrow because she is not well. She has a cold. Annie will drop some Theraflu sachets through Christine's letterbox later on.",
        "Jeremih is mad at his sister. Hansel will tell her to text back.",
        "Ost bought a garage place in the garage. He wants to rent it out and do the restitution of his money. The prices for finding garage places are favorable in this area. The interest rates are very small, almost close to zero. Prices of garage places in Belgrade will only grow. The number of vehicles per family is growing",
        "Barry, Jake, Dave and Kelly are going to march in Women's strike. They will meet around the campus at noon.",
        "Anna and Jerry are discussing the fact that the more they study, the more they think it makes no sense. They learn about historical moments in their civilization, names and dates, great moments of human race and their mistakes. They develop utopian concepts of how the world should look like. They face corruption, politics, war, conflicts, hatred",
        "Zack and Dwayne are talking about the new Jersey Shore season.",
        "Joseph sent a photo of baby cows.",
        "Linda, Ronnie, Karen and Amanda are going to have lunch together. They are going to have pasta from a place near their apartment. They will take it to the park.",
        "Geri and Hilary are going to the mall tomorrow after work to buy some heels. They will also have some frozen yogurt.",
        "Bailey and Mikaela are talking about the fabric they have. Bailey has a lot of fabric in her closet and she keeps buying new stuff. Mikaela has a box at Ikea.",
        "Clara and Ron were at Kasia's place last night. They noticed a weird smell. They think it was Kasia's 21 cats. Ron thinks it was Kasia's sleazy boyfriend. Clara doesn't know what it was.",
        "Sebastian and Kevin are talking about Sebastian's life. Sebastian is very happy with his life. He has learned a lot and he has someone he loves by his side. Kevin wishes he had someone by his side. Sebastian thinks that Kevin will find someone soon.",
        "Robert is looking for a new job.",
        "Inez, Alicja, Gosia and Patrycja are planning their next Food Evening. They are going to explore Korean cuisine. They will meet on Wednesday.",
        "Simon and Freddy are discussing the school concert. Freddy is going to sing at the concert. Simon will send Freddy his email address so that Freddy can send him the backing tracks.",
        "Adele is coming for Easter. Anne will invite Louise too. Adele will bring eggs.",
        "Marsha, Cynthia, Gavin and Mohammad have planned a trip with John to Nosy Be. They will spend a week in a little hotel.",
        "Charles is worried about his health. He feels bloated and gains weight even though he doesn't eat much. He thinks he may be allergic or intolerant to gluten. Karen suggests that Charles should quit eating gluten for a month and see if he feels better. Monica did the same thing with lactose and she",
        "Peter and Jack are talking about an emergency at school. It was a drill.",
        "Carla and Raul are talking. Raul had a bad night and a bad morning. He started off with a cigarette. He doesn't know what triggered him off. Yesterday, Jen had to go to a friend. She had broken up with her boyfriend and Jen went to sit with her and stayed for the night. Raul",
        "Sawyer, Sutter and Wheeler are going to play a ball game tonight. Sawyer and Sutter are going to play at 8. Wheeler is injured and can't play. Yardley is going to play next time.",
        "Alicja has a job interview tomorrow.",
        "George wants to meet Donna to discuss a delicate matter.",
        "Adele has a new dog, a 4-month-old Labrador Retriever named Bones.",
        "Margot bought a bottle of wine for Nancy's birthday.",
        "Archie is coming to Judah's place from Southampton. He will arrive around midnight. He will be travelling by bus.",
        "Cara wants to pass by Celine's house, but Celine is not at home. Celine will call Cara in the evening if she decides to come.",
        "Maya wants to bring home the clothes that are hanging outside. She thinks they should be dry already. Boris is not home right now. He will tell Brian to take care of that.",
        "Sybille is trying to make her son's online registration for the flight AF3581 from Minneapolis to Paris the 29th. She has trouble with it. She is angry because it cost her more than 40 euros for 20 minutes on your short number 3654, and still",
        "Damian watched Chelsea's game against Huddersfield. Higuain scored twice. Damian is happy for the team. Jacob and Mason didn't watch the game.",
        "Don and Cindy are discussing the arrangements for today's meeting and Don's trip next week. Don is meeting with the management board today at 2 pm in the conference room. Catering will bring some tea, coffee and snacks. Don is not sure if Andy read the agenda. Cindy booked the hotel for",
        "Robert is visiting his old pals. He thought he could catch Gabriel at his office, but Gabriel quit the office about a month ago. Robert is meeting Darek at 5pm.",
        "Lawrence is working on an article. He will get back to Madison once he is done.",
        "Zandra is organizing a birthday party for her daughter. She has decorations and food, but she needs a cake. Tricia is going to send Erwin to get the cake. Zandra is worried about the cake, but Tricia is sure that Erwin will deliver it on time. Zandra is also worried about the outside attractions",
        "Sally and Tim are going to see Imagine Dragons at the ABC Theatre on 12 July.",
        "Adam is going to take his exam in 10 minutes. He is very nervous. Dave believes in him and wishes him luck.",
        "Mark and Jeff are talking about Jeff's new car. Jeff is driving it.",
        "Pam asked Robert to pick up the balloons for Tom's birthday.",
        "Ben and Steven will have pizza tonight at Marco's.",
        "Marta thinks Jay is a pathological liar.",
        "Robin is trying to read up on the poker platform Bulls Eye. Jacks has played on it several times and made a few bucks. He will send Robin some links to good sites.",
        "Murphy is going to Poanań on Tuesday and coming back the same day in the afternoon.",
        "Tim has seen his mum today. Louise is with her. Tim forgot about it. Louise is with her. Tim doesn't need her for anything important.",
        "Steve wants Nick to buy him lunch.",
        "Mika is offering Linda some plants for her garden. Linda won't be able to do any gardening before leaving.",
        "Joel is asking about Coco. Becky and Trent are saying that Coco is behaving well.",
        "Frank and Hope are in love.",
        "Michelle and Rachel are talking about Monica's pregnancy.",
        "Cindy is sad because something happened. She doesn't want to talk about it. Ellie tries to cheer her up. Cindy has seen a video that is viral on the internet. Ellie has not seen it, but it is very funny.",
        "Doug has bought new shoes.",
        "Rashi is confused about her career. She has many interests. The teacher advises her to choose a career based on her interests. She should earn and learn.",
        "Jamilla will audition at Antena 3 at 7.30 P.M.",
        "Louis is looking for a wedding gift for Lilly and Stephen.",
        "Ty wants to know if Veronica speaks French. Veronica doesn't.",
        "Damian is starving and wants Ethan to buy him a kebab.",
        "Felipe complimented Lydia's legs.",
        "Max is working on his latest music project. Jim will listen to it when he gets home.",
        "Michael can't make it today. He will call Tom tomorrow.",
        "Bradley and Jill are watching a football match between Everton and Manchester United. Bradley is a Manchester United fan and Jill is an Everton fan. Bradley is watching the match at Goodison Park. Bradley and Jill are discussing the match. Bradley is watching the match on TV. Bradley is watching the match",
        "Mel is going to bring Xander to Mair's at 10:30 tomorrow.",
        "Avril and Frank are going to see horse racing.",
        "Andrew and John are playing a tank game. Andrew is on level 5 and John is on level 10. Andrew is not happy with the game because he can't beat John. Andrew is a fan of RPGs.",
        "Mazie and her girls are going to have a drink tonight. Lee doesn't like Sheryl.",
        "Marvin asked Melany when was the last time she got laid.",
        "Dan asked Kevin to buy him a sandwich on his way to work.",
        "Richard and Anne will meet at Starbucks at 8th street after 3pm tomorrow to start planning their project. Holy will be back on Monday but will do some research tonight and send it back to them.",
        "Ellie is asking Aaliyah where their classes are now. Aaliyah is at the university. Camille is sick.",
        "Megan is asking about Jason. Nathan is asking why she is asking. Megan is asking because Jason was absent today. Susy is telling that Jason had a dental appointment.",
        "Drade and Marenda are discussing about Drade's brother. Drade's brother got out of the group chatting room. Marenda thinks Drade's brother is angry. Drade thinks he didn't say anything wrong. Drade's brother failed in his business. Drade thinks his brother acted",
        "Olivia has to do her accounts and upload some videos to YouTube. She doesn't do much post-production. Jake also does post-production but he doesn't always have time to do it. One time he put on one of his own pieces and it was challenged by Sony Music.",
        "Laura's mom passed away this morning. Laura is sad. Anne and Kristian want to spend more time with Laura.",
        "Harris's friend Aoki died yesterday. She lived in Michigan.",
        "Ryan and Sebastian are discussing the situation in Ukraine. Ryan has a bad feeling about it. Sebastian hopes that the leaders of nations will react somehow to this situation.",
        "Sarah and Laura are at the same hotel in Linate.",
        "Ursula got a 93 on her French exam. Vaughn got a 65.",
        "Pamela is thinking about applying for the RGS grant. Zoe and Xiara tried to apply for it last year, but they weren't lucky. Pamela will have a look at the RGS website.",
        "Bob bought a game and wants to play it with Harry. Harry doesn't have money to spend on games.",
        "Hayden has to write his thesis in a month. He doesn't know what studies to choose. He's interested in African studies, but he's not sure if he can make good money later on. He's thinking about working as a flight attendant. He can swim, he's a water rescuer, he",
        "Natalie wants to go to the new club at Regents Street. Judy is going there on Saturday with Miranda and Helen.",
        "Zoey and Thomas are chatting. Zoey is in the tropics and Thomas is in the cold. Zoey is sending Thomas a gif. Thomas is fine. Zoey is asking Thomas how he is doing. Thomas is fine. Zoey is asking Thomas if everything is ok. Thomas is fine. Zo",
        "Carl is waiting for Meg. Meg needs 5 minutes more.",
        "Gaia has 6 exams this term.",
        "Madeline and Alex are going for a beer tomorrow.",
        "Jake, Nadia and Vanessa will not have English today.",
        "Rachel's aunt was in a car accident. She's bruised but she's fine. The driver who caused the accident was speeding and didn't see the red light. He's gonna pay for the rehabilitation.",
        "Nick and Jane are chatting. Nick is trying to ask Jane out for a drink. Jane is not interested.",
        "Ashleigh got the job. She and Peter are going to the cinema.",
        "Marika is coming today.",
        "Sarah and Lia are discussing their plans for Passover. Sarah is going back home for Passover. Lia is not sure yet. Sarah bought her tickets for 500 quid. Lia is thinking about asking her family to help her out. Sarah and her family are going to the desert. Lia and her family",
        "Anna is inviting everyone to her birthday party on the 6th of November at 19:30.",
        "Huda and Alex are going swimming in 2 hours.",
        "Morgan and Suzanne are talking. Morgan is going to a concert next week.",
        "Marco found Sandra's present at his place. Sandra wants Marco to bring it over.",
        "Zariah has a pain in her back.",
        "Alan sent an email with an attachment to Ruth. Ruth didn't get it. Alan sent it again. Ruth got it and didn't have trouble opening the attachment.",
        "Tina and Steve will meet in the car park after work to do some shopping for dinner.",
        "Celia and Mike are planning a holiday. Mike wants to go to Egypt, but Celia suggests Croatia instead.",
        "Ella asked her family to confirm their attendance and to inform her about any dietary requirements. Barbara filled out the form for her mother too.",
        "Freddie is asking Winnie if Nanna is coming to visit them soon. Winnie tells him that Nanna has broken her leg and will not be able to visit them. Freddie asks Winnie to come instead. Winnie tells him that he should ask his parents to come when they can. Freddie asks W",
        "Maxwell and Jeanice are discussing the payment for the babysitting. Maxwell is grateful for Jeanice's help. Jeanice is going to inform Maxwell about Marcus's behavior at school. Maxwell and Jeanice are going to grab a coffee some time and talk through all the issues.",
        "Hans wants Slade to come to the practice. Slade agrees. Hans also wants Slade to bring the ball.",
        "Josh and Michelle are going to the movies tomorrow night.",
        "Jack is going to the casting. Ryan is going to come with him.",
        "Lisa and Peter are discussing about their health. Peter is working out in the gym near their office. Lisa is thinking of working out too. Peter also suggests that Lisa should eat better and sleep well to stay healthy.",
        "Daisy is in Naples. She is going to Rome, Florence, Venice and then to San Francisco. Charlie is going to take a train to Florence. Daisy and Charlie will meet in Florence from 1-5 of September.",
        "Margaret has a terrible headache.",
        "Trevor has got Abigail pregnant. It's her father's fault.",
        "Tomas is broke and waiting for the grant. Sierra can lend him some money.",
        "Hannah is watching the game. James is going to work.",
        "Willy and Vinny are talking about Vinny's new car.",
        "Whitney and Hailey are planning to go to the cinema to watch Aquaman. Shadrack and his girlfriend will be accompanying them.",
        "Gina asked Warren if he locked the door. Warren confirmed that he did.",
        "Raymond can't decide between pizza and pasta. Charlotte will come over in 15 minutes and they will have both.",
        "Gary and Lara are going to Tom's birthday party. Lara will pick up the cake and balloons.",
        "Mia and Steven are going to see a movie at 9pm. They will meet at 8pm to eat Chinese food.",
        "William is making spaghetti. He needs fresh tomatoes and chocolate for after the dinner.",
        "Ally and Jill are working on the same project. Jill has done 20-30 tasks so far. She can't do more than 3-4 tasks per day. She works 40 hours per week.",
        "Mike wants to know John's new number. Ann doesn't know it. Mike should ask Mary.",
        "William is still angry.",
        "Barbara is home already. Sean is on his way with the dog. He will stay overnight.",
        "Adelina asks Cyprien where he comes from. Cyprien answers that he was born in Jarrow, lives in London now, and was educated in Loughborough. Adelina asks if Cyprien is all right. Cyprien says that he comes from Planet Earth. Adelina says that if Cyprien",
        "Ania, Kasia and Jan are going to the church tomorrow. Zuzia thinks it's inappropriate for a boy to go with them.",
        "Ola will be free by 8.",
        "John and Laurel will meet at Jade's collection in town at 5 pm tomorrow to buy a birthday gift for Diana.",
        "Ken is having a bad day.",
        "Mario has been flying all over Europe today. He is now in Luxembourg.",
        "William is in a queue for the past 20 minutes. He will be back in 5 minutes.",
        "Susan went on a date with a guy who picked her up from home. He was dressed nicely and they went to a rollerskating disco. Susan had a great time.",
        "Matt got a ticket for Dawid Podsiadlo. He will see Thomas there. Thomas will go by himself.",
        "Sophia sent Mason a photo of her kissing the screen. Mason said he would love her the same whether she had makeup on or not. Sophia said she would send him another photo when she takes a shower and looks good.",
        "Stan and Dave are discussing Stan's date with a girl. Stan is going to take her to Pat&Gill's.",
        "Erin is going to the restaurant to do the interview with Ashley.",
        "Aude asked Susie if she found plasters for Ted. Susie found them and Ted used them after his shower.",
        "Lindsey has just finished her class. She asked another girl to put her name on the attendance list. She did the same last week. She gave them a piece of paper with her name written on it.",
        "Brook had an accident yesterday. Gyle is coming home.",
        "Laura, Kelsey, Sid and Oona are going to see Aquaman on Thursday at 8:10 PM. Oona will buy the tickets and Laura will pay her back later.",
        "Albert has passed his driving exam after the 4th attempt.",
        "Vicky, Audrey, Ludovica, Greg, Michelle, and Brandon are meeting at Fratelli's. Michelle will be there in 10 minutes.",
        "Myah sent a photo of a phone number. Selah can't see the phone number very well. Myah sent a new photo of the phone number. Selah says the phone of that person is off.",
        "Adam called Tina. Tina is still at work. She will call Adam when she gets home.",
        "Ron sent Josh something he wanted.",
        "Cristina and Gaya will meet up next week to discuss the shoot. They will meet at Gaya's studio. Cristina is more free on Wednesday and Friday.",
        "Jacopo asked Ludmila if she had a favorite dinosaur when she was a child. Ludmila said that her favorite dinosaur was triceratops. Jacopo will tell her why later.",
        "Joana wants to play some games with Sandy. She will bring Dixit and Carcassonne.",
        "Thelma doesn't have anything to wear. Louisa will bring her a red velvet dress.",
        "Pet shop: Hi Breann&Dianne!👋 🐶😻 Here is a 10% coupon code (pawesome10) for new customers when you checkout! -> <link_other>\r\nBreann: oh thank you!!!!\r\nPet shop: Bre",
        "Jane and Ella went to La Perle. Jane is allergic to peanuts. They ordered a cheesecake. Jane asked if there were any peanuts in it. They ensured her there were no peanuts. Jane started swelling after the first bite. There were crushed nuts in the crust. Jane",
        "Jannet and Nadia are talking about their night out. Nadia and her friends went to Jannet's place yesterday. They had a lot of fun. Nadia and her friends are going to repeat it soon.",
        "Emma and Josh spent New Year's Eve differently. Emma and her friends went to the seaside and visited clubs. Josh and his friends stayed at his place and played board games. Emma is now sick.",
        "Louis and Archie are talking about Melanie. Louis sends a gif of Melanie. Archie sends a photo of Melanie. Archie thinks Melanie was hotter when she had curly hair. Louis disagrees.",
        "Shanon, Victor, Oliver and Sid are discussing their teacher. He's no longer their teacher. He got fired and thrown out of school.",
        "Kim's mom is asking what kind of gift Kim should get for Harry. Harry doesn't want a gift, but he needs pillows for his new grey sofa.",
        "Jack is 10 minutes late. Laura will wait for him inside.",
        "Peadar, Annette, Helen, James and Oli are going to Jesus bar. Clare is not in town. Anne double booked herself.",
        "Tom and Camilla are going to Dublin this weekend.",
        "Linda missed the train. The next one is in one hour. It was 80 euros. She was shocked.",
        "Kristian and Tabora are playing a game. Kristian asks Tabora what he prefers: Adidas or Nike? Tabora answers that he prefers Adidas. Kristian asks Tabora what he prefers: watermelon or orange? Tabora answers that he prefers orange. Kristian asks",
        "Adrian and Simon will talk at 5.",
        "Leticia lost her wallet and she needs 10$ from Lora.",
        "Carrie just saw Fantastic Beasts and Where to Find Them. She liked it. Gina saw it last week and she was satisfied. Alex is thinking of going this weekend with Lane, but he's seen some bad reviews. Carrie says that it depends on what you expect. If you're expecting to have your mind blown",
        "Amelia thanked Lindsay for coming to Elliot's birthday party.",
        "Cole and Luis are roommates. They are in the same room.",
        "Julie watched a Japanese horror movie and is scared. Paula and Rose are coming over to have a sleepover with her.",
        "Evan has the flu and can't make it to his lesson tomorrow. He'll be back next Thursday.",
        "John is at school.",
        "Alexander will send a taxi for Tom. Tom will arrive safely, but without luggage.",
        "Jayden doesn't want to have children now. She wants to have a normal life, not to get pregnant. Brennan wants to have children.",
        "Hugh and Wanda are going to make pizza. They will arrive, make the base and prepare everything earlier, then stick it in the oven.",
        "Lorenzo, Amanda and Will are in Tuscany. Lorenzo and Amanda are in the same room. Will is on the train in Arezzo. Amanda and Will are on the highway. Lorenzo has just arrived. Amanda and Will are still on the highway. Will is not that close. Amanda and Will need at least another hour",
        "Sam thinks that the guy doesn't like her. Cathy thinks that he does. Sam will talk with him tomorrow.",
        "Sam will bring his son over in the morning at about 9.",
        "Dick and Frank are going to see an apartment. Dick wants to buy it. Frank knows the apartment and can talk Dick into buying it. Dick and Frank have seen 5 apartments in total. Dick and Frank are going to meet in 30 minutes.",
        "Adele is listening to a song that Kode recommended her. Kode is coming to Adele's home to give her the whole album in USB.",
        "Milena asked Kate and Regina about their presentation. They had a good feedback from 3 people.",
        "Luke's train arrives at 3 pm. Fred will pick him up at 3:15.",
        "Anna is going to pick Mark from the airport. Marcus is not going to pick him up.",
        "Amanda, Peter and Dan are talking about a guy with dreads. Peter thinks he's awkward, Dan thinks he's cool. Amanda is not convinced.",
        "Jess is in a traffic jam in West Bronx.",
        "Tom and his friends are near Jeffrey and Elena. They can't see them.",
        "Lily spent a great night with Thomas, a Romanian guy from a rich family who studies at LSE.",
        "Frederick and Ricky met their new neighbors yesterday. They seem nice, but they are very noisy. They also have a parakeet that wouldn't stop squawking all night long.",
        "Maria, Alexander, Sarah and Lawrence will meet tomorrow evening at 17:15 to discuss the remaining questions and do the calculations.",
        "Sam, Jessica and Michael are going to stay at a hotel next month. Sam and Jessica are going to arrive at the hotel around 2 p.m. on the 15th of August.",
        "Dan's pipe under the wash basin exploded. Andrea will write to the owner.",
        "Elena and Dorothea are celebrating Dorothea's birthday. Dorothea is going to meet Tom and they are going to eat something in the town. Elena is going to see Dorothea on her party on Saturday.",
        "Gab and Kat are chatting. Kat is busy and doesn't want to meet Gab in real life.",
        "Freddie and Kelly have just finished watching Mad Men and The Crown on Netflix. Kelly is looking forward to new episodes of The Crown. Freddie recommends Outlander or The Tudors for Kelly to watch. Jim is watching I, Zombie. Bob recommends Grimm or Sabrina. Kelly finds them horrible and disgust",
        "Samuel is in Laos. He is at a place called \"happy menu\". He ordered a joint.",
        "Rob wants to sell his flat because he and his wife are thinking about having a baby and it is too small. He is looking for a three bed flat.",
        "Craig needs help with his computer. Derek will come to help him in 20 minutes.",
        "Janette has mice in her kitchen.",
        "Derek asks Judy if she is leaving for the weekend. Judy says no. Derek asks Judy to feed his animals on Friday and Saturday. Judy agrees. Derek will give Judy his keys on Thursday.",
        "Susan's presentation was a disaster. Becky has a fever and Susan needs Tom to pick her up. Tom will pick her up and take her to his mother's house.",
        "Matt and Nick are discussing the internet connection. Matt needs it for an application. Nick usually uses his mobile service.",
        "Sara asked Victor if he was free this Saturday to help with an event. Victor is busy this Saturday.",
        "Anthony and Robert are going to meet up for a beer later. Anthony is going to meet Andrew in the evening.",
        "Sean won't be able to take the car to the carwash today. He has to finish a report first. Alice is disappointed because the car is very dirty. They will leave a bit earlier tomorrow and get the car washed somewhere on the road.",
        "Today is derby day. Julius and Titus are supporting Manchester United and Manchester City respectively.",
        "Dan, Tim, Chris and Martin are going out on Saturday. Tom is not going. They will start at 8 and finish at 8 if they are lucky. Dan and Martin need to be home at 2 and ready to drive on Sunday noon.",
        "David went to Ethan's house to babysit. Ethan's sister was naughty. David will refuse next time. David's phone was switched off.",
        "Camila and Harper are going to stay in tonight. They are going to order a take-away, buy a bottle of wine and watch a movie.",
        "Mr. Benson is in Peru discussing a contract with a new client. He needs to discuss a couple of matters with his team.",
        "Kate is at the grocery store. George wants an apple for school tomorrow. Kate is also getting an apple. Tangerines are coming next week.",
        "Jacky and David will talk later.",
        "Paul has just come back home. He had a busy day and forgot about his physiotherapy. He will schedule a new appointment. Emma will be home after midnight. Paul will prepare some food for her.",
        "Betty and Phil are going to the cinema tonight. They will watch a thriller. They will meet at 6.30pm near the theatre. Betty will prepare dinner for Phil.",
        "Chris and June pushed some girls into the pool.",
        "Kate wants to borrow Emilly's blue handbag on Friday for Monica's wedding. Emilly will bring it to the office tomorrow.",
        "Bethany and Calum are discussing a job ad for a computer investigator.",
        "Andre read the news about the bear attack on the zoo. Megan is not surprised the bear reacted that way.",
        "Lauren will work tomorrow. Pam will call her in the morning to let her know if there are more rota. Lauren had a good holiday and will tell Pam about it tomorrow.",
        "Anne found out that Mark lied about his age.",
        "Aldo sent Marco an email with an article. Marco will print it and read it right now.",
        "Ella's mom won a hundred thousand dollars in the lottery.",
        "Tommy got home from the station.",
        "Kayla will bring her at 11.",
        "Phil is on his way from one client to another. Rob wants to talk to him. Phil will be in Rob's office first thing tomorrow morning.",
        "Ella received a photo of Maya from Caleb.",
        "Jenny asked Maria and Louis where Mary lives now. Maria and Louis told her that Mary moved to Southampton in December.",
        "Dan got an injection with anaesthesia. It doesn't work anymore and it hurts. He is swollen.",
        "Thessalia and Mike are celebrating Christmas.",
        "Ditty is back from his trip. He is jet-lagged. Inga collected a parcel for him. Hans is away.",
        "Henny and Frances are exchanging New Year's wishes. Frances is back from a holiday in the Vosges. She and her family had a great time there. They cooked partly and also had meals in a local.",
        "Jason and Mike are going to the gym after work. Jason will bring his food and they will play Destiny 2 on PS4 afterwards.",
        "Beatrice is in town, shopping. She found nice scarfs in the shop next to the church. Leo doesn't need a scarf.",
        "Joanna has a dress with coffee stains. She's asking Ethel for advice. Ethel recommends her to take it to a dry-cleaner's. There's a cheap one at Jagiellonska 3.",
        "Nathan and Deborah are going to the forest with their daughters tomorrow. Nathan will see the dentist after work. Deborah will pick up the girls from school. Nathan will buy the syrup for travel sickness on his way from work.",
        "Jake has just pulled a TOTW. He's going to sell it and try it in one or two matches. Tom has not pulled any great players this year.",
        "Mia wants to buy a flight ticket. She doesn't have a credit card. Tom will help her.",
        "Dodson and Trish are going to the seaside for winter break. Winslow is going home. Booker is going to Italy for skiing.",
        "George, Robert, Yousuf and Paul are going to play basketball on Friday at 7 p.m. Paul will bring some beers.",
        "Angie has severe stomach pain. She's on her way to the clinic. Doctor McCormick will see her in an hour.",
        "John asks Matt if they have practice today. Matt confirms that they do. John thanks Matt and says he'll see him there.",
        "Josh wants to buy an iPad. Brian recommends Samsung, Xiaomi, or Sony. Josh's budget is 2000. Brian will call him after work.",
        "Kevin's mum has been calling him all day. Lilian is at Helen's place.",
        "Ian told Kate that Mike had an accident on his motorcycle and broke his leg.",
        "Jill called Sarah and sent her pictures of Bob. Bob is angry.",
        "Nathan wants to buy a bike in spring. He will hang it on the wall. He also has a stationary bike.",
        "Emma is not hungry and will be home soon.",
        "Harry sent Jacob a song 3 days ago. Jacob forgot to listen to it. He will listen to it later tonight.",
        "Anna has a stomachache. She ate cereal with milk and a banana for breakfast. Joanna thinks that maybe the milk was bad. Anna doesn't think so. Joanna thinks that maybe the banana was bad. Anna doesn't think so. Joanna thinks that maybe Anna just needs to go to the bathroom. Anna",
        "James left the team because the coach annoyed him. Tony knows the coach is annoying but he's good. James already texted the coach.",
        "Keira and Lois are talking about Lois's account. Lois is thinking of deleting it. Keira saw Lois's sister in town.",
        "Adelle didn't clean the hamster cage. Pete asked her to do it after school.",
        "Celine and Mark are on skates.",
        "Jennifer wants to watch the latest Mad Max film with Jack and Reece tomorrow evening.",
        "Kim is going to Seoul in April with Jane. Mark is jealous.",
        "Maya is in the pharmacy and she will buy 5 packs of earplugs for Randolph.",
        "David wants a new tattoo. He's thinking of a scull and rose on his back. He wants to add something else to make it more personal. Mike will go with him to get one.",
        "Mark, Clint and Phil are going to see 'Batman. New Beginning' this Saturday at 7.",
        "Samuel is 35 years old and he is from Bangalore, India. He is a Telugu speaker. He is working hard for less than a hundred dollars a month. He is younger than Tim.",
        "Joy sent Peter the link to her beauty shop.",
        "Amal and Amir are talking about Beyonce's tweet.",
        "Gloria is going to take an exam in 4 hours. She has to read and write as fast as she can. Emma is going to read everything from a website that Gloria found.",
        "Russ and Gurdun are talking. Gurdun is feeling a bit better but still weak. He won't be back at the uni tomorrow, but he hopes to be there on Wednesday. Russ had flu like that three months ago. Gurdun had a headache, but it's gone now. Russ's team",
        "Martin is asexual.",
        "Josh, Sean and Logan are going to the pub tonight. Logan wants to meet some girls.",
        "Charlotte asks Paula how to pronounce 'Natal lily'. Paula says 'nu tell', 'nu' as in 'number'. The stress is on the second syllable."
    ],
    "best_params": "{'do_sample': True, 'generation_seed': 42, 'max_new_tokens': 70, 'no_repeat_ngram_size': 0, 'stopping_criteria': [<llmsearch.scripts.stopping_criteria.MultiTokenStoppingCriteria object at 0x7fe3468afa90>], 'temperature': 0.1, 'top_k': 70}"
}